[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:28:83
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property || typeof property !== "object" || !("stops" in property)) return ["Stryker was here"];

[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:30:37
-     if (!Array.isArray(stops)) return [];
+     if (!Array.isArray(stops)) return ["Stryker was here"];

[NoCoverage] ObjectLiteral
packages/core/src/adapters/interpolator/gsap.ts:56:12
-       return { initial: {}, segments: [] };
+       return {};

[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:56:37
-       return { initial: {}, segments: [] };
+       return { initial: {}, segments: ["Stryker was here"] };

[NoCoverage] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:75:49
-         if (stop.ease !== undefined) segmentEases[index - 1] = stop.ease;
+         if (stop.ease !== undefined) segmentEases[index + 1] = stop.ease;

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:28:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (false) return [];
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:28:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if ((!property || typeof property !== "object") && !("stops" in property)) return [];
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:28:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (false || !("stops" in property)) return [];
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:28:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property && typeof property !== "object" || !("stops" in property)) return [];
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:28:20
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property || false || !("stops" in property)) return [];
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:30:7
-     if (!Array.isArray(stops)) return [];
+     if (false) return [];
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] MethodExpression
packages/core/src/adapters/interpolator/gsap.ts:31:10
-     return stops.filter((stop): stop is AuthoredStop =>
-       Boolean(
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
-       ),
-     );
+     return stops;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
+         true,
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
+         stop && typeof stop === "object" && typeof (stop as {
+     p?: unknown;
+   }).p === "number" && Number.isFinite((stop as {
+     p: number;
+   }).p) || "v" in stop,
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
+         true &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
+         true &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
+         stop && typeof stop === "object" && typeof (stop as {
+     p?: unknown;
+   }).p === "number" || Number.isFinite((stop as {
+     p: number;
+   }).p) &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
+         stop && typeof stop === "object" || typeof (stop as {
+     p?: unknown;
+   }).p === "number" &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
+         true &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:33:7
-         stop &&
-           typeof stop === "object" &&
+         stop || typeof stop === "object" &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:34:9
-           typeof stop === "object" &&
+           true &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:35:9
-           typeof (stop as { p?: unknown }).p === "number" &&
+           true &&
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:43:7
-     if (!config || typeof config !== "object") return 1;
+     if (true) return 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:43:7
-     if (!config || typeof config !== "object") return 1;
+     if (false) return 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:43:7
-     if (!config || typeof config !== "object") return 1;
+     if (!config && typeof config !== "object") return 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] BooleanLiteral
packages/core/src/adapters/interpolator/gsap.ts:43:7
-     if (!config || typeof config !== "object") return 1;
+     if (config || typeof config !== "object") return 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:43:18
-     if (!config || typeof config !== "object") return 1;
+     if (!config || false) return 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:43:18
-     if (!config || typeof config !== "object") return 1;
+     if (!config || typeof config === "object") return 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:43:36
-     if (!config || typeof config !== "object") return 1;
+     if (!config || typeof config !== "") return 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:45:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return false ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:45:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) || duration >= 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:45:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && duration >= 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:45:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" || Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:45:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:45:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && true ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:45:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration !== "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:45:30
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:45:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && duration > 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:45:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && duration < 0 ? duration : 1;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:52:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (false)
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:52:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if ((!config || typeof config !== "object") && !("keyframes" in config))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:52:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (false || !("keyframes" in config))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:52:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (!config && typeof config !== "object" || !("keyframes" in config))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:53:37
-       return { initial: {}, segments: [] };
+       return { initial: {}, segments: ["Stryker was here"] };
Tests ran:
    adapter ports adapts a GSAP-like timeline without leaking the engine object

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:52:18
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (!config || false || !("keyframes" in config))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    adapter ports adapts a GSAP-like timeline without leaking the engine object
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:55:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if ((!keyframes || typeof keyframes !== "object") && Array.isArray(keyframes))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:55:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (false)
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:55:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (false || Array.isArray(keyframes))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:55:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (!keyframes && typeof keyframes !== "object" || Array.isArray(keyframes))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:55:21
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (!keyframes || false || Array.isArray(keyframes))
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:60:38
-     const segmentDurations: number[] = [];
+     const segmentDurations: number[] = ["Stryker was here"];
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:65:9
-       if (first === undefined) continue;
+       if (false) continue;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:67:25
-       for (let index = 1; index < stops.length; index += 1) {
+       for (let index = 1; index <= stops.length; index += 1) {
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:70:11
-         if (previous === undefined || stop === undefined) continue;
+         if (false) continue;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:70:11
-         if (previous === undefined || stop === undefined) continue;
+         if (previous === undefined && stop === undefined) continue;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:70:11
-         if (previous === undefined || stop === undefined) continue;
+         if (false || stop === undefined) continue;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:70:37
-         if (previous === undefined || stop === undefined) continue;
+         if (previous === undefined || false) continue;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:71:37
-         const segment = segmentValues[index - 1] ?? {};
+         const segment = segmentValues[index + 1] ?? {};
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:75:11
-         if (stop.ease !== undefined) segmentEases[index - 1] = stop.ease;
+         if (true) segmentEases[index - 1] = stop.ease;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:75:11
-         if (stop.ease !== undefined) segmentEases[index - 1] = stop.ease;
+         if (false) segmentEases[index - 1] = stop.ease;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state
