[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:75:11
-         if (stop.ease !== undefined) segmentEases[index - 1] = stop.ease;
+         if (stop.ease === undefined) segmentEases[index - 1] = stop.ease;
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] OptionalChaining
packages/core/src/adapters/interpolator/gsap.ts:99:9
-           timeline.to?.(proxy, {
-             ...segment.values,
-             duration: segment.duration * duration,
-             ease: segment.ease,
-           });
+           timeline.to(proxy, {
+     ...segment.values,
+     duration: segment.duration * duration,
+     ease: segment.ease
+   });
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:101:21
-             duration: segment.duration * duration,
+             duration: segment.duration / duration,
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state

[NoCoverage] StringLiteral
packages/core/src/adapters/browser-clock.ts:26:37
-         if (disposed) throw new Error("Clock is disposed.");
+         if (disposed) throw new Error("");

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:26:11
-         if (disposed) throw new Error("Clock is disposed.");
+         if (false) throw new Error("Clock is disposed.");
Tests ran:
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ArrowFunction
packages/core/src/adapters/browser-clock.ts:28:14
-         return () => listeners.delete(listener);
+         return () => undefined;
Tests ran:
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] BooleanLiteral
packages/core/src/adapters/browser-clock.ts:32:18
-         disposed = true;
+         disposed = false;
Tests ran:
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:31:11
-         if (disposed) return;
+         if (false) return;
Tests ran:
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:33:11
-         if (handle !== undefined) source.cancelFrame(handle);
+         if (true) source.cancelFrame(handle);
Tests ran:
    adapter ports ticks through an injected frame source and cancels on dispose

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:85:27
-         throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+         throw new TypeError(``);

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:103:53
-       if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+       if (tick < this.#lastTick) throw new RangeError("");

[NoCoverage] BlockStatement
packages/core/src/runtime/graph-runtime.ts:118:21
-       } catch (error) {
-         // A failed drain must not swallow the follow-up it was carrying.
-         for (const seed of carried) this.#pendingSeeds.add(seed);
-         throw error;
-       } finally {
+       } catch (error) {} finally {

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:142:28
-         throw new RangeError("Clock ticks must be strictly increasing.");
+         throw new RangeError("");

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:146:41
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+       if (this.#disposed) throw new Error("");

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:24:7
-         "A flush requested while subscribers were being notified was queued as one follow-up " +
+         "" +
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:22:20
-       path: ids.join(","),
+       path: ids.join(""),
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:26:15
-       severity: "warning",
+       severity: "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:25:7
-         "invalidation for the next tick.",
+         "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] BlockStatement
packages/core/src/runtime/graph-runtime.ts:68:35
-     get publisher(): GraphPublisher {
-       return this.#publisher;
-     }
+     get publisher(): GraphPublisher {}
Tests ran:
    GraphRuntime I-13 owns one registry, one publisher, one state, and one clock subscription

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:84:9
-       if (!this.#binding.graph.nodeById[nodeId])
+       if (false)
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:103:9
-       if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+       if (false) throw new RangeError("Runtime ticks must be monotonic.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:133:9
-       if (this.#disposed) return;
+       if (false) return;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:140:9
-       if (this.#disposed) return;
+       if (false) return;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 2 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/graph-runtime.ts:134:22
-       this.#disposed = true;
+       this.#disposed = false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:141:9
-       if (event.tick <= this.#lastTick)
+       if (false)
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 2 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-runtime.ts:141:9
-       if (event.tick <= this.#lastTick)
+       if (event.tick < this.#lastTick)
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 2 more tests!

[Survived] BlockStatement
packages/core/src/runtime/graph-runtime.ts:145:23
-     #assertLive(): void {
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
-     }
+     #assertLive(): void {}
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:146:9
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+       if (false) throw new Error("GraphRuntime is disposed.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 9 more tests!
