[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:99:21
-             duration: segment.duration * duration,
+             duration: segment.duration / duration,
Tests ran:
    adapter ports compiles authored stops onto an adapter-owned proxy state
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state
