[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:34:83
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property || typeof property !== "object" || !("stops" in property)) return ["Stryker was here"];

[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:36:37
-     if (!Array.isArray(stops)) return [];
+     if (!Array.isArray(stops)) return ["Stryker was here"];

[NoCoverage] ObjectLiteral
packages/core/src/adapters/interpolator/gsap.ts:62:12
-       return { initial: {}, segments: [] };
+       return {};

[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:62:37
-       return { initial: {}, segments: [] };
+       return { initial: {}, segments: ["Stryker was here"] };

[NoCoverage] ObjectLiteral
packages/core/src/adapters/interpolator/gsap.ts:80:44
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(stop.ease === undefined ? {} : {}),

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:34:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (false) return [];
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:34:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if ((!property || typeof property !== "object") && !("stops" in property)) return [];
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:34:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (false || !("stops" in property)) return [];
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:34:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property && typeof property !== "object" || !("stops" in property)) return [];
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:34:20
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property || false || !("stops" in property)) return [];
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:36:7
-     if (!Array.isArray(stops)) return [];
+     if (false) return [];
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] MethodExpression
packages/core/src/adapters/interpolator/gsap.ts:37:10
-     return stops.filter((stop): stop is AuthoredStop =>
-       Boolean(
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
-       ),
-     );
+     return stops;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
+         true,
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
+         stop && typeof stop === "object" && typeof (stop as {
+     p?: unknown;
+   }).p === "number" && Number.isFinite((stop as {
+     p: number;
+   }).p) || "v" in stop,
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
+         true &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
+         stop && typeof stop === "object" && typeof (stop as {
+     p?: unknown;
+   }).p === "number" || Number.isFinite((stop as {
+     p: number;
+   }).p) &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
+         true &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
+         stop && typeof stop === "object" || typeof (stop as {
+     p?: unknown;
+   }).p === "number" &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
+         true &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:39:7
-         stop &&
-           typeof stop === "object" &&
+         stop || typeof stop === "object" &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:40:9
-           typeof stop === "object" &&
+           true &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:41:9
-           typeof (stop as { p?: unknown }).p === "number" &&
+           true &&
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:49:7
-     if (!config || typeof config !== "object") return 1;
+     if (true) return 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:49:7
-     if (!config || typeof config !== "object") return 1;
+     if (false) return 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:49:7
-     if (!config || typeof config !== "object") return 1;
+     if (!config && typeof config !== "object") return 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] BooleanLiteral
packages/core/src/adapters/interpolator/gsap.ts:49:7
-     if (!config || typeof config !== "object") return 1;
+     if (config || typeof config !== "object") return 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:49:18
-     if (!config || typeof config !== "object") return 1;
+     if (!config || false) return 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:49:36
-     if (!config || typeof config !== "object") return 1;
+     if (!config || typeof config !== "") return 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:49:18
-     if (!config || typeof config !== "object") return 1;
+     if (!config || typeof config === "object") return 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:51:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return false ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:51:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) || duration >= 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:51:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" || Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:51:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && duration >= 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:51:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:51:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && true ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:51:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration !== "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:51:30
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:51:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && duration > 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:51:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && duration < 0 ? duration : 1;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:58:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (false)
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:58:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if ((!config || typeof config !== "object") && !("keyframes" in config))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:58:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (false || !("keyframes" in config))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:58:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (!config && typeof config !== "object" || !("keyframes" in config))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:59:37
-       return { initial: {}, segments: [] };
+       return { initial: {}, segments: ["Stryker was here"] };
Tests ran:
    adapter ports adapts a GSAP-like timeline without leaking the engine object

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:58:18
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (!config || false || !("keyframes" in config))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:61:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (false)
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 4 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:61:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if ((!keyframes || typeof keyframes !== "object") && Array.isArray(keyframes))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:61:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (false || Array.isArray(keyframes))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 4 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:61:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (!keyframes && typeof keyframes !== "object" || Array.isArray(keyframes))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:61:21
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (!keyframes || false || Array.isArray(keyframes))
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 4 more tests!

[Survived] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:65:39
-     const segments: CompiledSegment[] = [];
+     const segments: CompiledSegment[] = ["Stryker was here"];
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:69:9
-       if (first === undefined) continue;
+       if (false) continue;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:71:25
-       for (let index = 1; index < stops.length; index += 1) {
+       for (let index = 1; index <= stops.length; index += 1) {
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:74:11
-         if (previous === undefined || stop === undefined) continue;
+         if (false) continue;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:74:11
-         if (previous === undefined || stop === undefined) continue;
+         if (previous === undefined && stop === undefined) continue;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:74:11
-         if (previous === undefined || stop === undefined) continue;
+         if (false || stop === undefined) continue;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!
