[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:74:37
-         if (previous === undefined || stop === undefined) continue;
+         if (previous === undefined || false) continue;
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:80:13
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(true ? {} : { ease: stop.ease }),
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:80:13
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(false ? {} : { ease: stop.ease }),
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:80:13
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(stop.ease !== undefined ? {} : { ease: stop.ease }),
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:100:23
-               duration: segment.duration * duration,
+               duration: segment.duration / duration,
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:103:11
-             segment.start * duration,
+             segment.start / duration,
Tests ran:
    GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
    GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
    adapter ports compiles authored stops onto an adapter-owned proxy state
  and 3 more tests!

[NoCoverage] StringLiteral
packages/core/src/adapters/browser-clock.ts:46:37
-         if (disposed) throw new Error("Clock is disposed.");
+         if (disposed) throw new Error("");

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:15:9
-       if (disposed) return;
+       if (false) return;
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] MethodExpression
packages/core/src/adapters/browser-clock.ts:16:19
-       const delta = Math.max(0, time - previous);
+       const delta = Math.min(0, time - previous);
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ArithmeticOperator
packages/core/src/adapters/browser-clock.ts:16:31
-       const delta = Math.max(0, time - previous);
+       const delta = Math.max(0, time + previous);
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:32:15
-             if (!hasError) {
+             if (true) {
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:39:11
-         if (!disposed) handle = source.requestFrame(frame);
+         if (true) handle = source.requestFrame(frame);
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ArrowFunction
packages/core/src/adapters/browser-clock.ts:48:14
-         return () => listeners.delete(listener);
+         return () => undefined;
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:46:11
-         if (disposed) throw new Error("Clock is disposed.");
+         if (false) throw new Error("Clock is disposed.");
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:51:11
-         if (disposed) return;
+         if (false) return;
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] BooleanLiteral
packages/core/src/adapters/browser-clock.ts:52:18
-         disposed = true;
+         disposed = false;
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[Survived] ConditionalExpression
packages/core/src/adapters/browser-clock.ts:53:11
-         if (handle !== undefined) source.cancelFrame(handle);
+         if (true) source.cancelFrame(handle);
Tests ran:
    clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
    adapter ports ticks through an injected frame source and cancels on dispose

[NoCoverage] MethodExpression
packages/core/src/adapters/dom.ts:23:32
-       if (key in target.style || key.startsWith("--")) target.style[key] = value;
+       if (key in target.style || key.endsWith("--")) target.style[key] = value;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:23:47
-       if (key in target.style || key.startsWith("--")) target.style[key] = value;
+       if (key in target.style || key.startsWith("")) target.style[key] = value;

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:23:9
-       if (key in target.style || key.startsWith("--")) target.style[key] = value;
+       if (true) target.style[key] = value;
Tests ran:
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter

[Survived] ArrowFunction
packages/core/src/adapters/dom.ts:40:38
-     resolveTarget: DomTargetResolver = () => stage,
+     resolveTarget: DomTargetResolver = () => undefined,
Tests ran:
    adapter ports applies perspective once and never applies blocked patches

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:43:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (true && perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
    DOM patch adapter contract (C3) does not write blocked, error, or unresolved patches
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/dom.ts:43:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined && Number.isFinite(perspective) || perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
    DOM patch adapter contract (C3) does not write blocked, error, or unresolved patches
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:43:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (true)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
    DOM patch adapter contract (C3) does not write blocked, error, or unresolved patches
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:43:68
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined && Number.isFinite(perspective) && true)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches

[Survived] EqualityOperator
packages/core/src/adapters/dom.ts:43:68
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined && Number.isFinite(perspective) && perspective >= 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:43:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (true && Number.isFinite(perspective) && perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
    DOM patch adapter contract (C3) does not write blocked, error, or unresolved patches
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/adapters/dom.ts:43:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined || Number.isFinite(perspective) && perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
    DOM patch adapter contract (C3) does not write blocked, error, or unresolved patches
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:50:11
-         if (target === undefined) return;
+         if (false) return;
Tests ran:
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:56:52
-         for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
+         for (const key of Object.keys(previous)) if (false) dirty[key] = undefined;
Tests ran:
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:62:11
-         if (target === undefined) return;
+         if (false) return;
Tests ran:
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache

[NoCoverage] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:77:44
-         queue.push(...(dependents.get(id) ?? []));
+         queue.push(...(dependents.get(id) ?? ["Stryker was here"]));

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-publisher.ts:114:35
-               inputs[edge.target ?? ""] =
+               inputs[edge.target ?? "Stryker was here!"] =

[NoCoverage] OptionalChaining
packages/core/src/runtime/graph-publisher.ts:123:50
-                 memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+                 memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId).values;

[Survived] BlockStatement
packages/core/src/runtime/graph-publisher.ts:24:65
-   function diagnostic(nodeId: string, error: unknown): Diagnostic {
-     return Object.freeze({
-       ruleId: "composition-failure",
-       path: nodeId,
-       message: error instanceof Error ? error.message : String(error),
-       severity: "error",
-       ids: Object.freeze([nodeId]),
-     });
-   }
+   function diagnostic(nodeId: string, error: unknown): Diagnostic {}
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] ObjectLiteral
packages/core/src/runtime/graph-publisher.ts:25:24
-     return Object.freeze({
-       ruleId: "composition-failure",
-       path: nodeId,
-       message: error instanceof Error ? error.message : String(error),
-       severity: "error",
-       ids: Object.freeze([nodeId]),
-     });
+     return Object.freeze({});
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:29:15
-       severity: "error",
+       severity: "",
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:26:13
-       ruleId: "composition-failure",
+       ruleId: "",
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:30:24
-       ids: Object.freeze([nodeId]),
+       ids: Object.freeze([]),
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:37:10
-     return left < right ? -1 : left > right ? 1 : 0;
+     return true ? -1 : left > right ? 1 : 0;
Tests ran:
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
    GraphPublisher output edges uses canonical edge order when output sources collide

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:37:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : true ? 1 : 0;
Tests ran:
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:37:10
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left <= right ? -1 : left > right ? 1 : 0;
Tests ran:
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
    GraphPublisher output edges uses canonical edge order when output sources collide

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:37:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : false ? 1 : 0;
Tests ran:
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:37:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : left >= right ? 1 : 0;
Tests ran:
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:37:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : left <= right ? 1 : 0;
Tests ran:
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:44:7
-     if (overlay === undefined) return base;
+     if (false) return base;
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
    GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] OptionalChaining
packages/core/src/runtime/graph-publisher.ts:69:38
-         for (const edge of node.edges) dependents.get(edge.sourceId)?.push(node.id);
+         for (const edge of node.edges) dependents.get(edge.sourceId).push(node.id);
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
    GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:64:9
-       if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+       if (false) throw new Error(REENTRANT_BATCH_MESSAGE);
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:67:64
-       for (const node of snapshot.nodes) dependents.set(node.id, []);
+       for (const node of snapshot.nodes) dependents.set(node.id, ["Stryker was here"]);
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:73:25
-       for (let index = 0; index < queue.length; index += 1) {
+       for (let index = 0; index <= queue.length; index += 1) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:75:11
-         if (id === undefined || affected.has(id)) continue;
+         if (false) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/graph-publisher.ts:75:11
-         if (id === undefined || affected.has(id)) continue;
+         if (id === undefined && affected.has(id)) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:75:11
-         if (id === undefined || affected.has(id)) continue;
+         if (false || affected.has(id)) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:98:26
-               diagnostics: [
-                 Object.freeze({
-                   ruleId: "blocked-upstream",
-                   path: id,
-                   message: `Blocked by upstream failure at ${sourceFailure}.`,
-                   severity: "error",
-                   ids: Object.freeze([sourceFailure, id]),
-                 }),
-               ],
+               diagnostics: [],
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] ObjectLiteral
packages/core/src/runtime/graph-publisher.ts:99:29
-                 Object.freeze({
-                   ruleId: "blocked-upstream",
-                   path: id,
-                   message: `Blocked by upstream failure at ${sourceFailure}.`,
-                   severity: "error",
-                   ids: Object.freeze([sourceFailure, id]),
-                 }),
+                 Object.freeze({}),
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:100:25
-                   ruleId: "blocked-upstream",
+                   ruleId: "",
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:102:26
-                   message: `Blocked by upstream failure at ${sourceFailure}.`,
+                   message: ``,
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:103:27
-                   severity: "error",
+                   severity: "",
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:104:36
-                   ids: Object.freeze([sourceFailure, id]),
+                   ids: Object.freeze([]),
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:88:13
-           if (node === undefined) continue;
+           if (false) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] OptionalChaining
packages/core/src/runtime/graph-publisher.ts:115:50
-                 memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+                 memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId).values;
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
    GraphPublisher partial-seed inputs uses the last published value for an unseeded input source

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:113:17
-               if (edge.role !== "input") continue;
+               if (false) continue;
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
    GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/graph-publisher.ts:123:15
-                 memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+                 memo.get(edge.sourceId)?.values && this.#registry.get(edge.sourceId)?.values;
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
    GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] OptionalChaining
packages/core/src/runtime/graph-publisher.ts:123:15
-                 memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+                 memo.get(edge.sourceId).values ?? this.#registry.get(edge.sourceId)?.values;
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
    GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:145:26
-               diagnostics: [failure],
+               diagnostics: [],
Tests ran:
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] BlockStatement
packages/core/src/runtime/graph-publisher.ts:155:11
-         try {
-           this.#registry.closeBatch();
-         } catch {
+         try {} catch {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
    clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
    PatchRegistry: subscriber error handling (recovery A2) GraphPublisher.flush() surfaces the real subscriber error, not a masked 'No patch batch is open'

[Survived] ObjectLiteral
packages/core/src/runtime/graph-publisher.ts:129:24
-             memo.set(id, { ...composed, values });
+             memo.set(id, {});
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:136:26
-               diagnostics: [],
+               diagnostics: ["Stryker was here"],
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 19 more tests!
