[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:33:21
-       path: ids[0] ?? "",
+       path: ids[0] ?? "Stryker was here!",

[NoCoverage] BlockStatement
packages/core/src/runtime/graph-runtime.ts:106:48
-     get lastFlushError(): Diagnostic | undefined {
-       return this.#lastFlushError;
-     }
+     get lastFlushError(): Diagnostic | undefined {}

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:120:27
-         throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+         throw new TypeError(``);

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:144:55
-         if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
+         if (!Number.isFinite(tick)) throw new TypeError("");

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:145:55
-         if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+         if (tick < this.#lastTick) throw new RangeError("");

[NoCoverage] BlockStatement
packages/core/src/runtime/graph-runtime.ts:191:39
-       if (event.tick <= this.#lastTick) {
-         this.#report(
-           CLOCK_REGRESSION_RULE,
-           `Clock tick ${event.tick} did not advance past ${this.#lastTick}.`,
-         );
-         return;
-       }
+       if (event.tick <= this.#lastTick) {}

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:194:9
-           `Clock tick ${event.tick} did not advance past ${this.#lastTick}.`,
+           ``,

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:216:41
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+       if (this.#disposed) throw new Error("");

[Survived] LogicalOperator
packages/core/src/runtime/graph-runtime.ts:33:11
-       path: ids[0] ?? "",
+       path: ids[0] && "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:35:7
-         "A flush requested while subscribers were being notified was queued as one follow-up " +
+         "" +
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:36:7
-         "invalidation for the next tick.",
+         "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:37:15
-       severity: "warning",
+       severity: "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up

[Survived] BlockStatement
packages/core/src/runtime/graph-runtime.ts:94:35
-     get publisher(): GraphPublisher {
-       return this.#publisher;
-     }
+     get publisher(): GraphPublisher {}
Tests ran:
    GraphRuntime I-13 owns one registry, one publisher, one state, and one clock subscription

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:119:9
-       if (!this.#binding.graph.nodeById[nodeId])
+       if (false)
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 12 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:144:11
-         if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
+         if (false) throw new TypeError("Runtime ticks must be finite.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:145:11
-         if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+         if (false) throw new RangeError("Runtime ticks must be monotonic.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 7 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-runtime.ts:145:11
-         if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+         if (tick <= this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:186:9
-       if (this.#disposed) return;
+       if (false) return;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:179:9
-       if (this.#disposed) return;
+       if (false) return;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 13 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/graph-runtime.ts:180:22
-       this.#disposed = true;
+       this.#disposed = false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 13 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:191:9
-       if (event.tick <= this.#lastTick) {
+       if (false) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 5 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-runtime.ts:191:9
-       if (event.tick <= this.#lastTick) {
+       if (event.tick < this.#lastTick) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 5 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-runtime.ts:210:26
-         ids: Object.freeze([...this.#members]),
+         ids: Object.freeze([]),
Tests ran:
    clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock

[Survived] OptionalChaining
packages/core/src/runtime/graph-runtime.ts:213:5
-       this.#onFlushError?.(diagnostic);
+       this.#onFlushError(diagnostic);
Tests ran:
    clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock

[Survived] BlockStatement
packages/core/src/runtime/graph-runtime.ts:215:23
-     #assertLive(): void {
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
-     }
+     #assertLive(): void {}
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 12 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:216:9
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+       if (false) throw new Error("GraphRuntime is disposed.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 12 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:12:38
-   export const CLOCK_REGRESSION_RULE = "clock-tick-regression";
+   export const CLOCK_REGRESSION_RULE = "";
Ran all tests for this mutant.

[NoCoverage] BooleanLiteral
packages/core/src/runtime/patch-registry.ts:52:45
-     if (aKeys.length !== bKeys.length) return false;
+     if (aKeys.length !== bKeys.length) return true;

[NoCoverage] BlockStatement
packages/core/src/runtime/patch-registry.ts:175:25
-           } catch (error) {
-             if (!hasError) {
-               hasError = true;
-               firstError = error;
-             }
-           }
+           } catch (error) {}

[NoCoverage] BooleanLiteral
packages/core/src/runtime/patch-registry.ts:176:15
-             if (!hasError) {
+             if (hasError) {

[NoCoverage] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:176:15
-             if (!hasError) {
+             if (true) {

[NoCoverage] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:176:15
-             if (!hasError) {
+             if (false) {

[NoCoverage] BlockStatement
packages/core/src/runtime/patch-registry.ts:176:26
-             if (!hasError) {
-               hasError = true;
-               firstError = error;
-             }
+             if (!hasError) {}

[NoCoverage] BooleanLiteral
packages/core/src/runtime/patch-registry.ts:177:24
-               hasError = true;
+               hasError = false;

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:39:7
-     if (value === null || typeof value !== "object") return value;
+     if (false || typeof value !== "object") return value;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 32 more tests!

[Survived] MethodExpression
packages/core/src/runtime/patch-registry.ts:50:17
-     const aKeys = Object.keys(a).sort();
+     const aKeys = Object.keys(a);
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 14 more tests!

[Survived] MethodExpression
packages/core/src/runtime/patch-registry.ts:51:17
-     const bKeys = Object.keys(b).sort();
+     const bKeys = Object.keys(b);
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 14 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:40:7
-     if (seen.has(value)) return value;
+     if (false) return value;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 32 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:52:7
-     if (aKeys.length !== bKeys.length) return false;
+     if (false) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 14 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:57:10
-     return JSON.stringify(a) === JSON.stringify(b);
+     return true;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:53:38
-     return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
+     return aKeys.every((key, index) => true && Object.is(a[key], b[key]));
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 13 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:66:5
-       a.status === b.status &&
+       true &&
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
  and 5 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:75:21
-     #batch: Patch[] = [];
+     #batch: Patch[] = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 35 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:76:37
-     #batchDiagnostics: Diagnostic[] = [];
+     #batchDiagnostics: Diagnostic[] = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 35 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:78:27
-     #batchSeeds: string[] = [];
+     #batchSeeds: string[] = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 35 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:104:30
-       this.#batchDiagnostics = [];
+       this.#batchDiagnostics = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 32 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:116:41
-         diagnostics: input.diagnostics ?? [],
+         diagnostics: input.diagnostics ?? ["Stryker was here"],
Tests ran:
    subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
    PatchRegistry: subscriber error handling (recovery A2) a throwing node subscriber does not prevent other subscribers from being notified
    PatchRegistry: subscriber error handling (recovery A2) closeBatch always fully resets its internal state, even when a subscriber throws, so the next beginBatch succeeds
  and 9 more tests!

[Survived] ArrowFunction
packages/core/src/runtime/patch-registry.ts:135:12
-       return () => this.#batchListeners.delete(listener);
+       return () => undefined;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 5 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:149:19
-       this.#batch = [];
+       this.#batch = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 32 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:150:30
-       this.#batchDiagnostics = [];
+       this.#batchDiagnostics = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 32 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:151:24
-       this.#batchSeeds = [];
+       this.#batchSeeds = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 32 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:165:17
-               if (!hasError) {
+               if (true) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
    clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
    PatchRegistry: subscriber error handling (recovery A2) a throwing node subscriber does not prevent other subscribers from being notified
  and 3 more tests!

[Survived] StringLiteral
packages/core/src/runtime/patch-registry.ts:36:3
-     "Queue one follow-up invalidation instead of recursing.";
+     "";
Ran all tests for this mutant.

[NoCoverage] BlockStatement
packages/core/src/runtime/project-runtime.ts:31:36
-     get project(): ProjectDefinition {
-       return this.#project;
-     }
+     get project(): ProjectDefinition {}

[NoCoverage] StringLiteral
packages/core/src/runtime/project-runtime.ts:68:41
-       if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
+       if (this.#disposed) throw new Error("");

[Survived] StringLiteral
packages/core/src/runtime/project-runtime.ts:42:58
-       if (this.#instances.has(nodeId)) throw new TypeError(`Node "${nodeId}" is already mounted.`);
+       if (this.#instances.has(nodeId)) throw new TypeError(``);
Tests ran:
    ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime

[Survived] ConditionalExpression
packages/core/src/runtime/project-runtime.ts:50:9
-       if (instance === undefined) return;
+       if (false) return;
Tests ran:
    ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime

[Survived] ConditionalExpression
packages/core/src/runtime/project-runtime.ts:60:9
-       if (this.#disposed) return;
+       if (false) return;
Tests ran:
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
    Engine publishes a progress change through the existing graph runtime
    Engine keeps one clock owner while clock progress publishes once
  and 4 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/project-runtime.ts:61:22
-       this.#disposed = true;
+       this.#disposed = false;
Tests ran:
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
    Engine publishes a progress change through the existing graph runtime
    Engine keeps one clock owner while clock progress publishes once
  and 4 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/project-runtime.ts:62:26
-       for (const nodeId of [...this.#instances.keys()]) this.#graph.detach(nodeId);
+       for (const nodeId of []) this.#graph.detach(nodeId);
Tests ran:
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
    Engine publishes a progress change through the existing graph runtime
    Engine keeps one clock owner while clock progress publishes once
  and 4 more tests!

[Survived] BlockStatement
packages/core/src/runtime/project-runtime.ts:67:23
-     #assertLive(): void {
-       if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
-     }
+     #assertLive(): void {}
Tests ran:
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
    Engine publishes a progress change through the existing graph runtime
    Engine keeps one clock owner while clock progress publishes once
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/project-runtime.ts:68:9
-       if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
+       if (false) throw new Error("ProjectRuntime is disposed.");
Tests ran:
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
    Engine publishes a progress change through the existing graph runtime
    Engine keeps one clock owner while clock progress publishes once
  and 4 more tests!
