[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:34:20
 }
 
 function readStops(property: unknown): readonly AuthoredStop[] {
-  if (!property || typeof property !== "object" || !("stops" in property)) return [];
+  if (!property || typeof property === "object" || !("stops" in property)) return [];
   const stops = (property as { stops?: unknown }).stops;
   if (!Array.isArray(stops)) return [];
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Survived] LogicalOperator
src/adapters/interpolator/gsap.ts:49:7
 }
 
 function readDuration(config: unknown): number {
-  if (!config || typeof config !== "object") return 1;
+  if (!config && typeof config !== "object") return 1;
   const duration = (config as { duration?: unknown }).duration;
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;

[Survived] ConditionalExpression
src/adapters/interpolator/gsap.ts:49:18
 }
 
 function readDuration(config: unknown): number {
-  if (!config || typeof config !== "object") return 1;
+  if (!config || false) return 1;
   const duration = (config as { duration?: unknown }).duration;
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;

[Survived] EqualityOperator
src/adapters/interpolator/gsap.ts:51:71
 function readDuration(config: unknown): number {
   if (!config || typeof config !== "object") return 1;
   const duration = (config as { duration?: unknown }).duration;
-  return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+  return typeof duration === "number" && Number.isFinite(duration) && duration > 0 ? duration : 1;
 }
 

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:58:18
   readonly initial: Record<string, unknown>;
   readonly segments: readonly CompiledSegment[];
 } {
-  if (!config || typeof config !== "object" || !("keyframes" in config))
+  if (!config || typeof config === "object" || !("keyframes" in config))
     return { initial: {}, segments: [] };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:58:7
   readonly initial: Record<string, unknown>;
   readonly segments: readonly CompiledSegment[];
 } {
-  if (!config || typeof config !== "object" || !("keyframes" in config))
+  if (true)
     return { initial: {}, segments: [] };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ObjectLiteral
src/adapters/interpolator/gsap.ts:59:12
   readonly segments: readonly CompiledSegment[];
 } {
   if (!config || typeof config !== "object" || !("keyframes" in config))
-    return { initial: {}, segments: [] };
+    return {};
   const keyframes = (config as { keyframes?: unknown }).keyframes;
   if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
killedBy: adapter ports adapts a GSAP-like timeline without leaking the engine object
statusReason: compiled.segments is not iterable

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:61:7
   if (!config || typeof config !== "object" || !("keyframes" in config))
     return { initial: {}, segments: [] };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
-  if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+  if (keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
     return { initial: {}, segments: [] };
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:66:60
 
   const initial: Record<string, unknown> = {};
   const segments: CompiledSegment[] = [];
-  for (const [key, property] of Object.entries(keyframes)) {
-    const stops = readStops(property);
-    const first = stops[0];
-    if (first === undefined) continue;
-    initial[key] = first.v;
-    for (let index = 1; index < stops.length; index += 1) {
-      const previous = stops[index - 1];
-      const stop = stops[index];
-      if (previous === undefined || stop === undefined) continue;
-      segments.push({
-        key,
-        value: stop.v,
-        start: previous.p,
-        duration: Math.max(0, stop.p - previous.p),
-        ...(stop.ease === undefined ? {} : { ease: stop.ease }),
-      });
-    }
-  }
+  for (const [key, property] of Object.entries(keyframes)) {}
   return { initial, segments };
 }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:71:25
     const first = stops[0];
     if (first === undefined) continue;
     initial[key] = first.v;
-    for (let index = 1; index < stops.length; index += 1) {
+    for (let index = 1; index >= stops.length; index += 1) {
       const previous = stops[index - 1];
       const stop = stops[index];
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ObjectLiteral
src/adapters/interpolator/gsap.ts:75:21
       const previous = stops[index - 1];
       const stop = stops[index];
       if (previous === undefined || stop === undefined) continue;
-      segments.push({
-        key,
-        value: stop.v,
-        start: previous.p,
-        duration: Math.max(0, stop.p - previous.p),
-        ...(stop.ease === undefined ? {} : { ease: stop.ease }),
-      });
+      segments.push({});
     }
   }
killedBy: GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state
statusReason: expected { x: +0, …(2) } to match object { x: 50 }
(7 matching properties omitted from actual)

[Killed] ObjectLiteral
src/adapters/interpolator/gsap.ts:84:10
       });
     }
   }
-  return { initial, segments };
+  return {};
 }
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: compiled.segments is not iterable
