[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:44:83
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property || typeof property !== "object" || !("stops" in property)) return ["Stryker was here"];

[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:46:37
-     if (!Array.isArray(stops)) return [];
+     if (!Array.isArray(stops)) return ["Stryker was here"];

[NoCoverage] ObjectLiteral
packages/core/src/adapters/interpolator/gsap.ts:69:12
-       return { initial: {}, segments: [], end: 0 };
+       return {};

[NoCoverage] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:69:37
-       return { initial: {}, segments: [], end: 0 };
+       return { initial: {}, segments: ["Stryker was here"], end: 0 };

[NoCoverage] ObjectLiteral
packages/core/src/adapters/interpolator/gsap.ts:88:44
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(stop.ease === undefined ? {} : {}),

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:44:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if ((!property || typeof property !== "object") && !("stops" in property)) return [];
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:44:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (false || !("stops" in property)) return [];
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:44:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (false) return [];
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:44:7
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property && typeof property !== "object" || !("stops" in property)) return [];
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:44:20
-     if (!property || typeof property !== "object" || !("stops" in property)) return [];
+     if (!property || false || !("stops" in property)) return [];
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:46:7
-     if (!Array.isArray(stops)) return [];
+     if (false) return [];
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] MethodExpression
packages/core/src/adapters/interpolator/gsap.ts:47:10
-     return stops.filter((stop): stop is AuthoredStop =>
-       Boolean(
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
-       ),
-     );
+     return stops;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
+         true,
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
-           "v" in stop,
+         stop && typeof stop === "object" && typeof (stop as {
+     p?: unknown;
+   }).p === "number" && Number.isFinite((stop as {
+     p: number;
+   }).p) || "v" in stop,
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
+         true &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
-           Number.isFinite((stop as { p: number }).p) &&
+         stop && typeof stop === "object" && typeof (stop as {
+     p?: unknown;
+   }).p === "number" || Number.isFinite((stop as {
+     p: number;
+   }).p) &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
+         true &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
-           typeof (stop as { p?: unknown }).p === "number" &&
+         stop && typeof stop === "object" || typeof (stop as {
+     p?: unknown;
+   }).p === "number" &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
+         true &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:49:7
-         stop &&
-           typeof stop === "object" &&
+         stop || typeof stop === "object" &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:50:9
-           typeof stop === "object" &&
+           true &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:51:9
-           typeof (stop as { p?: unknown }).p === "number" &&
+           true &&
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:59:7
-     if (!config || typeof config !== "object") return 1;
+     if (false) return 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:59:7
-     if (!config || typeof config !== "object") return 1;
+     if (!config && typeof config !== "object") return 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:59:18
-     if (!config || typeof config !== "object") return 1;
+     if (!config || false) return 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:61:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) || duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:61:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:61:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" || Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:61:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:61:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && true ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 8 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:61:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && duration > 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 8 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:65:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (false)
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:65:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if ((!config || typeof config !== "object") && !("keyframes" in config))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:65:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (false || !("keyframes" in config))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:65:7
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (!config && typeof config !== "object" || !("keyframes" in config))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ArrayDeclaration
packages/core/src/adapters/interpolator/gsap.ts:66:37
-       return { initial: {}, segments: [], end: 0 };
+       return { initial: {}, segments: ["Stryker was here"], end: 0 };
Tests ran:
    adapter ports adapts a GSAP-like timeline without leaking the engine object

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:65:18
-     if (!config || typeof config !== "object" || !("keyframes" in config))
+     if (!config || false || !("keyframes" in config))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:68:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (false)
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 9 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:68:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if ((!keyframes || typeof keyframes !== "object") && Array.isArray(keyframes))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:68:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (false || Array.isArray(keyframes))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 9 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:68:7
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (!keyframes && typeof keyframes !== "object" || Array.isArray(keyframes))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:68:21
-     if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+     if (!keyframes || false || Array.isArray(keyframes))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:77:9
-       if (first === undefined) continue;
+       if (false) continue;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:79:25
-       for (let index = 1; index < stops.length; index += 1) {
+       for (let index = 1; index <= stops.length; index += 1) {
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:82:11
-         if (previous === undefined || stop === undefined) continue;
+         if (false) continue;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:82:11
-         if (previous === undefined || stop === undefined) continue;
+         if (previous === undefined && stop === undefined) continue;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:82:11
-         if (previous === undefined || stop === undefined) continue;
+         if (false || stop === undefined) continue;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:82:37
-         if (previous === undefined || stop === undefined) continue;
+         if (previous === undefined || false) continue;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:88:13
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(true ? {} : { ease: stop.ease }),
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:88:13
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(false ? {} : { ease: stop.ease }),
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:88:13
-           ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+           ...(stop.ease !== undefined ? {} : { ease: stop.ease }),
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:92:9
-       if (last !== undefined) end = Math.max(end, last.p);
+       if (true) end = Math.max(end, last.p);
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:116:7
-     if (duration <= 0 || end >= 1) return;
+     if (false || end >= 1) return;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!
