[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:116:7
-     if (duration <= 0 || end >= 1) return;
+     if (duration < 0 || end >= 1) return;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 10 more tests!

[Survived] ObjectLiteral
packages/core/src/adapters/interpolator/gsap.ts:117:43
-     const anchor: Record<string, unknown> = { authoredEnd: 0 };
+     const anchor: Record<string, unknown> = {};
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 4 more tests!

[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:134:23
-               duration: segment.duration * duration,
+               duration: segment.duration / duration,
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!

[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:137:11
-             segment.start * duration,
+             segment.start / duration,
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when the grids end at different positions
  and 7 more tests!
