[Killed] BooleanLiteral
core/src/adapters/browser-clock.ts:13:18
   let handle: number | undefined;
   let tick = 0;
   let previous = 0;
-  let disposed = false;
+  let disposed = true;
   const frame = (time: number): void => {
     if (disposed) return;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: Clock is disposed.

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:15:9
   let previous = 0;
   let disposed = false;
   const frame = (time: number): void => {
-    if (disposed) return;
+    if (true) return;
     const delta = Math.max(0, time - previous);
     previous = time;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Survived] ConditionalExpression
core/src/adapters/browser-clock.ts:15:9
   let previous = 0;
   let disposed = false;
   const frame = (time: number): void => {
-    if (disposed) return;
+    if (false) return;
     const delta = Math.max(0, time - previous);
     previous = time;

[Survived] MethodExpression
core/src/adapters/browser-clock.ts:16:19
   let disposed = false;
   const frame = (time: number): void => {
     if (disposed) return;
-    const delta = Math.max(0, time - previous);
+    const delta = Math.min(0, time - previous);
     previous = time;
     tick += 1;

[Survived] ArithmeticOperator
core/src/adapters/browser-clock.ts:16:31
   let disposed = false;
   const frame = (time: number): void => {
     if (disposed) return;
-    const delta = Math.max(0, time - previous);
+    const delta = Math.max(0, time + previous);
     previous = time;
     tick += 1;

[Killed] AssignmentOperator
core/src/adapters/browser-clock.ts:18:5
     if (disposed) return;
     const delta = Math.max(0, time - previous);
     previous = time;
-    tick += 1;
+    tick -= 1;
     const event = Object.freeze({ tick, time, delta });
     let firstError: unknown;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [ -1 ] to deeply equal [ 1 ]

[Killed] ObjectLiteral
core/src/adapters/browser-clock.ts:19:33
     const delta = Math.max(0, time - previous);
     previous = time;
     tick += 1;
-    const event = Object.freeze({ tick, time, delta });
+    const event = Object.freeze({});
     let firstError: unknown;
     let hasError = false;
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: expected [ undefined ] to deeply equal [ 1 ]

[Killed] BooleanLiteral
core/src/adapters/browser-clock.ts:21:20
     tick += 1;
     const event = Object.freeze({ tick, time, delta });
     let firstError: unknown;
-    let hasError = false;
+    let hasError = true;
     try {
       // Every listener gets its turn, and the next frame is requested in `finally` before any
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: undefined

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:22:9
     const event = Object.freeze({ tick, time, delta });
     let firstError: unknown;
     let hasError = false;
-    try {
-      // Every listener gets its turn, and the next frame is requested in `finally` before any
-      // error leaves this callback. A listener's own bug used to end the loop for good: the
-      // reschedule sat after the dispatch, so one throw meant no further frame was ever
-      // requested and every animation on the page stopped. The same policy as
-      // PatchRegistry.closeBatch applies here, first error rethrown once state is settled.
-      for (const listener of [...listeners]) {
-        try {
-          listener(event);
-        } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
-        }
-      }
-    } finally {
+    try {} finally {
       if (!disposed) handle = source.requestFrame(frame);
     }
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:28:46
       // reschedule sat after the dispatch, so one throw meant no further frame was ever
       // requested and every animation on the page stopped. The same policy as
       // PatchRegistry.closeBatch applies here, first error rethrown once state is settled.
-      for (const listener of [...listeners]) {
-        try {
-          listener(event);
-        } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
-        }
-      }
+      for (const listener of [...listeners]) {}
     } finally {
       if (!disposed) handle = source.requestFrame(frame);
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: expected [] to deeply equal [ 1 ]

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:29:13
       // requested and every animation on the page stopped. The same policy as
       // PatchRegistry.closeBatch applies here, first error rethrown once state is settled.
       for (const listener of [...listeners]) {
-        try {
-          listener(event);
-        } catch (error) {
+        try {} catch (error) {
           if (!hasError) {
             hasError = true;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:31:25
       for (const listener of [...listeners]) {
         try {
           listener(event);
-        } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
-        }
+        } catch (error) {}
       }
     } finally {
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:32:26
         try {
           listener(event);
         } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
+          if (!hasError) {}
         }
       }
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:32:15
         try {
           listener(event);
         } catch (error) {
-          if (!hasError) {
+          if (false) {
             hasError = true;
             firstError = error;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
core/src/adapters/browser-clock.ts:33:24
           listener(event);
         } catch (error) {
           if (!hasError) {
-            hasError = true;
+            hasError = false;
             firstError = error;
           }
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:38:15
           }
         }
       }
-    } finally {
-      if (!disposed) handle = source.requestFrame(frame);
-    }
+    } finally {}
     if (hasError) throw firstError;
   };
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
core/src/adapters/browser-clock.ts:39:11
         }
       }
     } finally {
-      if (!disposed) handle = source.requestFrame(frame);
+      if (disposed) handle = source.requestFrame(frame);
     }
     if (hasError) throw firstError;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:39:11
         }
       }
     } finally {
-      if (!disposed) handle = source.requestFrame(frame);
+      if (false) handle = source.requestFrame(frame);
     }
     if (hasError) throw firstError;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:41:9
     } finally {
       if (!disposed) handle = source.requestFrame(frame);
     }
-    if (hasError) throw firstError;
+    if (false) throw firstError;
   };
   handle = source.requestFrame(frame);
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:41:9
     } finally {
       if (!disposed) handle = source.requestFrame(frame);
     }
-    if (hasError) throw firstError;
+    if (true) throw firstError;
   };
   handle = source.requestFrame(frame);
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: undefined

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:45:25
   };
   handle = source.requestFrame(frame);
   return {
-    subscribe(listener) {
-      if (disposed) throw new Error("Clock is disposed.");
-      listeners.add(listener);
-      return () => listeners.delete(listener);
-    },
+    subscribe(listener) {},
     dispose() {
       if (disposed) return;
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:46:11
   handle = source.requestFrame(frame);
   return {
     subscribe(listener) {
-      if (disposed) throw new Error("Clock is disposed.");
+      if (true) throw new Error("Clock is disposed.");
       listeners.add(listener);
       return () => listeners.delete(listener);
killedBy: clock and batch identity are independent (P0-1) requests the next animation frame even when a clock listener throws
statusReason: Clock is disposed.

[Survived] ConditionalExpression
core/src/adapters/browser-clock.ts:46:11
   handle = source.requestFrame(frame);
   return {
     subscribe(listener) {
-      if (disposed) throw new Error("Clock is disposed.");
+      if (false) throw new Error("Clock is disposed.");
       listeners.add(listener);
       return () => listeners.delete(listener);

[Survived] ArrowFunction
core/src/adapters/browser-clock.ts:48:14
     subscribe(listener) {
       if (disposed) throw new Error("Clock is disposed.");
       listeners.add(listener);
-      return () => listeners.delete(listener);
+      return () => undefined;
     },
     dispose() {

[Killed] BlockStatement
core/src/adapters/browser-clock.ts:50:15
       listeners.add(listener);
       return () => listeners.delete(listener);
     },
-    dispose() {
-      if (disposed) return;
-      disposed = true;
-      if (handle !== undefined) source.cancelFrame(handle);
-      listeners.clear();
-    },
+    dispose() {},
   };
 }
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:51:11
       return () => listeners.delete(listener);
     },
     dispose() {
-      if (disposed) return;
+      if (true) return;
       disposed = true;
       if (handle !== undefined) source.cancelFrame(handle);
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
core/src/adapters/browser-clock.ts:51:11
       return () => listeners.delete(listener);
     },
     dispose() {
-      if (disposed) return;
+      if (false) return;
       disposed = true;
       if (handle !== undefined) source.cancelFrame(handle);

[Killed] ConditionalExpression
core/src/adapters/browser-clock.ts:53:11
     dispose() {
       if (disposed) return;
       disposed = true;
-      if (handle !== undefined) source.cancelFrame(handle);
+      if (false) source.cancelFrame(handle);
       listeners.clear();
     },
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
core/src/adapters/browser-clock.ts:53:11
     dispose() {
       if (disposed) return;
       disposed = true;
-      if (handle !== undefined) source.cancelFrame(handle);
+      if (handle === undefined) source.cancelFrame(handle);
       listeners.clear();
     },
killedBy: adapter ports ticks through an injected frame source and cancels on dispose
statusReason: expected +0 to be 1 // Object.is equality
