[Killed] BlockStatement
core/src/adapters/dom.ts:21:92
   clear(target?: DomTarget): void;
 }
 
-function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
-  for (const [key, value] of Object.entries(values)) {
-    if (key in target.style || key.startsWith("--")) target.style[key] = value;
-    else target[key] = value;
-  }
-}
+function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {}
 
 function renderableValues(values: Readonly<Record<string, unknown>>): Record<string, unknown> {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BlockStatement
core/src/adapters/dom.ts:22:54
 }
 
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
-  for (const [key, value] of Object.entries(values)) {
-    if (key in target.style || key.startsWith("--")) target.style[key] = value;
-    else target[key] = value;
-  }
+  for (const [key, value] of Object.entries(values)) {}
 }
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ConditionalExpression
core/src/adapters/dom.ts:23:9
 
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
   for (const [key, value] of Object.entries(values)) {
-    if (key in target.style || key.startsWith("--")) target.style[key] = value;
+    if (false) target.style[key] = value;
     else target[key] = value;
   }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] LogicalOperator
core/src/adapters/dom.ts:23:9
 
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
   for (const [key, value] of Object.entries(values)) {
-    if (key in target.style || key.startsWith("--")) target.style[key] = value;
+    if (key in target.style && key.startsWith("--")) target.style[key] = value;
     else target[key] = value;
   }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BlockStatement
core/src/adapters/dom.ts:28:95
   }
 }
 
-function renderableValues(values: Readonly<Record<string, unknown>>): Record<string, unknown> {
-  const result: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset") continue;
-    result[key] = value;
-  }
-  return result;
-}
+function renderableValues(values: Readonly<Record<string, unknown>>): Record<string, unknown> {}
 
 export function createDomPatchAdapter(
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
core/src/adapters/dom.ts:30:54
 
 function renderableValues(values: Readonly<Record<string, unknown>>): Record<string, unknown> {
   const result: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset") continue;
-    result[key] = value;
-  }
+  for (const [key, value] of Object.entries(values)) {}
   return result;
 }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] EqualityOperator
core/src/adapters/dom.ts:31:32
 function renderableValues(values: Readonly<Record<string, unknown>>): Record<string, unknown> {
   const result: Record<string, unknown> = {};
   for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset") continue;
+    if (key.startsWith("_") || key !== "offset") continue;
     result[key] = value;
   }
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [ { target: { style: {} }, …(1) } ] to deeply equal [ { target: { style: {} }, …(1) } ]

[Killed] ConditionalExpression
core/src/adapters/dom.ts:31:32
 function renderableValues(values: Readonly<Record<string, unknown>>): Record<string, unknown> {
   const result: Record<string, unknown> = {};
   for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset") continue;
+    if (key.startsWith("_") || false) continue;
     result[key] = value;
   }
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [ { target: { style: {} }, …(1) } ] to deeply equal [ { target: { style: {} }, …(1) } ]

[Survived] ArrowFunction
core/src/adapters/dom.ts:40:38
 export function createDomPatchAdapter(
   stage: StageLike,
   perspective?: number,
-  resolveTarget: DomTargetResolver = () => stage,
+  resolveTarget: DomTargetResolver = () => undefined,
   write: DomPatchWriter = defaultWriter,
 ): DomPatchAdapter {

[Killed] BlockStatement
core/src/adapters/dom.ts:42:20
   perspective?: number,
   resolveTarget: DomTargetResolver = () => stage,
   write: DomPatchWriter = defaultWriter,
-): DomPatchAdapter {
-  if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
-    stage.style.perspective = `${perspective}px`;
-  const lastApplied = new WeakMap<object, Record<string, unknown>>();
-  return {
-    apply(patch) {
-      if (patch.status !== "ready") return;
-      const target = resolveTarget(patch.nodeId);
-      if (target === undefined) return;
-      const next = renderableValues(patch.values);
-      const previous = lastApplied.get(target) ?? {};
-      const dirty: Record<string, unknown> = {};
-      for (const [key, value] of Object.entries(next))
-        if (!Object.is(previous[key], value)) dirty[key] = value;
-      for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
-      if (Object.keys(dirty).length === 0) return;
-      write(target, dirty);
-      lastApplied.set(target, next);
-    },
-    clear(target) {
-      if (target === undefined) return;
-      lastApplied.delete(target);
-    },
-  };
-}
+): DomPatchAdapter {}
 
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: Cannot read properties of undefined (reading 'apply')

[Killed] EqualityOperator
core/src/adapters/dom.ts:43:7
   resolveTarget: DomTargetResolver = () => stage,
   write: DomPatchWriter = defaultWriter,
 ): DomPatchAdapter {
-  if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+  if (perspective === undefined && Number.isFinite(perspective) && perspective > 0)
     stage.style.perspective = `${perspective}px`;
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
killedBy: adapter ports applies perspective once and never applies blocked patches
statusReason: expected undefined to be '1200px' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:43:7
   resolveTarget: DomTargetResolver = () => stage,
   write: DomPatchWriter = defaultWriter,
 ): DomPatchAdapter {
-  if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+  if (false)
     stage.style.perspective = `${perspective}px`;
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
killedBy: adapter ports applies perspective once and never applies blocked patches
statusReason: expected undefined to be '1200px' // Object.is equality

[Killed] BlockStatement
core/src/adapters/dom.ts:47:18
     stage.style.perspective = `${perspective}px`;
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
   return {
-    apply(patch) {
-      if (patch.status !== "ready") return;
-      const target = resolveTarget(patch.nodeId);
-      if (target === undefined) return;
-      const next = renderableValues(patch.values);
-      const previous = lastApplied.get(target) ?? {};
-      const dirty: Record<string, unknown> = {};
-      for (const [key, value] of Object.entries(next))
-        if (!Object.is(previous[key], value)) dirty[key] = value;
-      for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
-      if (Object.keys(dirty).length === 0) return;
-      write(target, dirty);
-      lastApplied.set(target, next);
-    },
+    apply(patch) {},
     clear(target) {
       if (target === undefined) return;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ConditionalExpression
core/src/adapters/dom.ts:48:11
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
   return {
     apply(patch) {
-      if (patch.status !== "ready") return;
+      if (true) return;
       const target = resolveTarget(patch.nodeId);
       if (target === undefined) return;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] EqualityOperator
core/src/adapters/dom.ts:48:11
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
   return {
     apply(patch) {
-      if (patch.status !== "ready") return;
+      if (patch.status === "ready") return;
       const target = resolveTarget(patch.nodeId);
       if (target === undefined) return;
killedBy: adapter ports applies perspective once and never applies blocked patches
statusReason: expected 1 to be undefined

[Killed] EqualityOperator
core/src/adapters/dom.ts:50:11
     apply(patch) {
       if (patch.status !== "ready") return;
       const target = resolveTarget(patch.nodeId);
-      if (target === undefined) return;
+      if (target !== undefined) return;
       const next = renderableValues(patch.values);
       const previous = lastApplied.get(target) ?? {};
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ConditionalExpression
core/src/adapters/dom.ts:50:11
     apply(patch) {
       if (patch.status !== "ready") return;
       const target = resolveTarget(patch.nodeId);
-      if (target === undefined) return;
+      if (true) return;
       const next = renderableValues(patch.values);
       const previous = lastApplied.get(target) ?? {};
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] LogicalOperator
core/src/adapters/dom.ts:52:24
       const target = resolveTarget(patch.nodeId);
       if (target === undefined) return;
       const next = renderableValues(patch.values);
-      const previous = lastApplied.get(target) ?? {};
+      const previous = lastApplied.get(target) && {};
       const dirty: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(next))
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Cannot read properties of undefined (reading 'opacity')

[Killed] ConditionalExpression
core/src/adapters/dom.ts:55:13
       const previous = lastApplied.get(target) ?? {};
       const dirty: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(next))
-        if (!Object.is(previous[key], value)) dirty[key] = value;
+        if (false) dirty[key] = value;
       for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
       if (Object.keys(dirty).length === 0) return;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BooleanLiteral
core/src/adapters/dom.ts:55:13
       const previous = lastApplied.get(target) ?? {};
       const dirty: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(next))
-        if (!Object.is(previous[key], value)) dirty[key] = value;
+        if (Object.is(previous[key], value)) dirty[key] = value;
       for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
       if (Object.keys(dirty).length === 0) return;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BooleanLiteral
core/src/adapters/dom.ts:56:52
       const dirty: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(next))
         if (!Object.is(previous[key], value)) dirty[key] = value;
-      for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
+      for (const key of Object.keys(previous)) if (key in next) dirty[key] = undefined;
       if (Object.keys(dirty).length === 0) return;
       write(target, dirty);
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
core/src/adapters/dom.ts:56:52
       const dirty: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(next))
         if (!Object.is(previous[key], value)) dirty[key] = value;
-      for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
+      for (const key of Object.keys(previous)) if (true) dirty[key] = undefined;
       if (Object.keys(dirty).length === 0) return;
       write(target, dirty);
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
core/src/adapters/dom.ts:57:11
       for (const [key, value] of Object.entries(next))
         if (!Object.is(previous[key], value)) dirty[key] = value;
       for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
-      if (Object.keys(dirty).length === 0) return;
+      if (true) return;
       write(target, dirty);
       lastApplied.set(target, next);
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [] to deeply equal [ { target: { style: {} }, …(1) } ]

[Killed] ConditionalExpression
core/src/adapters/dom.ts:57:11
       for (const [key, value] of Object.entries(next))
         if (!Object.is(previous[key], value)) dirty[key] = value;
       for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
-      if (Object.keys(dirty).length === 0) return;
+      if (false) return;
       write(target, dirty);
       lastApplied.set(target, next);
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] BlockStatement
core/src/adapters/dom.ts:61:19
       write(target, dirty);
       lastApplied.set(target, next);
     },
-    clear(target) {
-      if (target === undefined) return;
-      lastApplied.delete(target);
-    },
+    clear(target) {},
   };
 }
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected undefined to deeply equal { target: { style: {} }, …(1) }

[Killed] EqualityOperator
core/src/adapters/dom.ts:62:11
       lastApplied.set(target, next);
     },
     clear(target) {
-      if (target === undefined) return;
+      if (target !== undefined) return;
       lastApplied.delete(target);
     },
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected undefined to deeply equal { target: { style: {} }, …(1) }

[Killed] ConditionalExpression
core/src/adapters/dom.ts:62:11
       lastApplied.set(target, next);
     },
     clear(target) {
-      if (target === undefined) return;
+      if (true) return;
       lastApplied.delete(target);
     },
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected undefined to deeply equal { target: { style: {} }, …(1) }
