[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:43:64
   readonly end: number;
 }
 
-function readStops(property: unknown): readonly AuthoredStop[] {
-  if (!property || typeof property !== "object" || !("stops" in property)) return [];
-  const stops = (property as { stops?: unknown }).stops;
-  if (!Array.isArray(stops)) return [];
-  return stops.filter((stop): stop is AuthoredStop =>
-    Boolean(
-      stop &&
-        typeof stop === "object" &&
-        typeof (stop as { p?: unknown }).p === "number" &&
-        Number.isFinite((stop as { p: number }).p) &&
-        "v" in stop,
-    ),
-  );
-}
+function readStops(property: unknown): readonly AuthoredStop[] {}
 
 function readDuration(config: unknown): number {
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:44:52
 }
 
 function readStops(property: unknown): readonly AuthoredStop[] {
-  if (!property || typeof property !== "object" || !("stops" in property)) return [];
+  if (!property || typeof property !== "object" || "stops" in property) return [];
   const stops = (property as { stops?: unknown }).stops;
   if (!Array.isArray(stops)) return [];
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:44:7
 }
 
 function readStops(property: unknown): readonly AuthoredStop[] {
-  if (!property || typeof property !== "object" || !("stops" in property)) return [];
+  if (true) return [];
   const stops = (property as { stops?: unknown }).stops;
   if (!Array.isArray(stops)) return [];
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 5e-7

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:46:7
 function readStops(property: unknown): readonly AuthoredStop[] {
   if (!property || typeof property !== "object" || !("stops" in property)) return [];
   const stops = (property as { stops?: unknown }).stops;
-  if (!Array.isArray(stops)) return [];
+  if (Array.isArray(stops)) return [];
   return stops.filter((stop): stop is AuthoredStop =>
     Boolean(
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:46:7
 function readStops(property: unknown): readonly AuthoredStop[] {
   if (!property || typeof property !== "object" || !("stops" in property)) return [];
   const stops = (property as { stops?: unknown }).stops;
-  if (!Array.isArray(stops)) return [];
+  if (true) return [];
   return stops.filter((stop): stop is AuthoredStop =>
     Boolean(
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ArrowFunction
src/adapters/interpolator/gsap.ts:47:23
   if (!property || typeof property !== "object" || !("stops" in property)) return [];
   const stops = (property as { stops?: unknown }).stops;
   if (!Array.isArray(stops)) return [];
-  return stops.filter((stop): stop is AuthoredStop =>
-    Boolean(
-      stop &&
-        typeof stop === "object" &&
-        typeof (stop as { p?: unknown }).p === "number" &&
-        Number.isFinite((stop as { p: number }).p) &&
-        "v" in stop,
-    ),
+  return stops.filter(() => undefined,
   );
 }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Survived] MethodExpression
src/adapters/interpolator/gsap.ts:47:10
   if (!property || typeof property !== "object" || !("stops" in property)) return [];
   const stops = (property as { stops?: unknown }).stops;
   if (!Array.isArray(stops)) return [];
-  return stops.filter((stop): stop is AuthoredStop =>
-    Boolean(
-      stop &&
-        typeof stop === "object" &&
-        typeof (stop as { p?: unknown }).p === "number" &&
-        Number.isFinite((stop as { p: number }).p) &&
-        "v" in stop,
-    ),
-  );
+  return stops;
 }
 

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:49:7
   if (!Array.isArray(stops)) return [];
   return stops.filter((stop): stop is AuthoredStop =>
     Boolean(
-      stop &&
-        typeof stop === "object" &&
-        typeof (stop as { p?: unknown }).p === "number" &&
-        Number.isFinite((stop as { p: number }).p) &&
-        "v" in stop,
+      false,
     ),
   );
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Survived] LogicalOperator
src/adapters/interpolator/gsap.ts:49:7
   if (!Array.isArray(stops)) return [];
   return stops.filter((stop): stop is AuthoredStop =>
     Boolean(
-      stop &&
-        typeof stop === "object" &&
-        typeof (stop as { p?: unknown }).p === "number" &&
+      stop && typeof stop === "object" || typeof (stop as {
+  p?: unknown;
+}).p === "number" &&
         Number.isFinite((stop as { p: number }).p) &&
         "v" in stop,

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:50:9
   return stops.filter((stop): stop is AuthoredStop =>
     Boolean(
       stop &&
-        typeof stop === "object" &&
+        typeof stop !== "object" &&
         typeof (stop as { p?: unknown }).p === "number" &&
         Number.isFinite((stop as { p: number }).p) &&
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Survived] ConditionalExpression
src/adapters/interpolator/gsap.ts:50:9
   return stops.filter((stop): stop is AuthoredStop =>
     Boolean(
       stop &&
-        typeof stop === "object" &&
+        true &&
         typeof (stop as { p?: unknown }).p === "number" &&
         Number.isFinite((stop as { p: number }).p) &&

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:51:9
     Boolean(
       stop &&
         typeof stop === "object" &&
-        typeof (stop as { p?: unknown }).p === "number" &&
+        typeof (stop as {
+  p?: unknown;
+}).p !== "number" &&
         Number.isFinite((stop as { p: number }).p) &&
         "v" in stop,
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Survived] ConditionalExpression
src/adapters/interpolator/gsap.ts:51:9
     Boolean(
       stop &&
         typeof stop === "object" &&
-        typeof (stop as { p?: unknown }).p === "number" &&
+        true &&
         Number.isFinite((stop as { p: number }).p) &&
         "v" in stop,

[Killed] StringLiteral
src/adapters/interpolator/gsap.ts:53:9
         typeof stop === "object" &&
         typeof (stop as { p?: unknown }).p === "number" &&
         Number.isFinite((stop as { p: number }).p) &&
-        "v" in stop,
+        "" in stop,
     ),
   );
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:58:48
   );
 }
 
-function readDuration(config: unknown): number {
-  if (!config || typeof config !== "object") return 1;
-  const duration = (config as { duration?: unknown }).duration;
-  return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
-}
+function readDuration(config: unknown): number {}
 
 function compileKeyframes(config: unknown): CompiledKeyframes {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected 1 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:59:18
 }
 
 function readDuration(config: unknown): number {
-  if (!config || typeof config !== "object") return 1;
+  if (!config || typeof config === "object") return 1;
   const duration = (config as { duration?: unknown }).duration;
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
killedBy: GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
statusReason: expected 1 to be close to 2, received difference is 1, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:59:7
 }
 
 function readDuration(config: unknown): number {
-  if (!config || typeof config !== "object") return 1;
+  if (true) return 1;
   const duration = (config as { duration?: unknown }).duration;
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
killedBy: GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
statusReason: expected 1 to be close to 2, received difference is 1, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:61:10
 function readDuration(config: unknown): number {
   if (!config || typeof config !== "object") return 1;
   const duration = (config as { duration?: unknown }).duration;
-  return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+  return true ? duration : 1;
 }
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected 1 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:61:10
 function readDuration(config: unknown): number {
   if (!config || typeof config !== "object") return 1;
   const duration = (config as { duration?: unknown }).duration;
-  return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+  return false ? duration : 1;
 }
 
killedBy: GSAP authored-duration pinning (P0-3b) scales the pinned duration by the configured track duration
statusReason: expected 1 to be close to 2, received difference is 1, but expected 5e-11

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:65:48
 }
 
 function compileKeyframes(config: unknown): CompiledKeyframes {
-  if (!config || typeof config !== "object" || !("keyframes" in config))
+  if (!config || typeof config !== "object" || "keyframes" in config)
     return { initial: {}, segments: [], end: 0 };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 5e-7

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:65:18
 }
 
 function compileKeyframes(config: unknown): CompiledKeyframes {
-  if (!config || typeof config !== "object" || !("keyframes" in config))
+  if (!config || typeof config === "object" || !("keyframes" in config))
     return { initial: {}, segments: [], end: 0 };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:68:7
   if (!config || typeof config !== "object" || !("keyframes" in config))
     return { initial: {}, segments: [], end: 0 };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
-  if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+  if (true)
     return { initial: {}, segments: [], end: 0 };
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:68:21
   if (!config || typeof config !== "object" || !("keyframes" in config))
     return { initial: {}, segments: [], end: 0 };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
-  if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
+  if (!keyframes || typeof keyframes === "object" || Array.isArray(keyframes))
     return { initial: {}, segments: [], end: 0 };
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[NoCoverage] ObjectLiteral
src/adapters/interpolator/gsap.ts:69:12
     return { initial: {}, segments: [], end: 0 };
   const keyframes = (config as { keyframes?: unknown }).keyframes;
   if (!keyframes || typeof keyframes !== "object" || Array.isArray(keyframes))
-    return { initial: {}, segments: [], end: 0 };
+    return {};
 
   const initial: Record<string, unknown> = {};

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:74:60
   const initial: Record<string, unknown> = {};
   const segments: CompiledSegment[] = [];
   let end = 0;
-  for (const [key, property] of Object.entries(keyframes)) {
-    const stops = readStops(property);
-    const first = stops[0];
-    if (first === undefined) continue;
-    initial[key] = first.v;
-    for (let index = 1; index < stops.length; index += 1) {
-      const previous = stops[index - 1];
-      const stop = stops[index];
-      if (previous === undefined || stop === undefined) continue;
-      segments.push({
-        key,
-        value: stop.v,
-        start: previous.p,
-        duration: Math.max(0, stop.p - previous.p),
-        ...(stop.ease === undefined ? {} : { ease: stop.ease }),
-      });
-    }
-    const last = stops[stops.length - 1];
-    if (last !== undefined) end = Math.max(end, last.p);
-  }
+  for (const [key, property] of Object.entries(keyframes)) {}
   return { initial, segments, end };
 }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:77:9
   for (const [key, property] of Object.entries(keyframes)) {
     const stops = readStops(property);
     const first = stops[0];
-    if (first === undefined) continue;
+    if (true) continue;
     initial[key] = first.v;
     for (let index = 1; index < stops.length; index += 1) {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:77:9
   for (const [key, property] of Object.entries(keyframes)) {
     const stops = readStops(property);
     const first = stops[0];
-    if (first === undefined) continue;
+    if (first !== undefined) continue;
     initial[key] = first.v;
     for (let index = 1; index < stops.length; index += 1) {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:79:25
     const first = stops[0];
     if (first === undefined) continue;
     initial[key] = first.v;
-    for (let index = 1; index < stops.length; index += 1) {
+    for (let index = 1; false; index += 1) {
       const previous = stops[index - 1];
       const stop = stops[index];
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:79:59
     const first = stops[0];
     if (first === undefined) continue;
     initial[key] = first.v;
-    for (let index = 1; index < stops.length; index += 1) {
-      const previous = stops[index - 1];
-      const stop = stops[index];
-      if (previous === undefined || stop === undefined) continue;
-      segments.push({
-        key,
-        value: stop.v,
-        start: previous.p,
-        duration: Math.max(0, stop.p - previous.p),
-        ...(stop.ease === undefined ? {} : { ease: stop.ease }),
-      });
-    }
+    for (let index = 1; index < stops.length; index += 1) {}
     const last = stops[stops.length - 1];
     if (last !== undefined) end = Math.max(end, last.p);
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ArithmeticOperator
src/adapters/interpolator/gsap.ts:80:30
     if (first === undefined) continue;
     initial[key] = first.v;
     for (let index = 1; index < stops.length; index += 1) {
-      const previous = stops[index - 1];
+      const previous = stops[index + 1];
       const stop = stops[index];
       if (previous === undefined || stop === undefined) continue;
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected +0 to be close to 50, received difference is 50, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:82:11
     for (let index = 1; index < stops.length; index += 1) {
       const previous = stops[index - 1];
       const stop = stops[index];
-      if (previous === undefined || stop === undefined) continue;
+      if (true) continue;
       segments.push({
         key,
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:82:37
     for (let index = 1; index < stops.length; index += 1) {
       const previous = stops[index - 1];
       const stop = stops[index];
-      if (previous === undefined || stop === undefined) continue;
+      if (previous === undefined || stop !== undefined) continue;
       segments.push({
         key,
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected +0 to be close to 50, received difference is 50, but expected 5e-7

[Killed] MethodExpression
src/adapters/interpolator/gsap.ts:87:19
         key,
         value: stop.v,
         start: previous.p,
-        duration: Math.max(0, stop.p - previous.p),
+        duration: Math.min(0, stop.p - previous.p),
         ...(stop.ease === undefined ? {} : { ease: stop.ease }),
       });
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected 1 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ArithmeticOperator
src/adapters/interpolator/gsap.ts:87:31
         key,
         value: stop.v,
         start: previous.p,
-        duration: Math.max(0, stop.p - previous.p),
+        duration: Math.max(0, stop.p + previous.p),
         ...(stop.ease === undefined ? {} : { ease: stop.ease }),
       });
killedBy: GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
statusReason: expected { x: 50, y: 40 } to deeply equal { x: 50, y: 50 }

[Survived] ConditionalExpression
src/adapters/interpolator/gsap.ts:88:13
         value: stop.v,
         start: previous.p,
         duration: Math.max(0, stop.p - previous.p),
-        ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+        ...(false ? {} : { ease: stop.ease }),
       });
     }

[Survived] EqualityOperator
src/adapters/interpolator/gsap.ts:88:13
         value: stop.v,
         start: previous.p,
         duration: Math.max(0, stop.p - previous.p),
-        ...(stop.ease === undefined ? {} : { ease: stop.ease }),
+        ...(stop.ease !== undefined ? {} : { ease: stop.ease }),
       });
     }

[Killed] ArithmeticOperator
src/adapters/interpolator/gsap.ts:91:24
         ...(stop.ease === undefined ? {} : { ease: stop.ease }),
       });
     }
-    const last = stops[stops.length - 1];
+    const last = stops[stops.length + 1];
     if (last !== undefined) end = Math.max(end, last.p);
   }
killedBy: GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
statusReason: expected { x: 100, y: 100, authoredEnd: 1 } to deeply equal { x: 100, y: 100 }

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:92:9
       });
     }
     const last = stops[stops.length - 1];
-    if (last !== undefined) end = Math.max(end, last.p);
+    if (last === undefined) end = Math.max(end, last.p);
   }
   return { initial, segments, end };
killedBy: GSAP authored-duration pinning (P0-3b) pins only when the tail is short, and never through the published proxy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/adapters/interpolator/gsap.ts:92:35
       });
     }
     const last = stops[stops.length - 1];
-    if (last !== undefined) end = Math.max(end, last.p);
+    if (last !== undefined) end = Math.min(end, last.p);
   }
   return { initial, segments, end };
killedBy: GSAP authored-duration pinning (P0-3b) pins only when the tail is short, and never through the published proxy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:115:90
  * An `end` beyond 1 is left alone. Authored positions outside `[0, 1]` are a validation concern
  * (P1-10), and silently trimming them here would hide the authored mistake.
  */
-function pinAuthoredEnd(timeline: GsapTimelineLike, end: number, duration: number): void {
-  if (duration <= 0 || end >= 1) return;
-  const anchor: Record<string, unknown> = { authoredEnd: 0 };
-  timeline.to(anchor, { authoredEnd: 1, duration: 0 }, duration);
-}
+function pinAuthoredEnd(timeline: GsapTimelineLike, end: number, duration: number): void {}
 
 export function createGsapInterpolator(gsap: GsapLike): Interpolator {
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected 0.5 to be close to 1, received difference is 0.5, but expected 5e-11

[Killed] LogicalOperator
src/adapters/interpolator/gsap.ts:116:7
  * (P1-10), and silently trimming them here would hide the authored mistake.
  */
 function pinAuthoredEnd(timeline: GsapTimelineLike, end: number, duration: number): void {
-  if (duration <= 0 || end >= 1) return;
+  if (duration <= 0 && end >= 1) return;
   const anchor: Record<string, unknown> = { authoredEnd: 0 };
   timeline.to(anchor, { authoredEnd: 1, duration: 0 }, duration);
killedBy: GSAP authored-duration pinning (P0-3b) pins only when the tail is short, and never through the published proxy
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:116:24
  * (P1-10), and silently trimming them here would hide the authored mistake.
  */
 function pinAuthoredEnd(timeline: GsapTimelineLike, end: number, duration: number): void {
-  if (duration <= 0 || end >= 1) return;
+  if (duration <= 0 || end > 1) return;
   const anchor: Record<string, unknown> = { authoredEnd: 0 };
   timeline.to(anchor, { authoredEnd: 1, duration: 0 }, duration);
killedBy: GSAP authored-duration pinning (P0-3b) pins only when the tail is short, and never through the published proxy
statusReason: expected 2 to be 1 // Object.is equality

[Survived] ObjectLiteral
src/adapters/interpolator/gsap.ts:117:43
  */
 function pinAuthoredEnd(timeline: GsapTimelineLike, end: number, duration: number): void {
   if (duration <= 0 || end >= 1) return;
-  const anchor: Record<string, unknown> = { authoredEnd: 0 };
+  const anchor: Record<string, unknown> = {};
   timeline.to(anchor, { authoredEnd: 1, duration: 0 }, duration);
 }

[Killed] ObjectLiteral
src/adapters/interpolator/gsap.ts:118:23
 function pinAuthoredEnd(timeline: GsapTimelineLike, end: number, duration: number): void {
   if (duration <= 0 || end >= 1) return;
   const anchor: Record<string, unknown> = { authoredEnd: 0 };
-  timeline.to(anchor, { authoredEnd: 1, duration: 0 }, duration);
+  timeline.to(anchor, {}, duration);
 }
 
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected 1.5 to be close to 1, received difference is 0.5, but expected 5e-11

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:125:48
   return {
     create(config): InterpolationTimeline {
       const proxy: Record<string, unknown> = {};
-      const timeline = gsap.timeline({ paused: true });
+      const timeline = gsap.timeline({ paused: false });
       const compiled = compileKeyframes(config);
       Object.assign(proxy, compiled.initial);
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/adapters/interpolator/gsap.ts:125:38
   return {
     create(config): InterpolationTimeline {
       const proxy: Record<string, unknown> = {};
-      const timeline = gsap.timeline({ paused: true });
+      const timeline = gsap.timeline({});
       const compiled = compileKeyframes(config);
       Object.assign(proxy, compiled.initial);
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:129:48
       const compiled = compileKeyframes(config);
       Object.assign(proxy, compiled.initial);
       const duration = readDuration(config);
-      for (const segment of compiled.segments) {
-        timeline.to(
-          proxy,
-          {
-            [segment.key]: segment.value,
-            duration: segment.duration * duration,
-            ease: segment.ease ?? "none",
-          },
-          segment.start * duration,
-        );
-      }
+      for (const segment of compiled.segments) {}
       pinAuthoredEnd(timeline, compiled.end, duration);
       function progress(): number;
killedBy: adapter ports compiles authored stops onto an adapter-owned proxy state
statusReason: expected { x: +0 } to deeply equal { x: 50 }

[Killed] ObjectLiteral
src/adapters/interpolator/gsap.ts:132:11
       for (const segment of compiled.segments) {
         timeline.to(
           proxy,
-          {
-            [segment.key]: segment.value,
-            duration: segment.duration * duration,
-            ease: segment.ease ?? "none",
-          },
+          {},
           segment.start * duration,
         );
killedBy: GSAP multi-stop compilation (B2) interpolates authored stops at 0, 0.5, and 1 using real GSAP state
statusReason: expected { Object (x, _gsap) } to match object { x: 50 }
(6 matching properties omitted from actual)

[Survived] ArithmeticOperator
src/adapters/interpolator/gsap.ts:134:23
           proxy,
           {
             [segment.key]: segment.value,
-            duration: segment.duration * duration,
+            duration: segment.duration / duration,
             ease: segment.ease ?? "none",
           },

[Killed] LogicalOperator
src/adapters/interpolator/gsap.ts:135:19
           {
             [segment.key]: segment.value,
             duration: segment.duration * duration,
-            ease: segment.ease ?? "none",
+            ease: segment.ease && "none",
           },
           segment.start * duration,
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected 75 to be close to 50, received difference is 25, but expected 5e-7

[Killed] StringLiteral
src/adapters/interpolator/gsap.ts:135:35
           {
             [segment.key]: segment.value,
             duration: segment.duration * duration,
-            ease: segment.ease ?? "none",
+            ease: segment.ease ?? "",
           },
           segment.start * duration,
killedBy: GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
statusReason: expected 32 to be close to 20, received difference is 12, but expected 5e-7

[Survived] ArithmeticOperator
src/adapters/interpolator/gsap.ts:137:11
             duration: segment.duration * duration,
             ease: segment.ease ?? "none",
           },
-          segment.start * duration,
+          segment.start / duration,
         );
       }
