[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:143:56
       pinAuthoredEnd(timeline, compiled.end, duration);
       function progress(): number;
       function progress(value: number): void;
-      function progress(value?: number): number | void {
-        if (value === undefined) return timeline.progress();
-        timeline.progress(value);
-      }
+      function progress(value?: number): number | void {}
       return {
         get duration() {
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected +0 to be close to 50, received difference is 50, but expected 5e-7

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:144:13
       function progress(): number;
       function progress(value: number): void;
       function progress(value?: number): number | void {
-        if (value === undefined) return timeline.progress();
+        if (value !== undefined) return timeline.progress();
         timeline.progress(value);
       }
killedBy: GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
statusReason: expected {} to deeply equal { x: +0 }

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:144:13
       function progress(): number;
       function progress(value: number): void;
       function progress(value?: number): number | void {
-        if (value === undefined) return timeline.progress();
+        if (true) return timeline.progress();
         timeline.progress(value);
       }
killedBy: GSAP absolute multi-property stops (P0-3) preserves each property's absolute positions and independent timing
statusReason: expected {} to deeply equal { x: +0 }

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:148:24
         timeline.progress(value);
       }
       return {
-        get duration() {
-          return timeline.duration();
-        },
+        get duration() {},
         state: proxy,
         progress,
killedBy: GSAP absolute multi-property stops (P0-3) keeps per-property grids and the leading hold intact on real GSAP
statusReason: expected undefined to be close to 1, received difference is NaN, but expected 5e-11

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:153:22
         },
         state: proxy,
         progress,
-        kill(): void {
-          timeline.kill();
-        },
+        kill(): void {},
       };
     },
killedBy: adapter ports compiles authored stops onto an adapter-owned proxy state
statusReason: expected false to be true // Object.is equality
