[Survived] BlockStatement
core/src/runtime/graph-publisher.ts:24:65
   readonly error: unknown;
 }
 
-function diagnostic(nodeId: string, error: unknown): Diagnostic {
-  return Object.freeze({
-    ruleId: "composition-failure",
-    path: nodeId,
-    message: error instanceof Error ? error.message : String(error),
-    severity: "error",
-    ids: Object.freeze([nodeId]),
-  });
-}
+function diagnostic(nodeId: string, error: unknown): Diagnostic {}
 
 function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {

[Survived] StringLiteral
core/src/runtime/graph-publisher.ts:26:13
 
 function diagnostic(nodeId: string, error: unknown): Diagnostic {
   return Object.freeze({
-    ruleId: "composition-failure",
+    ruleId: "",
     path: nodeId,
     message: error instanceof Error ? error.message : String(error),

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:34:62
   });
 }
 
-function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {
-  const left = edgeKey(a);
-  const right = edgeKey(b);
-  return left < right ? -1 : left > right ? 1 : 0;
-}
+function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {}
 
 function mergeValues(
killedBy: GraphPublisher output edges uses canonical edge order when output sources collide
statusReason: expected { color: 'a' } to deeply equal { color: 'b' }

[Killed] UnaryOperator
core/src/runtime/graph-publisher.ts:37:25
 function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {
   const left = edgeKey(a);
   const right = edgeKey(b);
-  return left < right ? -1 : left > right ? 1 : 0;
+  return left < right ? +1 : left > right ? 1 : 0;
 }
 
killedBy: GraphPublisher output edges uses canonical edge order when output sources collide
statusReason: expected { color: 'a' } to deeply equal { color: 'b' }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:37:10
 function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {
   const left = edgeKey(a);
   const right = edgeKey(b);
-  return left < right ? -1 : left > right ? 1 : 0;
+  return left >= right ? -1 : left > right ? 1 : 0;
 }
 
killedBy: GraphPublisher output edges uses canonical edge order when output sources collide
statusReason: expected { color: 'a' } to deeply equal { color: 'b' }

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:43:38
 function mergeValues(
   base: Readonly<Record<string, unknown>>,
   overlay: Readonly<Record<string, unknown>> | undefined,
-): Readonly<Record<string, unknown>> {
-  if (overlay === undefined) return base;
-  return Object.freeze({ ...base, ...overlay });
-}
+): Readonly<Record<string, unknown>> {}
 
 /**
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:44:7
   base: Readonly<Record<string, unknown>>,
   overlay: Readonly<Record<string, unknown>> | undefined,
 ): Readonly<Record<string, unknown>> {
-  if (overlay === undefined) return base;
+  if (overlay !== undefined) return base;
   return Object.freeze({ ...base, ...overlay });
 }
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected { base: 1 } to deeply equal { base: 1, overlay: 99 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:44:7
   base: Readonly<Record<string, unknown>>,
   overlay: Readonly<Record<string, unknown>> | undefined,
 ): Readonly<Record<string, unknown>> {
-  if (overlay === undefined) return base;
+  if (true) return base;
   return Object.freeze({ ...base, ...overlay });
 }
killedBy: GraphPublisher output edges merges output source values over the composed patch
statusReason: expected { x: 10 } to deeply equal { opacity: 0.5, x: 10 }

[Killed] ObjectLiteral
core/src/runtime/graph-publisher.ts:45:24
   overlay: Readonly<Record<string, unknown>> | undefined,
 ): Readonly<Record<string, unknown>> {
   if (overlay === undefined) return base;
-  return Object.freeze({ ...base, ...overlay });
+  return Object.freeze({});
 }
 
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:56:40
 export class GraphPublisher {
   readonly #registry: PatchRegistry;
 
-  constructor(registry: PatchRegistry) {
-    this.#registry = registry;
-  }
+  constructor(registry: PatchRegistry) {}
 
   flush(snapshot: PublisherSnapshot, seeds: readonly string[], tick: number): PatchBatch {
killedBy: GraphPublisher output edges merges output source values over the composed patch
statusReason: Cannot read properties of undefined (reading 'notifying')

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:64:9
     // Traversal is not a scheduler. Deciding what to do with a flush requested from inside a
     // subscriber belongs to the runtime that owns ticks and seeds, so refuse it here before
     // any batch state is touched instead of silently nesting a publication.
-    if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (true) throw new Error(REENTRANT_BATCH_MESSAGE);
     const byId = new Map(snapshot.nodes.map((node) => [node.id, node]));
     const dependents = new Map<string, string[]>();
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Survived] ConditionalExpression
core/src/runtime/graph-publisher.ts:64:9
     // Traversal is not a scheduler. Deciding what to do with a flush requested from inside a
     // subscriber belongs to the runtime that owns ticks and seeds, so refuse it here before
     // any batch state is touched instead of silently nesting a publication.
-    if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (false) throw new Error(REENTRANT_BATCH_MESSAGE);
     const byId = new Map(snapshot.nodes.map((node) => [node.id, node]));
     const dependents = new Map<string, string[]>();

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:65:45
     // subscriber belongs to the runtime that owns ticks and seeds, so refuse it here before
     // any batch state is touched instead of silently nesting a publication.
     if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
-    const byId = new Map(snapshot.nodes.map((node) => [node.id, node]));
+    const byId = new Map(snapshot.nodes.map(() => undefined));
     const dependents = new Map<string, string[]>();
     for (const node of snapshot.nodes) dependents.set(node.id, []);
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ArrayDeclaration
core/src/runtime/graph-publisher.ts:65:55
     // subscriber belongs to the runtime that owns ticks and seeds, so refuse it here before
     // any batch state is touched instead of silently nesting a publication.
     if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
-    const byId = new Map(snapshot.nodes.map((node) => [node.id, node]));
+    const byId = new Map(snapshot.nodes.map((node) => []));
     const dependents = new Map<string, string[]>();
     for (const node of snapshot.nodes) dependents.set(node.id, []);
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Survived] OptionalChaining
core/src/runtime/graph-publisher.ts:69:38
     const dependents = new Map<string, string[]>();
     for (const node of snapshot.nodes) dependents.set(node.id, []);
     for (const node of snapshot.nodes)
-      for (const edge of node.edges) dependents.get(edge.sourceId)?.push(node.id);
+      for (const edge of node.edges) dependents.get(edge.sourceId).push(node.id);
 
     const affected = new Set<string>();

[Killed] ArrayDeclaration
core/src/runtime/graph-publisher.ts:72:19
       for (const edge of node.edges) dependents.get(edge.sourceId)?.push(node.id);
 
     const affected = new Set<string>();
-    const queue = [...seeds];
+    const queue = [];
     for (let index = 0; index < queue.length; index += 1) {
       const id = queue[index];
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:73:25
 
     const affected = new Set<string>();
     const queue = [...seeds];
-    for (let index = 0; index < queue.length; index += 1) {
+    for (let index = 0; false; index += 1) {
       const id = queue[index];
       if (id === undefined || affected.has(id)) continue;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:73:25
 
     const affected = new Set<string>();
     const queue = [...seeds];
-    for (let index = 0; index < queue.length; index += 1) {
+    for (let index = 0; index >= queue.length; index += 1) {
       const id = queue[index];
       if (id === undefined || affected.has(id)) continue;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:75:11
     const queue = [...seeds];
     for (let index = 0; index < queue.length; index += 1) {
       const id = queue[index];
-      if (id === undefined || affected.has(id)) continue;
+      if (true) continue;
       affected.add(id);
       queue.push(...(dependents.get(id) ?? []));
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:75:11
     const queue = [...seeds];
     for (let index = 0; index < queue.length; index += 1) {
       const id = queue[index];
-      if (id === undefined || affected.has(id)) continue;
+      if (id !== undefined || affected.has(id)) continue;
       affected.add(id);
       queue.push(...(dependents.get(id) ?? []));
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected [] to deeply equal [ 'flush-failure' ]

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:77:22
       const id = queue[index];
       if (id === undefined || affected.has(id)) continue;
       affected.add(id);
-      queue.push(...(dependents.get(id) ?? []));
+      queue.push(...(dependents.get(id) && []));
     }
 
killedBy: GraphPublisher partial-seed inputs uses the last published value for an unseeded input source
statusReason: expected undefined to deeply equal { total: 7 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:86:13
     this.#registry.beginBatch(tick, seeds);
     try {
       for (const id of snapshot.order) {
-        if (!affected.has(id)) continue;
+        if (true) continue;
         const node = byId.get(id);
         if (node === undefined) continue;
killedBy: GraphPublisher partial-seed inputs uses the last published value for an unseeded input source
statusReason: expected undefined to deeply equal { total: 7 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:86:13
     this.#registry.beginBatch(tick, seeds);
     try {
       for (const id of snapshot.order) {
-        if (!affected.has(id)) continue;
+        if (false) continue;
         const node = byId.get(id);
         if (node === undefined) continue;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected { nodeId: 'caption/label', …(6) } to be undefined

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:88:13
       for (const id of snapshot.order) {
         if (!affected.has(id)) continue;
         const node = byId.get(id);
-        if (node === undefined) continue;
+        if (node !== undefined) continue;
         const sourceFailure = node.edges
           .map((edge) => edge.sourceId)
killedBy: Engine publishes a progress change through the existing graph runtime
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:88:13
       for (const id of snapshot.order) {
         if (!affected.has(id)) continue;
         const node = byId.get(id);
-        if (node === undefined) continue;
+        if (true) continue;
         const sourceFailure = node.edges
           .map((edge) => edge.sourceId)
killedBy: Engine publishes a progress change through the existing graph runtime
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:90:16
         const node = byId.get(id);
         if (node === undefined) continue;
         const sourceFailure = node.edges
-          .map((edge) => edge.sourceId)
+          .map(() => undefined)
           .find((sourceId) => failed.has(sourceId) || blocked.has(sourceId));
         if (sourceFailure !== undefined) {
killedBy: GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue
statusReason: expected [ [ 'bad', 'error' ], …(2) ] to deeply equal [ [ 'bad', 'error' ], …(2) ]

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:91:31
         if (node === undefined) continue;
         const sourceFailure = node.edges
           .map((edge) => edge.sourceId)
-          .find((sourceId) => failed.has(sourceId) || blocked.has(sourceId));
+          .find((sourceId) => true);
         if (sourceFailure !== undefined) {
           blocked.add(id);
killedBy: GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
statusReason: expected Map{ 'root' => 1 } to deeply equal Map{ 'root' => 1, 'left' => 1, …(2) }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:91:31
         if (node === undefined) continue;
         const sourceFailure = node.edges
           .map((edge) => edge.sourceId)
-          .find((sourceId) => failed.has(sourceId) || blocked.has(sourceId));
+          .find((sourceId) => false);
         if (sourceFailure !== undefined) {
           blocked.add(id);
killedBy: GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue
statusReason: expected [ [ 'bad', 'error' ], …(2) ] to deeply equal [ [ 'bad', 'error' ], …(2) ]

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:92:13
         const sourceFailure = node.edges
           .map((edge) => edge.sourceId)
           .find((sourceId) => failed.has(sourceId) || blocked.has(sourceId));
-        if (sourceFailure !== undefined) {
+        if (false) {
           blocked.add(id);
           this.#registry.publish({
killedBy: GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue
statusReason: expected [ [ 'bad', 'error' ], …(2) ] to deeply equal [ [ 'bad', 'error' ], …(2) ]

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:92:42
         const sourceFailure = node.edges
           .map((edge) => edge.sourceId)
           .find((sourceId) => failed.has(sourceId) || blocked.has(sourceId));
-        if (sourceFailure !== undefined) {
-          blocked.add(id);
-          this.#registry.publish({
-            nodeId: id,
-            sourceProgress: 0,
-            status: "blocked",
-            diagnostics: [
-              Object.freeze({
-                ruleId: "blocked-upstream",
-                path: id,
-                message: `Blocked by upstream failure at ${sourceFailure}.`,
-                severity: "error",
-                ids: Object.freeze([sourceFailure, id]),
-              }),
-            ],
-          });
-          continue;
-        }
+        if (sourceFailure !== undefined) {}
         try {
           const inputs: Record<string, unknown> = {};
killedBy: GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue
statusReason: expected [ [ 'bad', 'error' ], …(2) ] to deeply equal [ [ 'bad', 'error' ], …(2) ]

[Survived] StringLiteral
core/src/runtime/graph-publisher.ts:100:25
             status: "blocked",
             diagnostics: [
               Object.freeze({
-                ruleId: "blocked-upstream",
+                ruleId: "",
                 path: id,
                 message: `Blocked by upstream failure at ${sourceFailure}.`,

[Survived] StringLiteral
core/src/runtime/graph-publisher.ts:102:26
               Object.freeze({
                 ruleId: "blocked-upstream",
                 path: id,
-                message: `Blocked by upstream failure at ${sourceFailure}.`,
+                message: ``,
                 severity: "error",
                 ids: Object.freeze([sourceFailure, id]),

[Survived] StringLiteral
core/src/runtime/graph-publisher.ts:103:27
                 ruleId: "blocked-upstream",
                 path: id,
                 message: `Blocked by upstream failure at ${sourceFailure}.`,
-                severity: "error",
+                severity: "",
                 ids: Object.freeze([sourceFailure, id]),
               }),

[Survived] ArrayDeclaration
core/src/runtime/graph-publisher.ts:104:36
                 path: id,
                 message: `Blocked by upstream failure at ${sourceFailure}.`,
                 severity: "error",
-                ids: Object.freeze([sourceFailure, id]),
+                ids: Object.freeze([]),
               }),
             ],

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:112:42
         }
         try {
           const inputs: Record<string, unknown> = {};
-          for (const edge of node.edges) {
-            if (edge.role !== "input") continue;
-            inputs[edge.target ?? ""] =
-              memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
-          }
+          for (const edge of node.edges) {}
           const composed = node.compose(inputs);
           let values = composed.values;
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected undefined to deeply equal { base: 1, overlay: 99 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:113:17
         try {
           const inputs: Record<string, unknown> = {};
           for (const edge of node.edges) {
-            if (edge.role !== "input") continue;
+            if (true) continue;
             inputs[edge.target ?? ""] =
               memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected undefined to deeply equal { base: 1, overlay: 99 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:113:17
         try {
           const inputs: Record<string, unknown> = {};
           for (const edge of node.edges) {
-            if (edge.role !== "input") continue;
+            if (edge.role === "input") continue;
             inputs[edge.target ?? ""] =
               memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected undefined to deeply equal { base: 1, overlay: 99 }

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:114:20
           const inputs: Record<string, unknown> = {};
           for (const edge of node.edges) {
             if (edge.role !== "input") continue;
-            inputs[edge.target ?? ""] =
+            inputs[edge.target && ""] =
               memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
           }
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected undefined to deeply equal { base: 1, overlay: 99 }

[Killed] OptionalChaining
core/src/runtime/graph-publisher.ts:115:15
           for (const edge of node.edges) {
             if (edge.role !== "input") continue;
             inputs[edge.target ?? ""] =
-              memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+              memo.get(edge.sourceId).values ?? this.#registry.get(edge.sourceId)?.values;
           }
           const composed = node.compose(inputs);
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
statusReason: expected undefined to deeply equal { base: 1, overlay: 99 }

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:115:15
           for (const edge of node.edges) {
             if (edge.role !== "input") continue;
             inputs[edge.target ?? ""] =
-              memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+              memo.get(edge.sourceId)?.values && this.#registry.get(edge.sourceId)?.values;
           }
           const composed = node.compose(inputs);
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a node reprocessed on a later flush, while its input source is not, still resolves the source's merged value via the registry fallback
statusReason: expected undefined to deeply equal { base: 1, overlay: 99 }

[Killed] MethodExpression
core/src/runtime/graph-publisher.ts:119:30
           }
           const composed = node.compose(inputs);
           let values = composed.values;
-          for (const edge of node.edges
-            .filter(({ role }) => role === "output")
+          for (const edge of node.edges
             .sort(compareEdgeKeys)) {
             const sourceValues =
killedBy: GraphPublisher partial-seed inputs uses the last published value for an unseeded input source
statusReason: expected undefined to deeply equal { total: 7 }

[Killed] MethodExpression
core/src/runtime/graph-publisher.ts:119:30
           }
           const composed = node.compose(inputs);
           let values = composed.values;
-          for (const edge of node.edges
-            .filter(({ role }) => role === "output")
-            .sort(compareEdgeKeys)) {
+          for (const edge of node.edges.filter(({
+  role
+}) => role === "output")) {
             const sourceValues =
               memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
killedBy: GraphPublisher output edges uses canonical edge order when output sources collide
statusReason: expected { color: 'a' } to deeply equal { color: 'b' }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:120:35
           const composed = node.compose(inputs);
           let values = composed.values;
           for (const edge of node.edges
-            .filter(({ role }) => role === "output")
+            .filter(({ role }) => true)
             .sort(compareEdgeKeys)) {
             const sourceValues =
killedBy: GraphPublisher partial-seed inputs uses the last published value for an unseeded input source
statusReason: expected { total: 7, a: 4, b: 3 } to deeply equal { total: 7 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:120:35
           const composed = node.compose(inputs);
           let values = composed.values;
           for (const edge of node.edges
-            .filter(({ role }) => role === "output")
+            .filter(({ role }) => role !== "output")
             .sort(compareEdgeKeys)) {
             const sourceValues =
killedBy: GraphPublisher output edges merges output source values over the composed patch
statusReason: expected { x: 10 } to deeply equal { opacity: 0.5, x: 10 }

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:121:37
           let values = composed.values;
           for (const edge of node.edges
             .filter(({ role }) => role === "output")
-            .sort(compareEdgeKeys)) {
-            const sourceValues =
-              memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
-            values = mergeValues(values, sourceValues);
-          }
+            .sort(compareEdgeKeys)) {}
           // Memoize the value actually published, not the pre-merge composition. A same-flush
           // input-role consumer of this node must see what it published, not what it computed
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer of a node sees exactly what that node published, including its own output-role merge
statusReason: expected { base: 1 } to deeply equal { base: 1, overlay: 99 }

[NoCoverage] OptionalChaining
core/src/runtime/graph-publisher.ts:123:50
             .filter(({ role }) => role === "output")
             .sort(compareEdgeKeys)) {
             const sourceValues =
-              memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+              memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId).values;
             values = mergeValues(values, sourceValues);
           }

[Survived] OptionalChaining
core/src/runtime/graph-publisher.ts:123:15
             .filter(({ role }) => role === "output")
             .sort(compareEdgeKeys)) {
             const sourceValues =
-              memo.get(edge.sourceId)?.values ?? this.#registry.get(edge.sourceId)?.values;
+              memo.get(edge.sourceId).values ?? this.#registry.get(edge.sourceId)?.values;
             values = mergeValues(values, sourceValues);
           }

[Survived] ArrayDeclaration
core/src/runtime/graph-publisher.ts:136:26
             sourceProgress: composed.sourceProgress,
             sourceRevisions: composed.sourceRevisions,
             status: "ready",
-            diagnostics: [],
+            diagnostics: ["Stryker was here"],
           });
         } catch (error) {

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:138:25
             status: "ready",
             diagnostics: [],
           });
-        } catch (error) {
-          const failure = diagnostic(id, error);
-          failed.set(id, failure);
-          this.#registry.publish({
-            nodeId: id,
-            sourceProgress: 0,
-            status: "error",
-            diagnostics: [failure],
-          });
-        }
+        } catch (error) {}
       }
       return this.#registry.closeBatch();
killedBy: GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue
statusReason: expected [ [ 'child', 'ready' ], …(1) ] to deeply equal [ [ 'bad', 'error' ], …(2) ]

[Survived] ArrayDeclaration
core/src/runtime/graph-publisher.ts:145:26
             nodeId: id,
             sourceProgress: 0,
             status: "error",
-            diagnostics: [failure],
+            diagnostics: [],
           });
         }

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:150:21
         }
       }
       return this.#registry.closeBatch();
-    } catch (error) {
-      // Best-effort cleanup only. If the registry is already closed (e.g. this error IS
-      // the closeBatch() call above having already fully closed and reset state before a
-      // subscriber threw), this recovery call will itself throw -- that secondary failure
-      // must never replace the original error being propagated below.
-      try {
-        this.#registry.closeBatch();
-      } catch {
-        // intentionally swallowed; see comment above
-      }
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
statusReason: expected [Function] to throw an error

[Survived] BlockStatement
core/src/runtime/graph-publisher.ts:155:11
       // the closeBatch() call above having already fully closed and reset state before a
       // subscriber threw), this recovery call will itself throw -- that secondary failure
       // must never replace the original error being propagated below.
-      try {
-        this.#registry.closeBatch();
-      } catch {
+      try {} catch {
         // intentionally swallowed; see comment above
       }
