[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:29:80
  * nothing and names the seeds it deferred, so a reentrant caller can never mistake it for a
  * real publication. It carries the current batch identity because it did not create one.
  */
-function deferredBatch(sequence: number, seeds: readonly string[]): PatchBatch {
-  const ids = Object.freeze([...seeds]);
-  const diagnostic: Diagnostic = Object.freeze({
-    ruleId: DEFERRED_FLUSH_RULE,
-    path: ids[0] ?? "",
-    message:
-      "A flush requested while subscribers were being notified was queued as one follow-up " +
-      "invalidation for the next tick.",
-    severity: "warning",
-    ids,
-  });
-  return Object.freeze({
-    tick: sequence,
-    seeds: ids,
-    patches: Object.freeze([]),
-    diagnostics: Object.freeze([diagnostic]),
-  }) as PatchBatch;
-}
+function deferredBatch(sequence: number, seeds: readonly string[]): PatchBatch {}
 
 function describe(error: unknown): string {
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Survived] LogicalOperator
core/src/runtime/graph-runtime.ts:33:11
   const ids = Object.freeze([...seeds]);
   const diagnostic: Diagnostic = Object.freeze({
     ruleId: DEFERRED_FLUSH_RULE,
-    path: ids[0] ?? "",
+    path: ids[0] && "",
     message:
       "A flush requested while subscribers were being notified was queued as one follow-up " +

[NoCoverage] StringLiteral
core/src/runtime/graph-runtime.ts:33:21
   const ids = Object.freeze([...seeds]);
   const diagnostic: Diagnostic = Object.freeze({
     ruleId: DEFERRED_FLUSH_RULE,
-    path: ids[0] ?? "",
+    path: ids[0] ?? "Stryker was here!",
     message:
       "A flush requested while subscribers were being notified was queued as one follow-up " +

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:48:43
   }) as PatchBatch;
 }
 
-function describe(error: unknown): string {
-  return error instanceof Error ? error.message : String(error);
-}
+function describe(error: unknown): string {}
 
 export class GraphRuntime {
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected 'Flush at tick 1 failed: undefined' to match /subscriber boom/

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:67:15
   /** Batch identity. Advanced once per executed flush, never by the clock. */
   #sequence = 0;
   #lastFlushError: Diagnostic | undefined;
-  #flushing = false;
+  #flushing = true;
   #disposed = false;
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:68:15
   #sequence = 0;
   #lastFlushError: Diagnostic | undefined;
   #flushing = false;
-  #disposed = false;
+  #disposed = true;
 
   constructor(
killedBy: Engine publishes a progress change through the existing graph runtime
statusReason: GraphRuntime is disposed.

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:75:5
     clock: Clock,
     compose: ComposeResolver,
     options: GraphRuntimeOptions = {},
-  ) {
-    this.#binding = new GraphBinding(project);
-    this.#registry = new PatchRegistry();
-    this.#publisher = new GraphPublisher(this.#registry);
-    this.#clock = clock;
-    this.#compose = compose;
-    this.#onFlushError = options.onFlushError;
-    this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
-  }
+  ) {}
 
   get binding(): GraphBinding {
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: Cannot read properties of undefined (reading 'graph')

[Killed] ArrowFunction
core/src/runtime/graph-runtime.ts:82:47
     this.#clock = clock;
     this.#compose = compose;
     this.#onFlushError = options.onFlushError;
-    this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
+    this.#unsubscribe = this.#clock.subscribe(() => undefined);
   }
 
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:85:31
     this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
 
-  get binding(): GraphBinding {
-    return this.#binding;
-  }
+  get binding(): GraphBinding {}
   get state() {
     return this.#binding.state;
killedBy: GraphRuntime I-13 owns one registry, one publisher, one state, and one clock subscription
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:88:15
   get binding(): GraphBinding {
     return this.#binding;
   }
-  get state() {
-    return this.#binding.state;
-  }
+  get state() {}
   get registry(): PatchRegistry {
     return this.#registry;
killedBy: GraphRuntime I-13 owns one registry, one publisher, one state, and one clock subscription
statusReason: expected undefined to be ObservationState{} // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:91:33
   get state() {
     return this.#binding.state;
   }
-  get registry(): PatchRegistry {
-    return this.#registry;
-  }
+  get registry(): PatchRegistry {}
   get publisher(): GraphPublisher {
     return this.#publisher;
killedBy: clock and batch identity are independent (P0-1) separates the clock's frame number from batch identity
statusReason: Cannot read properties of undefined (reading 'subscribeBatch')

[Survived] BlockStatement
core/src/runtime/graph-runtime.ts:94:35
   get registry(): PatchRegistry {
     return this.#registry;
   }
-  get publisher(): GraphPublisher {
-    return this.#publisher;
-  }
+  get publisher(): GraphPublisher {}
   /** The last frame number this runtime saw from its clock. */
   get tick(): number {

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:98:22
     return this.#publisher;
   }
   /** The last frame number this runtime saw from its clock. */
-  get tick(): number {
-    return this.#lastTick;
-  }
+  get tick(): number {}
   /** The identity of the last batch this runtime published. Independent of the clock. */
   get sequence(): number {
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:102:26
     return this.#lastTick;
   }
   /** The identity of the last batch this runtime published. Independent of the clock. */
-  get sequence(): number {
-    return this.#sequence;
-  }
+  get sequence(): number {}
   /** The last failure that escaped a flush, or undefined when none has. */
   get lastFlushError(): Diagnostic | undefined {
killedBy: clock and batch identity are independent (P0-1) separates the clock's frame number from batch identity
statusReason: expected undefined to be 3 // Object.is equality

[NoCoverage] BlockStatement
core/src/runtime/graph-runtime.ts:106:48
     return this.#sequence;
   }
   /** The last failure that escaped a flush, or undefined when none has. */
-  get lastFlushError(): Diagnostic | undefined {
-    return this.#lastFlushError;
-  }
+  get lastFlushError(): Diagnostic | undefined {}
   get memberCount(): number {
     return this.#members.size;

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:109:29
   get lastFlushError(): Diagnostic | undefined {
     return this.#lastFlushError;
   }
-  get memberCount(): number {
-    return this.#members.size;
-  }
+  get memberCount(): number {}
   /** Seeds deferred by reentrant flush requests, waiting for the next flush to drain them. */
   get pendingSeeds(): readonly string[] {
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:113:41
     return this.#members.size;
   }
   /** Seeds deferred by reentrant flush requests, waiting for the next flush to drain them. */
-  get pendingSeeds(): readonly string[] {
-    return [...this.#pendingSeeds];
-  }
+  get pendingSeeds(): readonly string[] {}
 
   attach(nodeId: string): void {
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:117:32
     return [...this.#pendingSeeds];
   }
 
-  attach(nodeId: string): void {
-    this.#assertLive();
-    if (!this.#binding.graph.nodeById[nodeId])
-      throw new TypeError(`Unknown graph node \"${nodeId}\".`);
-    this.#members.add(nodeId);
-  }
+  attach(nodeId: string): void {}
   detach(nodeId: string): void {
     this.#assertLive();
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:119:9
 
   attach(nodeId: string): void {
     this.#assertLive();
-    if (!this.#binding.graph.nodeById[nodeId])
+    if (this.#binding.graph.nodeById[nodeId])
       throw new TypeError(`Unknown graph node \"${nodeId}\".`);
     this.#members.add(nodeId);
killedBy: Engine publishes a progress change through the existing graph runtime
statusReason: Unknown graph node "hero/arm".

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:119:9
 
   attach(nodeId: string): void {
     this.#assertLive();
-    if (!this.#binding.graph.nodeById[nodeId])
+    if (true)
       throw new TypeError(`Unknown graph node \"${nodeId}\".`);
     this.#members.add(nodeId);
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: Unknown graph node "hero/arm".

[NoCoverage] StringLiteral
core/src/runtime/graph-runtime.ts:120:27
   attach(nodeId: string): void {
     this.#assertLive();
     if (!this.#binding.graph.nodeById[nodeId])
-      throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+      throw new TypeError(``);
     this.#members.add(nodeId);
   }

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:123:32
       throw new TypeError(`Unknown graph node \"${nodeId}\".`);
     this.#members.add(nodeId);
   }
-  detach(nodeId: string): void {
-    this.#assertLive();
-    this.#members.delete(nodeId);
-  }
+  detach(nodeId: string): void {}
 
   /**
killedBy: GraphRuntime publishes only attached seeds and stops after disposal
statusReason: expected [ [ 'hero/arm', '~/cursor' ], …(1) ] to deeply equal [ [ 'hero/arm', '~/cursor' ], …(1) ]

[Killed] ArrayDeclaration
core/src/runtime/graph-runtime.ts:133:36
    * the frame owner supplies one. A publication that does not belong to a frame, such as a
    * seek, advances batch identity alone and leaves the frame number for the clock to fill.
    */
-  flush(seeds: readonly string[] = [...this.#members], tick?: number): PatchBatch {
+  flush(seeds: readonly string[] = [], tick?: number): PatchBatch {
     this.#assertLive();
     // Reentrancy policy: one flush at a time, no recursion, no second clock. A flush asked
killedBy: GraphRuntime membership starts empty and publishes only attached nodes by default
statusReason: expected [] to deeply equal [ 'hero/arm' ]

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:139:9
     // for while this runtime is already flushing (in practice from a patch subscriber) is
     // never executed inline. Its seeds are coalesced into a single pending set that the next
     // flush drains exactly once, so the follow-up is neither recursive nor lost.
-    if (this.#flushing) {
+    if (false) {
       for (const seed of seeds) this.#pendingSeeds.add(seed);
       return deferredBatch(this.#sequence, seeds);
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:139:25
     // for while this runtime is already flushing (in practice from a patch subscriber) is
     // never executed inline. Its seeds are coalesced into a single pending set that the next
     // flush drains exactly once, so the follow-up is neither recursive nor lost.
-    if (this.#flushing) {
-      for (const seed of seeds) this.#pendingSeeds.add(seed);
-      return deferredBatch(this.#sequence, seeds);
-    }
+    if (this.#flushing) {}
     if (tick !== undefined) {
       if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:143:9
       for (const seed of seeds) this.#pendingSeeds.add(seed);
       return deferredBatch(this.#sequence, seeds);
     }
-    if (tick !== undefined) {
+    if (true) {
       if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
       if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
killedBy: Engine publishes a progress change through the existing graph runtime
statusReason: Runtime ticks must be finite.

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:143:29
       for (const seed of seeds) this.#pendingSeeds.add(seed);
       return deferredBatch(this.#sequence, seeds);
     }
-    if (tick !== undefined) {
-      if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
-      if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
-      this.#lastTick = tick;
-    }
+    if (tick !== undefined) {}
     const carried = [...this.#pendingSeeds];
     this.#pendingSeeds.clear();
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:144:11
       return deferredBatch(this.#sequence, seeds);
     }
     if (tick !== undefined) {
-      if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
+      if (true) throw new TypeError("Runtime ticks must be finite.");
       if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
       this.#lastTick = tick;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:144:11
       return deferredBatch(this.#sequence, seeds);
     }
     if (tick !== undefined) {
-      if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
+      if (Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
       if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
       this.#lastTick = tick;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] EqualityOperator
core/src/runtime/graph-runtime.ts:145:11
     }
     if (tick !== undefined) {
       if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
-      if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+      if (tick >= this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
       this.#lastTick = tick;
     }
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:145:11
     }
     if (tick !== undefined) {
       if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
-      if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+      if (true) throw new RangeError("Runtime ticks must be monotonic.");
       this.#lastTick = tick;
     }
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrayDeclaration
core/src/runtime/graph-runtime.ts:148:21
       if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
       this.#lastTick = tick;
     }
-    const carried = [...this.#pendingSeeds];
+    const carried = [];
     this.#pendingSeeds.clear();
     const effectiveSeeds = [...new Set([...seeds, ...carried])];
killedBy: subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
statusReason: expected undefined to deeply equal { node: 'caption/label' }

[Killed] ArrowFunction
core/src/runtime/graph-runtime.ts:151:49
     const carried = [...this.#pendingSeeds];
     this.#pendingSeeds.clear();
     const effectiveSeeds = [...new Set([...seeds, ...carried])];
-    const nodes = this.#binding.graph.nodes.map((node) =>
-      Object.freeze({ ...node, compose: this.#compose(node) }),
+    const nodes = this.#binding.graph.nodes.map(() => undefined,
     );
     this.#sequence += 1;
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
core/src/runtime/graph-runtime.ts:152:21
     this.#pendingSeeds.clear();
     const effectiveSeeds = [...new Set([...seeds, ...carried])];
     const nodes = this.#binding.graph.nodes.map((node) =>
-      Object.freeze({ ...node, compose: this.#compose(node) }),
+      Object.freeze({}),
     );
     this.#sequence += 1;
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: node.edges is not iterable

[Killed] AssignmentOperator
core/src/runtime/graph-runtime.ts:154:5
     const nodes = this.#binding.graph.nodes.map((node) =>
       Object.freeze({ ...node, compose: this.#compose(node) }),
     );
-    this.#sequence += 1;
+    this.#sequence -= 1;
     this.#flushing = true;
     try {
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [ -1 ] to deeply equal [ 1 ]

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:155:22
       Object.freeze({ ...node, compose: this.#compose(node) }),
     );
     this.#sequence += 1;
-    this.#flushing = true;
+    this.#flushing = false;
     try {
       return this.#publisher.flush(
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:156:9
     );
     this.#sequence += 1;
     this.#flushing = true;
-    try {
-      return this.#publisher.flush(
-        Object.freeze({ ...this.#binding.graph, nodes: Object.freeze(nodes) }),
-        effectiveSeeds,
-        this.#sequence,
-      );
-    } catch (error) {
+    try {} catch (error) {
       // A failed drain must not swallow the work it was carrying, including the seeds it was
       // asked to publish: the caller has no other record of them.
killedBy: clock and batch identity are independent (P0-1) separates the clock's frame number from batch identity
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Killed] ObjectLiteral
core/src/runtime/graph-runtime.ts:158:23
     this.#flushing = true;
     try {
       return this.#publisher.flush(
-        Object.freeze({ ...this.#binding.graph, nodes: Object.freeze(nodes) }),
+        Object.freeze({}),
         effectiveSeeds,
         this.#sequence,
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:162:21
         effectiveSeeds,
         this.#sequence,
       );
-    } catch (error) {
-      // A failed drain must not swallow the work it was carrying, including the seeds it was
-      // asked to publish: the caller has no other record of them.
-      for (const seed of effectiveSeeds) this.#pendingSeeds.add(seed);
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       this.#flushing = false;
     }
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected [] to deeply equal [ 'flush-failure' ]

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:167:15
       // asked to publish: the caller has no other record of them.
       for (const seed of effectiveSeeds) this.#pendingSeeds.add(seed);
       throw error;
-    } finally {
-      this.#flushing = false;
-    }
+    } finally {}
   }
 
killedBy: subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
statusReason: expected [ 1 ] to deeply equal [ 1, 2 ]

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:168:24
       for (const seed of effectiveSeeds) this.#pendingSeeds.add(seed);
       throw error;
     } finally {
-      this.#flushing = false;
+      this.#flushing = true;
     }
   }
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:173:52
   }
 
   /** Publish a change that did not come from a frame. Never consumes a clock frame number. */
-  invalidate(seeds: readonly string[]): PatchBatch {
-    this.#assertLive();
-    return this.flush(seeds);
-  }
+  invalidate(seeds: readonly string[]): PatchBatch {}
 
   dispose(): void {
killedBy: clock and batch identity are independent (P0-1) separates the clock's frame number from batch identity
statusReason: expected 2 to be 3 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:178:19
     return this.flush(seeds);
   }
 
-  dispose(): void {
-    if (this.#disposed) return;
-    this.#disposed = true;
-    this.#unsubscribe();
-    this.#members.clear();
-    this.#pendingSeeds.clear();
-  }
+  dispose(): void {}
   #onTick(event: ClockTick): void {
     if (this.#disposed) return;
killedBy: GraphRuntime publishes only attached seeds and stops after disposal
statusReason: expected [ [ 'hero/arm', '~/cursor' ], …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:179:9
   }
 
   dispose(): void {
-    if (this.#disposed) return;
+    if (true) return;
     this.#disposed = true;
     this.#unsubscribe();
killedBy: GraphRuntime publishes only attached seeds and stops after disposal
statusReason: expected [ [ 'hero/arm', '~/cursor' ], …(2) ] to have a length of 2 but got 3

[Survived] ConditionalExpression
core/src/runtime/graph-runtime.ts:179:9
   }
 
   dispose(): void {
-    if (this.#disposed) return;
+    if (false) return;
     this.#disposed = true;
     this.#unsubscribe();

[Survived] BooleanLiteral
core/src/runtime/graph-runtime.ts:180:22
 
   dispose(): void {
     if (this.#disposed) return;
-    this.#disposed = true;
+    this.#disposed = false;
     this.#unsubscribe();
     this.#members.clear();

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:185:35
     this.#members.clear();
     this.#pendingSeeds.clear();
   }
-  #onTick(event: ClockTick): void {
-    if (this.#disposed) return;
-    // Everything below is reported, never thrown. A clock dispatch is the one caller that
-    // cannot recover: both shipped clocks would abandon their remaining listeners, and the
-    // browser clock would never request another frame, so a single escaping error ends every
-    // animation in the project for the lifetime of the page.
-    if (event.tick <= this.#lastTick) {
-      this.#report(
-        CLOCK_REGRESSION_RULE,
-        `Clock tick ${event.tick} did not advance past ${this.#lastTick}.`,
-      );
-      return;
-    }
-    try {
-      this.flush([...this.#members], event.tick);
-    } catch (error) {
-      this.#report(FLUSH_FAILURE_RULE, `Flush at tick ${event.tick} failed: ${describe(error)}`);
-    }
-  }
+  #onTick(event: ClockTick): void {}
   #report(ruleId: string, message: string): void {
     const diagnostic: Diagnostic = Object.freeze({
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:186:9
     this.#pendingSeeds.clear();
   }
   #onTick(event: ClockTick): void {
-    if (this.#disposed) return;
+    if (true) return;
     // Everything below is reported, never thrown. A clock dispatch is the one caller that
     // cannot recover: both shipped clocks would abandon their remaining listeners, and the
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected +0 to be 3 // Object.is equality

[Survived] ConditionalExpression
core/src/runtime/graph-runtime.ts:186:9
     this.#pendingSeeds.clear();
   }
   #onTick(event: ClockTick): void {
-    if (this.#disposed) return;
+    if (false) return;
     // Everything below is reported, never thrown. A clock dispatch is the one caller that
     // cannot recover: both shipped clocks would abandon their remaining listeners, and the

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:191:9
     // cannot recover: both shipped clocks would abandon their remaining listeners, and the
     // browser clock would never request another frame, so a single escaping error ends every
     // animation in the project for the lifetime of the page.
-    if (event.tick <= this.#lastTick) {
+    if (true) {
       this.#report(
         CLOCK_REGRESSION_RULE,
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected +0 to be 3 // Object.is equality

[Killed] EqualityOperator
core/src/runtime/graph-runtime.ts:191:9
     // cannot recover: both shipped clocks would abandon their remaining listeners, and the
     // browser clock would never request another frame, so a single escaping error ends every
     // animation in the project for the lifetime of the page.
-    if (event.tick <= this.#lastTick) {
+    if (event.tick > this.#lastTick) {
       this.#report(
         CLOCK_REGRESSION_RULE,
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:198:9
       );
       return;
     }
-    try {
-      this.flush([...this.#members], event.tick);
-    } catch (error) {
+    try {} catch (error) {
       this.#report(FLUSH_FAILURE_RULE, `Flush at tick ${event.tick} failed: ${describe(error)}`);
     }
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:200:21
     }
     try {
       this.flush([...this.#members], event.tick);
-    } catch (error) {
-      this.#report(FLUSH_FAILURE_RULE, `Flush at tick ${event.tick} failed: ${describe(error)}`);
-    }
+    } catch (error) {}
   }
   #report(ruleId: string, message: string): void {
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected [] to deeply equal [ 'flush-failure' ]

[Killed] StringLiteral
core/src/runtime/graph-runtime.ts:201:40
     try {
       this.flush([...this.#members], event.tick);
     } catch (error) {
-      this.#report(FLUSH_FAILURE_RULE, `Flush at tick ${event.tick} failed: ${describe(error)}`);
+      this.#report(FLUSH_FAILURE_RULE, ``);
     }
   }
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected '' to match /subscriber boom/
