[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:204:50
       this.#report(FLUSH_FAILURE_RULE, `Flush at tick ${event.tick} failed: ${describe(error)}`);
     }
   }
-  #report(ruleId: string, message: string): void {
-    const diagnostic: Diagnostic = Object.freeze({
-      ruleId,
-      path: String(this.#lastTick),
-      message,
-      severity: "error",
-      ids: Object.freeze([...this.#members]),
-    });
-    this.#lastFlushError = diagnostic;
-    this.#onFlushError?.(diagnostic);
-  }
+  #report(ruleId: string, message: string): void {}
   #assertLive(): void {
     if (this.#disposed) throw new Error("GraphRuntime is disposed.");
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected [] to deeply equal [ 'flush-failure' ]

[Killed] StringLiteral
core/src/runtime/graph-runtime.ts:209:17
       ruleId,
       path: String(this.#lastTick),
       message,
-      severity: "error",
+      severity: "",
       ids: Object.freeze([...this.#members]),
     });
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected '' to be 'error' // Object.is equality

[Survived] OptionalChaining
core/src/runtime/graph-runtime.ts:213:5
       ids: Object.freeze([...this.#members]),
     });
     this.#lastFlushError = diagnostic;
-    this.#onFlushError?.(diagnostic);
+    this.#onFlushError(diagnostic);
   }
   #assertLive(): void {

[Survived] BlockStatement
core/src/runtime/graph-runtime.ts:215:23
     this.#lastFlushError = diagnostic;
     this.#onFlushError?.(diagnostic);
   }
-  #assertLive(): void {
-    if (this.#disposed) throw new Error("GraphRuntime is disposed.");
-  }
+  #assertLive(): void {}
 }
 

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:216:9
     this.#onFlushError?.(diagnostic);
   }
   #assertLive(): void {
-    if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+    if (true) throw new Error("GraphRuntime is disposed.");
   }
 }
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: GraphRuntime is disposed.

[Survived] ConditionalExpression
core/src/runtime/graph-runtime.ts:216:9
     this.#onFlushError?.(diagnostic);
   }
   #assertLive(): void {
-    if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+    if (false) throw new Error("GraphRuntime is disposed.");
   }
 }
