[Killed] BlockStatement
core/src/runtime/patch-registry.ts:38:67
   "Cannot open a patch batch while subscribers are being notified. " +
   "Queue one follow-up invalidation instead of recursing.";
 
-function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {
-  if (value === null || typeof value !== "object") return value;
-  if (seen.has(value)) return value;
-  seen.add(value);
-  for (const child of Object.values(value)) deepFreeze(child, seen);
-  return Object.freeze(value);
-}
+function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {}
 
 function sameRecord(
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:39:7
   "Queue one follow-up invalidation instead of recursing.";
 
 function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {
-  if (value === null || typeof value !== "object") return value;
+  if (value !== null || typeof value !== "object") return value;
   if (seen.has(value)) return value;
   seen.add(value);
killedBy: PatchRegistry I-7 deeply freezes published patches and batches
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:39:7
   "Queue one follow-up invalidation instead of recursing.";
 
 function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {
-  if (value === null || typeof value !== "object") return value;
+  if (false) return value;
   if (seen.has(value)) return value;
   seen.add(value);
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:40:7
 
 function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {
   if (value === null || typeof value !== "object") return value;
-  if (seen.has(value)) return value;
+  if (true) return value;
   seen.add(value);
   for (const child of Object.values(value)) deepFreeze(child, seen);
killedBy: PatchRegistry I-7 deeply freezes published patches and batches
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
core/src/runtime/patch-registry.ts:40:7
 
 function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {
   if (value === null || typeof value !== "object") return value;
-  if (seen.has(value)) return value;
+  if (false) return value;
   seen.add(value);
   for (const child of Object.values(value)) deepFreeze(child, seen);

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:49:12
 function sameRecord(
   a: Readonly<Record<string, unknown>>,
   b: Readonly<Record<string, unknown>>,
-): boolean {
-  const aKeys = Object.keys(a).sort();
-  const bKeys = Object.keys(b).sort();
-  if (aKeys.length !== bKeys.length) return false;
-  return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
-}
+): boolean {}
 
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Survived] MethodExpression
core/src/runtime/patch-registry.ts:50:17
   a: Readonly<Record<string, unknown>>,
   b: Readonly<Record<string, unknown>>,
 ): boolean {
-  const aKeys = Object.keys(a).sort();
+  const aKeys = Object.keys(a);
   const bKeys = Object.keys(b).sort();
   if (aKeys.length !== bKeys.length) return false;

[Survived] MethodExpression
core/src/runtime/patch-registry.ts:51:17
   b: Readonly<Record<string, unknown>>,
 ): boolean {
   const aKeys = Object.keys(a).sort();
-  const bKeys = Object.keys(b).sort();
+  const bKeys = Object.keys(b);
   if (aKeys.length !== bKeys.length) return false;
   return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:52:7
 ): boolean {
   const aKeys = Object.keys(a).sort();
   const bKeys = Object.keys(b).sort();
-  if (aKeys.length !== bKeys.length) return false;
+  if (true) return false;
   return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
 }
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:52:7
 ): boolean {
   const aKeys = Object.keys(a).sort();
   const bKeys = Object.keys(b).sort();
-  if (aKeys.length !== bKeys.length) return false;
+  if (aKeys.length === bKeys.length) return false;
   return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
 }
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] MethodExpression
core/src/runtime/patch-registry.ts:53:10
   const aKeys = Object.keys(a).sort();
   const bKeys = Object.keys(b).sort();
   if (aKeys.length !== bKeys.length) return false;
-  return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
+  return aKeys.some((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
 }
 
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: expected { nodeId: 'hero/arm', …(6) } to be { nodeId: 'hero/arm', …(6) } // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:53:38
   const aKeys = Object.keys(a).sort();
   const bKeys = Object.keys(b).sort();
   if (aKeys.length !== bKeys.length) return false;
-  return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
+  return aKeys.every((key, index) => false);
 }
 
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: expected { nodeId: 'hero/arm', …(6) } to be { nodeId: 'hero/arm', …(6) } // Object.is equality

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:56:87
   return aKeys.every((key, index) => key === bKeys[index] && Object.is(a[key], b[key]));
 }
 
-function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
-  return JSON.stringify(a) === JSON.stringify(b);
-}
+function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {}
 
 function samePatch(a: Patch | undefined, b: Patch): boolean {
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:57:10
 }
 
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
-  return JSON.stringify(a) === JSON.stringify(b);
+  return false;
 }
 
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: expected { nodeId: 'hero/arm', …(6) } to be { nodeId: 'hero/arm', …(6) } // Object.is equality

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:57:10
 }
 
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
-  return JSON.stringify(a) === JSON.stringify(b);
+  return JSON.stringify(a) !== JSON.stringify(b);
 }
 
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: expected { nodeId: 'hero/arm', …(6) } to be { nodeId: 'hero/arm', …(6) } // Object.is equality

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:60:61
   return JSON.stringify(a) === JSON.stringify(b);
 }
 
-function samePatch(a: Patch | undefined, b: Patch): boolean {
-  return (
-    a !== undefined &&
-    sameRecord(a.values, b.values) &&
-    Object.is(a.sourceProgress, b.sourceProgress) &&
-    sameRecord(a.sourceRevisions, b.sourceRevisions) &&
-    a.status === b.status &&
-    sameDiagnostics(a.diagnostics, b.diagnostics)
-  );
-}
+function samePatch(a: Patch | undefined, b: Patch): boolean {}
 
 export class PatchRegistry {
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: expected { nodeId: 'hero/arm', …(6) } to be { nodeId: 'hero/arm', …(6) } // Object.is equality

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:62:5
 
 function samePatch(a: Patch | undefined, b: Patch): boolean {
   return (
-    a !== undefined &&
+    a === undefined &&
     sameRecord(a.values, b.values) &&
     Object.is(a.sourceProgress, b.sourceProgress) &&
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: Cannot read properties of undefined (reading 'values')

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:62:5
 
 function samePatch(a: Patch | undefined, b: Patch): boolean {
   return (
-    a !== undefined &&
-    sameRecord(a.values, b.values) &&
+    a !== undefined || sameRecord(a.values, b.values) &&
     Object.is(a.sourceProgress, b.sourceProgress) &&
     sameRecord(a.sourceRevisions, b.sourceRevisions) &&
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: Cannot read properties of undefined (reading 'values')

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:66:5
     sameRecord(a.values, b.values) &&
     Object.is(a.sourceProgress, b.sourceProgress) &&
     sameRecord(a.sourceRevisions, b.sourceRevisions) &&
-    a.status === b.status &&
+    a.status !== b.status &&
     sameDiagnostics(a.diagnostics, b.diagnostics)
   );
killedBy: React patch consumer boundary keeps one frozen snapshot per revision and unsubscribes cleanly
statusReason: expected { nodeId: 'hero/arm', …(6) } to be { nodeId: 'hero/arm', …(6) } // Object.is equality

[Survived] ConditionalExpression
core/src/runtime/patch-registry.ts:66:5
     sameRecord(a.values, b.values) &&
     Object.is(a.sourceProgress, b.sourceProgress) &&
     sameRecord(a.sourceRevisions, b.sourceRevisions) &&
-    a.status === b.status &&
+    true &&
     sameDiagnostics(a.diagnostics, b.diagnostics)
   );

[Survived] ArrayDeclaration
core/src/runtime/patch-registry.ts:76:37
   readonly #nodeListeners = new Map<string, Set<PatchListener>>();
   readonly #batchListeners = new Set<BatchListener>();
   #batch: Patch[] = [];
-  #batchDiagnostics: Diagnostic[] = [];
+  #batchDiagnostics: Diagnostic[] = ["Stryker was here"];
   #batchTick = 0;
   #batchSeeds: string[] = [];

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:79:16
   #batchDiagnostics: Diagnostic[] = [];
   #batchTick = 0;
   #batchSeeds: string[] = [];
-  #batchOpen = false;
+  #batchOpen = true;
   #notifying = false;
 
killedBy: PatchRegistry: subscriber error handling (recovery A2) a throwing node subscriber does not prevent other subscribers from being notified
statusReason: A patch batch is already open.

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:80:16
   #batchTick = 0;
   #batchSeeds: string[] = [];
   #batchOpen = false;
-  #notifying = false;
+  #notifying = true;
 
   get(nodeId: string): Patch | undefined {
killedBy: PatchRegistry: subscriber error handling (recovery A2) a throwing node subscriber does not prevent other subscribers from being notified
statusReason: Cannot open a patch batch while subscribers are being notified. Queue one follow-up invalidation instead of recursing.

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:82:42
   #batchOpen = false;
   #notifying = false;
 
-  get(nodeId: string): Patch | undefined {
-    return this.#patches.get(nodeId);
-  }
+  get(nodeId: string): Patch | undefined {}
 
   /**
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be defined

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:90:28
    * True only while closeBatch() is delivering a settled batch to its listeners. Callers that
    * own scheduling (the runtime) read this to queue a follow-up instead of recursing.
    */
-  get notifying(): boolean {
-    return this.#notifying;
-  }
+  get notifying(): boolean {}
 
   beginBatch(tick: number, seeds: readonly string[]): void {
killedBy: subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:94:60
     return this.#notifying;
   }
 
-  beginBatch(tick: number, seeds: readonly string[]): void {
-    // A subscriber running inside closeBatch() must never be able to start a nested batch:
-    // the outer batch is already settled and its remaining listeners have not run yet, so a
-    // nested publication would be delivered out of order.
-    if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
-    if (this.#batchOpen) throw new Error("A patch batch is already open.");
-    this.#batchOpen = true;
-    this.#batchTick = tick;
-    this.#batchSeeds = [...seeds];
-    this.#batch = [];
-    this.#batchDiagnostics = [];
-  }
+  beginBatch(tick: number, seeds: readonly string[]): void {}
 
   publish(input: PublishInput): Patch | undefined {
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:98:9
     // A subscriber running inside closeBatch() must never be able to start a nested batch:
     // the outer batch is already settled and its remaining listeners have not run yet, so a
     // nested publication would be delivered out of order.
-    if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (true) throw new Error(REENTRANT_BATCH_MESSAGE);
     if (this.#batchOpen) throw new Error("A patch batch is already open.");
     this.#batchOpen = true;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:98:9
     // A subscriber running inside closeBatch() must never be able to start a nested batch:
     // the outer batch is already settled and its remaining listeners have not run yet, so a
     // nested publication would be delivered out of order.
-    if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (false) throw new Error(REENTRANT_BATCH_MESSAGE);
     if (this.#batchOpen) throw new Error("A patch batch is already open.");
     this.#batchOpen = true;
killedBy: subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:99:9
     // the outer batch is already settled and its remaining listeners have not run yet, so a
     // nested publication would be delivered out of order.
     if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
-    if (this.#batchOpen) throw new Error("A patch batch is already open.");
+    if (true) throw new Error("A patch batch is already open.");
     this.#batchOpen = true;
     this.#batchTick = tick;
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: A patch batch is already open.

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:99:9
     // the outer batch is already settled and its remaining listeners have not run yet, so a
     // nested publication would be delivered out of order.
     if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
-    if (this.#batchOpen) throw new Error("A patch batch is already open.");
+    if (false) throw new Error("A patch batch is already open.");
     this.#batchOpen = true;
     this.#batchTick = tick;
killedBy: PatchRegistry rejects opening a second empty batch and closing without an open batch
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:100:23
     // nested publication would be delivered out of order.
     if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
     if (this.#batchOpen) throw new Error("A patch batch is already open.");
-    this.#batchOpen = true;
+    this.#batchOpen = false;
     this.#batchTick = tick;
     this.#batchSeeds = [...seeds];
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: No patch batch is open.

[Survived] ArrayDeclaration
core/src/runtime/patch-registry.ts:104:30
     this.#batchTick = tick;
     this.#batchSeeds = [...seeds];
     this.#batch = [];
-    this.#batchDiagnostics = [];
+    this.#batchDiagnostics = ["Stryker was here"];
   }
 

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:107:51
     this.#batchDiagnostics = [];
   }
 
-  publish(input: PublishInput): Patch | undefined {
-    const previous = this.#patches.get(input.nodeId);
-    const candidate = {
-      nodeId: input.nodeId,
-      revision: (previous?.revision ?? 0) + 1,
-      values: input.values ?? {},
-      sourceProgress: input.sourceProgress,
-      sourceRevisions: input.sourceRevisions ?? {},
-      status: input.status,
-      diagnostics: input.diagnostics ?? [],
-    } satisfies Patch;
-    if (samePatch(previous, candidate)) return undefined;
-    const patch = deepFreeze(candidate);
-    this.#patches.set(input.nodeId, patch);
-    this.#batch.push(patch);
-    this.#batchDiagnostics.push(...patch.diagnostics);
-    return patch;
-  }
+  publish(input: PublishInput): Patch | undefined {}
 
   subscribeNode(nodeId: string, listener: PatchListener): () => void {
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: expected [ undefined ] to deeply equal [ undefined, 1 ]

[Killed] ObjectLiteral
core/src/runtime/patch-registry.ts:109:23
 
   publish(input: PublishInput): Patch | undefined {
     const previous = this.#patches.get(input.nodeId);
-    const candidate = {
-      nodeId: input.nodeId,
-      revision: (previous?.revision ?? 0) + 1,
-      values: input.values ?? {},
-      sourceProgress: input.sourceProgress,
-      sourceRevisions: input.sourceRevisions ?? {},
-      status: input.status,
-      diagnostics: input.diagnostics ?? [],
-    } satisfies Patch;
+    const candidate = {} satisfies Patch;
     if (samePatch(previous, candidate)) return undefined;
     const patch = deepFreeze(candidate);
killedBy: GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:111:18
     const previous = this.#patches.get(input.nodeId);
     const candidate = {
       nodeId: input.nodeId,
-      revision: (previous?.revision ?? 0) + 1,
+      revision: (previous?.revision && 0) + 1,
       values: input.values ?? {},
       sourceProgress: input.sourceProgress,
killedBy: subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
statusReason: expected NaN to be 1 // Object.is equality

[Killed] ArithmeticOperator
core/src/runtime/patch-registry.ts:111:17
     const previous = this.#patches.get(input.nodeId);
     const candidate = {
       nodeId: input.nodeId,
-      revision: (previous?.revision ?? 0) + 1,
+      revision: (previous?.revision ?? 0) - 1,
       values: input.values ?? {},
       sourceProgress: input.sourceProgress,
killedBy: subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
statusReason: expected -1 to be 1 // Object.is equality

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:112:15
     const candidate = {
       nodeId: input.nodeId,
       revision: (previous?.revision ?? 0) + 1,
-      values: input.values ?? {},
+      values: input.values && {},
       sourceProgress: input.sourceProgress,
       sourceRevisions: input.sourceRevisions ?? {},
killedBy: subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
statusReason: expected {} to deeply equal { node: 'caption/label' }

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:114:24
       revision: (previous?.revision ?? 0) + 1,
       values: input.values ?? {},
       sourceProgress: input.sourceProgress,
-      sourceRevisions: input.sourceRevisions ?? {},
+      sourceRevisions: input.sourceRevisions && {},
       status: input.status,
       diagnostics: input.diagnostics ?? [],
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:116:20
       sourceProgress: input.sourceProgress,
       sourceRevisions: input.sourceRevisions ?? {},
       status: input.status,
-      diagnostics: input.diagnostics ?? [],
+      diagnostics: input.diagnostics && [],
     } satisfies Patch;
     if (samePatch(previous, candidate)) return undefined;
killedBy: subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
statusReason: patch.diagnostics is not iterable (cannot read property undefined)

[Survived] ArrayDeclaration
core/src/runtime/patch-registry.ts:116:41
       sourceProgress: input.sourceProgress,
       sourceRevisions: input.sourceRevisions ?? {},
       status: input.status,
-      diagnostics: input.diagnostics ?? [],
+      diagnostics: input.diagnostics ?? ["Stryker was here"],
     } satisfies Patch;
     if (samePatch(previous, candidate)) return undefined;

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:118:9
       status: input.status,
       diagnostics: input.diagnostics ?? [],
     } satisfies Patch;
-    if (samePatch(previous, candidate)) return undefined;
+    if (false) return undefined;
     const patch = deepFreeze(candidate);
     this.#patches.set(input.nodeId, patch);
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:118:9
       status: input.status,
       diagnostics: input.diagnostics ?? [],
     } satisfies Patch;
-    if (samePatch(previous, candidate)) return undefined;
+    if (true) return undefined;
     const patch = deepFreeze(candidate);
     this.#patches.set(input.nodeId, patch);
killedBy: PatchRegistry I-7 deeply freezes published patches and batches
statusReason: expected undefined to be defined

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:126:70
     return patch;
   }
 
-  subscribeNode(nodeId: string, listener: PatchListener): () => void {
-    const listeners = this.#nodeListeners.get(nodeId) ?? new Set<PatchListener>();
-    listeners.add(listener);
-    this.#nodeListeners.set(nodeId, listeners);
-    return () => listeners.delete(listener);
-  }
+  subscribeNode(nodeId: string, listener: PatchListener): () => void {}
 
   subscribeBatch(listener: BatchListener): () => void {
killedBy: PatchRegistry I-6 notifies node subscribers before batch subscribers and safely snapshots listeners
statusReason: expected [ 'batch' ] to deeply equal [ 'node', 'batch' ]

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:127:23
   }
 
   subscribeNode(nodeId: string, listener: PatchListener): () => void {
-    const listeners = this.#nodeListeners.get(nodeId) ?? new Set<PatchListener>();
+    const listeners = this.#nodeListeners.get(nodeId) && new Set<PatchListener>();
     listeners.add(listener);
     this.#nodeListeners.set(nodeId, listeners);
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] ArrowFunction
core/src/runtime/patch-registry.ts:130:12
     const listeners = this.#nodeListeners.get(nodeId) ?? new Set<PatchListener>();
     listeners.add(listener);
     this.#nodeListeners.set(nodeId, listeners);
-    return () => listeners.delete(listener);
+    return () => undefined;
   }
 
killedBy: React patch store lifecycle (C1) receives patches again after the last listener leaves and a new one arrives
statusReason: expected [ 3, 3 ] to deeply equal [ 3 ]

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:133:55
     return () => listeners.delete(listener);
   }
 
-  subscribeBatch(listener: BatchListener): () => void {
-    this.#batchListeners.add(listener);
-    return () => this.#batchListeners.delete(listener);
-  }
+  subscribeBatch(listener: BatchListener): () => void {}
 
   closeBatch(): PatchBatch {
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Survived] ArrowFunction
core/src/runtime/patch-registry.ts:135:12
 
   subscribeBatch(listener: BatchListener): () => void {
     this.#batchListeners.add(listener);
-    return () => this.#batchListeners.delete(listener);
+    return () => undefined;
   }
 

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:139:9
   }
 
   closeBatch(): PatchBatch {
-    if (!this.#batchOpen) throw new Error("No patch batch is open.");
+    if (true) throw new Error("No patch batch is open.");
     const batch = deepFreeze({
       tick: this.#batchTick,
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: No patch batch is open.

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:139:9
   }
 
   closeBatch(): PatchBatch {
-    if (!this.#batchOpen) throw new Error("No patch batch is open.");
+    if (this.#batchOpen) throw new Error("No patch batch is open.");
     const batch = deepFreeze({
       tick: this.#batchTick,
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: No patch batch is open.

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:148:23
     }) as PatchBatch;
     const nodeListeners = new Map(this.#nodeListeners);
     const batchListeners = new Set(this.#batchListeners);
-    this.#batchOpen = false;
+    this.#batchOpen = true;
     this.#batch = [];
     this.#batchDiagnostics = [];
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: A patch batch is already open.

[Survived] ArrayDeclaration
core/src/runtime/patch-registry.ts:149:19
     const nodeListeners = new Map(this.#nodeListeners);
     const batchListeners = new Set(this.#batchListeners);
     this.#batchOpen = false;
-    this.#batch = [];
+    this.#batch = ["Stryker was here"];
     this.#batchDiagnostics = [];
     this.#batchSeeds = [];

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:158:23
     // every listener has had its turn, once state is already fully settled.
     let firstError: unknown;
     let hasError = false;
-    this.#notifying = true;
+    this.#notifying = false;
     try {
       for (const patch of batch.patches) {
killedBy: subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:159:9
     let firstError: unknown;
     let hasError = false;
     this.#notifying = true;
-    try {
-      for (const patch of batch.patches) {
-        for (const listener of nodeListeners.get(patch.nodeId) ?? []) {
-          try {
-            listener(patch);
-          } catch (error) {
-            if (!hasError) {
-              hasError = true;
-              firstError = error;
-            }
-          }
-        }
-      }
-      for (const listener of batchListeners) {
-        try {
-          listener(batch);
-        } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
-        }
-      }
-    } finally {
+    try {} finally {
       // The notification window closes before any error leaves this method, so a caller that
       // recovers from a listener failure can immediately open the next batch.
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: expected [ undefined ] to deeply equal [ undefined, 1 ]

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:160:42
     let hasError = false;
     this.#notifying = true;
     try {
-      for (const patch of batch.patches) {
-        for (const listener of nodeListeners.get(patch.nodeId) ?? []) {
-          try {
-            listener(patch);
-          } catch (error) {
-            if (!hasError) {
-              hasError = true;
-              firstError = error;
-            }
-          }
-        }
-      }
+      for (const patch of batch.patches) {}
       for (const listener of batchListeners) {
         try {
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: expected [ undefined ] to deeply equal [ undefined, 1 ]
