[Killed] BlockStatement
core/src/runtime/patch-registry.ts:161:71
     this.#notifying = true;
     try {
       for (const patch of batch.patches) {
-        for (const listener of nodeListeners.get(patch.nodeId) ?? []) {
-          try {
-            listener(patch);
-          } catch (error) {
-            if (!hasError) {
-              hasError = true;
-              firstError = error;
-            }
-          }
-        }
+        for (const listener of nodeListeners.get(patch.nodeId) ?? []) {}
       }
       for (const listener of batchListeners) {
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: expected [ undefined ] to deeply equal [ undefined, 1 ]

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:161:32
     this.#notifying = true;
     try {
       for (const patch of batch.patches) {
-        for (const listener of nodeListeners.get(patch.nodeId) ?? []) {
+        for (const listener of nodeListeners.get(patch.nodeId) && []) {
           try {
             listener(patch);
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: expected [ undefined ] to deeply equal [ undefined, 1 ]

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:162:15
     try {
       for (const patch of batch.patches) {
         for (const listener of nodeListeners.get(patch.nodeId) ?? []) {
-          try {
-            listener(patch);
-          } catch (error) {
+          try {} catch (error) {
             if (!hasError) {
               hasError = true;
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: expected [ undefined ] to deeply equal [ undefined, 1 ]

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:164:27
         for (const listener of nodeListeners.get(patch.nodeId) ?? []) {
           try {
             listener(patch);
-          } catch (error) {
-            if (!hasError) {
-              hasError = true;
-              firstError = error;
-            }
-          }
+          } catch (error) {}
         }
       }
killedBy: subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:165:17
           try {
             listener(patch);
           } catch (error) {
-            if (!hasError) {
+            if (hasError) {
               hasError = true;
               firstError = error;
killedBy: subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:172:46
           }
         }
       }
-      for (const listener of batchListeners) {
-        try {
-          listener(batch);
-        } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
-        }
-      }
+      for (const listener of batchListeners) {}
     } finally {
       // The notification window closes before any error leaves this method, so a caller that
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:173:13
         }
       }
       for (const listener of batchListeners) {
-        try {
-          listener(batch);
-        } catch (error) {
+        try {} catch (error) {
           if (!hasError) {
             hasError = true;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[NoCoverage] BlockStatement
core/src/runtime/patch-registry.ts:175:25
       for (const listener of batchListeners) {
         try {
           listener(batch);
-        } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
-        }
+        } catch (error) {}
       }
     } finally {

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:182:15
           }
         }
       }
-    } finally {
-      // The notification window closes before any error leaves this method, so a caller that
-      // recovers from a listener failure can immediately open the next batch.
-      this.#notifying = false;
-    }
+    } finally {}
     if (hasError) throw firstError;
     return batch;
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: Cannot open a patch batch while subscribers are being notified. Queue one follow-up invalidation instead of recursing.

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:185:25
     } finally {
       // The notification window closes before any error leaves this method, so a caller that
       // recovers from a listener failure can immediately open the next batch.
-      this.#notifying = false;
+      this.#notifying = true;
     }
     if (hasError) throw firstError;
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: Cannot open a patch batch while subscribers are being notified. Queue one follow-up invalidation instead of recursing.
