[Killed] BooleanLiteral
core/src/runtime/project-runtime.ts:18:15
   readonly #instances = new Map<string, object>();
   readonly #setProgress: (nodeId: string, progress: number) => void;
   readonly #disposeComposition: () => void;
-  #disposed = false;
+  #disposed = true;
 
   constructor(project: ProjectDefinition, options: ProjectRuntimeOptions) {
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: ProjectRuntime is disposed.

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:20:75
   readonly #disposeComposition: () => void;
   #disposed = false;
 
-  constructor(project: ProjectDefinition, options: ProjectRuntimeOptions) {
-    this.#project = project;
-    this.#setProgress = options.setProgress ?? (() => undefined);
-    this.#disposeComposition = options.disposeComposition ?? (() => undefined);
-    try {
-      this.#graph = new GraphRuntime(project, options.clock, options.compose);
-    } catch (error) {
-      this.#disposeComposition();
-      throw error;
-    }
-  }
+  constructor(project: ProjectDefinition, options: ProjectRuntimeOptions) {}
   get project(): ProjectDefinition {
     return this.#project;
killedBy: Engine publishes a progress change through the existing graph runtime
statusReason: Cannot read properties of undefined (reading 'attach')

[Killed] LogicalOperator
core/src/runtime/project-runtime.ts:22:25
 
   constructor(project: ProjectDefinition, options: ProjectRuntimeOptions) {
     this.#project = project;
-    this.#setProgress = options.setProgress ?? (() => undefined);
+    this.#setProgress = options.setProgress && (() => undefined);
     this.#disposeComposition = options.disposeComposition ?? (() => undefined);
     try {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] LogicalOperator
core/src/runtime/project-runtime.ts:23:32
   constructor(project: ProjectDefinition, options: ProjectRuntimeOptions) {
     this.#project = project;
     this.#setProgress = options.setProgress ?? (() => undefined);
-    this.#disposeComposition = options.disposeComposition ?? (() => undefined);
+    this.#disposeComposition = options.disposeComposition && (() => undefined);
     try {
       this.#graph = new GraphRuntime(project, options.clock, options.compose);
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: this[#disposeComposition] is not a function

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:24:9
     this.#project = project;
     this.#setProgress = options.setProgress ?? (() => undefined);
     this.#disposeComposition = options.disposeComposition ?? (() => undefined);
-    try {
-      this.#graph = new GraphRuntime(project, options.clock, options.compose);
-    } catch (error) {
+    try {} catch (error) {
       this.#disposeComposition();
       throw error;
killedBy: Engine publishes a progress change through the existing graph runtime
statusReason: Cannot read properties of undefined (reading 'attach')

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:26:21
     this.#disposeComposition = options.disposeComposition ?? (() => undefined);
     try {
       this.#graph = new GraphRuntime(project, options.clock, options.compose);
-    } catch (error) {
-      this.#disposeComposition();
-      throw error;
-    }
+    } catch (error) {}
   }
   get project(): ProjectDefinition {
killedBy: ProjectRuntime rejects invalid candidates before constructing a replacement runtime
statusReason: expected function to throw an error, but it didn't

[NoCoverage] BlockStatement
core/src/runtime/project-runtime.ts:31:36
       throw error;
     }
   }
-  get project(): ProjectDefinition {
-    return this.#project;
-  }
+  get project(): ProjectDefinition {}
   get graph(): GraphRuntime {
     return this.#graph;

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:34:29
   get project(): ProjectDefinition {
     return this.#project;
   }
-  get graph(): GraphRuntime {
-    return this.#graph;
-  }
+  get graph(): GraphRuntime {}
   get instanceCount(): number {
     return this.#instances.size;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Cannot read properties of undefined (reading 'flush')

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:37:31
   get graph(): GraphRuntime {
     return this.#graph;
   }
-  get instanceCount(): number {
-    return this.#instances.size;
-  }
+  get instanceCount(): number {}
   mount(nodeId: string, instance: object = {}): object {
     this.#assertLive();
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:40:56
   get instanceCount(): number {
     return this.#instances.size;
   }
-  mount(nodeId: string, instance: object = {}): object {
-    this.#assertLive();
-    if (this.#instances.has(nodeId)) throw new TypeError(`Node "${nodeId}" is already mounted.`);
-    this.#graph.attach(nodeId);
-    this.#instances.set(nodeId, instance);
-    return instance;
-  }
+  mount(nodeId: string, instance: object = {}): object {}
   unmount(nodeId: string): void {
     this.#assertLive();
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/project-runtime.ts:42:9
   }
   mount(nodeId: string, instance: object = {}): object {
     this.#assertLive();
-    if (this.#instances.has(nodeId)) throw new TypeError(`Node "${nodeId}" is already mounted.`);
+    if (true) throw new TypeError(`Node "${nodeId}" is already mounted.`);
     this.#graph.attach(nodeId);
     this.#instances.set(nodeId, instance);
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: Node "hero/arm" is already mounted.

[Killed] ConditionalExpression
core/src/runtime/project-runtime.ts:42:9
   }
   mount(nodeId: string, instance: object = {}): object {
     this.#assertLive();
-    if (this.#instances.has(nodeId)) throw new TypeError(`Node "${nodeId}" is already mounted.`);
+    if (false) throw new TypeError(`Node "${nodeId}" is already mounted.`);
     this.#graph.attach(nodeId);
     this.#instances.set(nodeId, instance);
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:47:33
     this.#instances.set(nodeId, instance);
     return instance;
   }
-  unmount(nodeId: string): void {
-    this.#assertLive();
-    const instance = this.#instances.get(nodeId);
-    if (instance === undefined) return;
-    this.#instances.delete(nodeId);
-    this.#graph.detach(nodeId);
-  }
+  unmount(nodeId: string): void {}
   seek(nodeId: string, progress: number) {
     this.#assertLive();
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/project-runtime.ts:50:9
   unmount(nodeId: string): void {
     this.#assertLive();
     const instance = this.#instances.get(nodeId);
-    if (instance === undefined) return;
+    if (true) return;
     this.#instances.delete(nodeId);
     this.#graph.detach(nodeId);
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
core/src/runtime/project-runtime.ts:50:9
   unmount(nodeId: string): void {
     this.#assertLive();
     const instance = this.#instances.get(nodeId);
-    if (instance === undefined) return;
+    if (instance !== undefined) return;
     this.#instances.delete(nodeId);
     this.#graph.detach(nodeId);
killedBy: ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:54:42
     this.#instances.delete(nodeId);
     this.#graph.detach(nodeId);
   }
-  seek(nodeId: string, progress: number) {
-    this.#assertLive();
-    this.#setProgress(nodeId, progress);
-    return this.#graph.invalidate([nodeId]);
-  }
+  seek(nodeId: string, progress: number) {}
   dispose(): void {
     if (this.#disposed) return;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:59:19
     this.#setProgress(nodeId, progress);
     return this.#graph.invalidate([nodeId]);
   }
-  dispose(): void {
-    if (this.#disposed) return;
-    this.#disposed = true;
-    for (const nodeId of [...this.#instances.keys()]) this.#graph.detach(nodeId);
-    this.#instances.clear();
-    this.#graph.dispose();
-    this.#disposeComposition();
-  }
+  dispose(): void {}
   #assertLive(): void {
     if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
killedBy: ProjectRuntime releases every mounted instance and clock subscription on repeated dispose
statusReason: expected 1 to be +0 // Object.is equality

[Survived] BlockStatement
core/src/runtime/project-runtime.ts:67:23
     this.#graph.dispose();
     this.#disposeComposition();
   }
-  #assertLive(): void {
-    if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
-  }
+  #assertLive(): void {}
 }
 

[Killed] ConditionalExpression
core/src/runtime/project-runtime.ts:68:9
     this.#disposeComposition();
   }
   #assertLive(): void {
-    if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
+    if (true) throw new Error("ProjectRuntime is disposed.");
   }
 }
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: ProjectRuntime is disposed.

[Survived] ConditionalExpression
core/src/runtime/project-runtime.ts:68:9
     this.#disposeComposition();
   }
   #assertLive(): void {
-    if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
+    if (false) throw new Error("ProjectRuntime is disposed.");
   }
 }
