[NoCoverage] BlockStatement
packages/core/src/adapters/interpolator/gsap.ts:34:74
-   function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
-     return diagnostics
-       .map(({ ruleId, path, message }) => `${ruleId} at ${path}: ${message}`)
-       .join(" ");
-   }
+   function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {}

[NoCoverage] ArrowFunction
packages/core/src/adapters/interpolator/gsap.ts:36:10
-       .map(({ ruleId, path, message }) => `${ruleId} at ${path}: ${message}`)
+       .map(() => undefined)

[NoCoverage] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:36:41
-       .map(({ ruleId, path, message }) => `${ruleId} at ${path}: ${message}`)
+       .map(({ ruleId, path, message }) => ``)

[NoCoverage] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:37:11
-       .join(" ");
+       .join("");

[NoCoverage] BlockStatement
packages/core/src/adapters/interpolator/gsap.ts:41:51
-     constructor(diagnostics: readonly Diagnostic[]) {
-       super(describeDiagnostics(diagnostics));
-       this.name = "keyframe-compilation";
-       this.diagnostics = diagnostics;
-     }
+     constructor(diagnostics: readonly Diagnostic[]) {}

[NoCoverage] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:43:17
-       this.name = "keyframe-compilation";
+       this.name = "";

[NoCoverage] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:52:55
-         if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+         if (compiled.diagnostics.some(({ severity }) => true))

[NoCoverage] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:52:55
-         if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+         if (compiled.diagnostics.some(({ severity }) => false))

[NoCoverage] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:52:55
-         if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+         if (compiled.diagnostics.some(({ severity }) => severity !== "error"))

[NoCoverage] StringLiteral
packages/core/src/adapters/interpolator/gsap.ts:52:68
-         if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+         if (compiled.diagnostics.some(({ severity }) => severity === ""))

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:21:10
-     return value !== null && typeof value === "object" && !Array.isArray(value);
+     return true && typeof value === "object" && !Array.isArray(value);
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:24:7
-     if (!isRecord(config)) return 1;
+     if (false) return 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:26:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) || duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:26:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:26:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" || Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:26:10
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return true && Number.isFinite(duration) && duration >= 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:26:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && true ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 10 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:26:71
-     return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+     return typeof duration === "number" && Number.isFinite(duration) && duration > 0 ? duration : 1;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:29:10
-     return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
+     return true ? config.keyframes : {};
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:29:10
-     return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
+     return isRecord(config) || isRecord(config.keyframes) ? config.keyframes : {};
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:52:11
-         if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+         if (false)
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] ArrowFunction
packages/core/src/adapters/interpolator/gsap.ts:52:37
-         if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+         if (compiled.diagnostics.some(() => undefined))
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:61:29
-           for (let index = 1; index < stops.length; index += 1) {
+           for (let index = 1; index <= stops.length; index += 1) {
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 8 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:64:15
-             if (!previous || !next) continue;
+             if (false) continue;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 8 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/interpolator/gsap.ts:64:15
-             if (!previous || !next) continue;
+             if (!previous && !next) continue;
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 8 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/interpolator/gsap.ts:75:11
-         if (duration > 0) timeline.to(proxy, { duration: 0 }, duration);
+         if (true) timeline.to(proxy, { duration: 0 }, duration);
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[Survived] ArithmeticOperator
packages/core/src/adapters/interpolator/gsap.ts:72:36
-             timeline.to(proxy, vars, previous.p * duration);
+             timeline.to(proxy, vars, previous.p / duration);
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 8 more tests!

[Survived] EqualityOperator
packages/core/src/adapters/interpolator/gsap.ts:75:11
-         if (duration > 0) timeline.to(proxy, { duration: 0 }, duration);
+         if (duration >= 0) timeline.to(proxy, { duration: 0 }, duration);
Tests ran:
    GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
    GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
    GSAP authored-duration pinning (P0-3b) holds every property independently when grids end at different positions
  and 11 more tests!

[NoCoverage] ConditionalExpression
packages/core/src/adapters/dom.ts:24:7
-     if (key === "rotationX") return `rotateX(${String(value)}deg)`;
+     if (true) return `rotateX(${String(value)}deg)`;

[NoCoverage] ConditionalExpression
packages/core/src/adapters/dom.ts:24:7
-     if (key === "rotationX") return `rotateX(${String(value)}deg)`;
+     if (false) return `rotateX(${String(value)}deg)`;

[NoCoverage] EqualityOperator
packages/core/src/adapters/dom.ts:24:7
-     if (key === "rotationX") return `rotateX(${String(value)}deg)`;
+     if (key !== "rotationX") return `rotateX(${String(value)}deg)`;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:24:15
-     if (key === "rotationX") return `rotateX(${String(value)}deg)`;
+     if (key === "") return `rotateX(${String(value)}deg)`;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:24:35
-     if (key === "rotationX") return `rotateX(${String(value)}deg)`;
+     if (key === "rotationX") return ``;

[NoCoverage] ConditionalExpression
packages/core/src/adapters/dom.ts:25:7
-     if (key === "rotationY") return `rotateY(${String(value)}deg)`;
+     if (true) return `rotateY(${String(value)}deg)`;

[NoCoverage] ConditionalExpression
packages/core/src/adapters/dom.ts:25:7
-     if (key === "rotationY") return `rotateY(${String(value)}deg)`;
+     if (false) return `rotateY(${String(value)}deg)`;

[NoCoverage] EqualityOperator
packages/core/src/adapters/dom.ts:25:7
-     if (key === "rotationY") return `rotateY(${String(value)}deg)`;
+     if (key !== "rotationY") return `rotateY(${String(value)}deg)`;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:25:15
-     if (key === "rotationY") return `rotateY(${String(value)}deg)`;
+     if (key === "") return `rotateY(${String(value)}deg)`;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:25:35
-     if (key === "rotationY") return `rotateY(${String(value)}deg)`;
+     if (key === "rotationY") return ``;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:26:10
-     return `${key}(${String(value)}px)`;
+     return ``;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:30:24
-     if ("x" in values || "y" in values || "z" in values) {
+     if ("x" in values || "" in values || "z" in values) {

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:30:41
-     if ("x" in values || "y" in values || "z" in values) {
+     if ("x" in values || "y" in values || "" in values) {

[NoCoverage] MethodExpression
packages/core/src/adapters/dom.ts:54:37
-       else if (key in target.style || key.startsWith("--")) target.style[key] = value;
+       else if (key in target.style || key.endsWith("--")) target.style[key] = value;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:54:52
-       else if (key in target.style || key.startsWith("--")) target.style[key] = value;
+       else if (key in target.style || key.startsWith("")) target.style[key] = value;

[NoCoverage] StringLiteral
packages/core/src/adapters/dom.ts:58:54
-     else if (hadTransform) removeStyleProperty(target, "transform");
+     else if (hadTransform) removeStyleProperty(target, "");

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:23:7
-     if (key === "rotation") return `rotate(${String(value)}deg)`;
+     if (true) return `rotate(${String(value)}deg)`;
Tests ran:
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:30:7
-     if ("x" in values || "y" in values || "z" in values) {
+     if (true) {
Tests ran:
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform

[Survived] LogicalOperator
packages/core/src/adapters/dom.ts:30:7
-     if ("x" in values || "y" in values || "z" in values) {
+     if ("x" in values && "y" in values || "z" in values) {
Tests ran:
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform

[Survived] StringLiteral
packages/core/src/adapters/dom.ts:30:7
-     if ("x" in values || "y" in values || "z" in values) {
+     if ("" in values || "y" in values || "z" in values) {
Tests ran:
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform

[Survived] StringLiteral
packages/core/src/adapters/dom.ts:36:34
-     for (const key of ["rotation", "rotationX", "rotationY", "scale"])
+     for (const key of ["rotation", "", "rotationY", "scale"])
Tests ran:
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform

[Survived] StringLiteral
packages/core/src/adapters/dom.ts:36:47
-     for (const key of ["rotation", "rotationX", "rotationY", "scale"])
+     for (const key of ["rotation", "rotationX", "", "scale"])
Tests ran:
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:41:7
-     if (typeof target.style.removeProperty === "function") target.style.removeProperty(key);
+     if (true) target.style.removeProperty(key);
Tests ran:
    DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:46:24
-     const hadTransform = Object.keys(state).length > 0;
+     const hadTransform = false;
Tests ran:
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
    DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:49:11
-         if (value === undefined) delete state[key];
+         if (false) delete state[key];
Tests ran:
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:54:14
-       else if (key in target.style || key.startsWith("--")) target.style[key] = value;
+       else if (true) target.style[key] = value;
Tests ran:
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:57:7
-     if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
+     if (true) target.style.transform = composeTransform(state);
Tests ran:
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
    DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined

[Survived] EqualityOperator
packages/core/src/adapters/dom.ts:57:7
-     if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
+     if (Object.keys(state).length >= 0) target.style.transform = composeTransform(state);
Tests ran:
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
    DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:58:12
-     else if (hadTransform) removeStyleProperty(target, "transform");
+     else if (false) removeStyleProperty(target, "transform");
Tests ran:
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined

[Survived] ArrayDeclaration
packages/core/src/adapters/dom.ts:66:50
-     const internalKeys = metadata?.internalKeys ?? [];
+     const internalKeys = metadata?.internalKeys ?? ["Stryker was here"];
Tests ran:
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
    real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
    DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:82:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (true)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM plugin metadata (X-2) uses resolved internal-key metadata instead of hardcoding underscore filtering
    DOM plugin metadata (X-2) serializes plugin-owned outputs before writing to the DOM
  and 5 more tests!

[Survived] LogicalOperator
packages/core/src/adapters/dom.ts:82:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined && Number.isFinite(perspective) || perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM plugin metadata (X-2) uses resolved internal-key metadata instead of hardcoding underscore filtering
    DOM plugin metadata (X-2) serializes plugin-owned outputs before writing to the DOM
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:82:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (true && perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM plugin metadata (X-2) uses resolved internal-key metadata instead of hardcoding underscore filtering
    DOM plugin metadata (X-2) serializes plugin-owned outputs before writing to the DOM
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:82:68
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined && Number.isFinite(perspective) && true)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches

[Survived] EqualityOperator
packages/core/src/adapters/dom.ts:82:68
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined && Number.isFinite(perspective) && perspective >= 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches

[Survived] LogicalOperator
packages/core/src/adapters/dom.ts:82:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (perspective !== undefined || Number.isFinite(perspective) && perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM plugin metadata (X-2) uses resolved internal-key metadata instead of hardcoding underscore filtering
    DOM plugin metadata (X-2) serializes plugin-owned outputs before writing to the DOM
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:82:7
-     if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
+     if (true && Number.isFinite(perspective) && perspective > 0)
Tests ran:
    adapter ports applies perspective once and never applies blocked patches
    DOM plugin metadata (X-2) uses resolved internal-key metadata instead of hardcoding underscore filtering
    DOM plugin metadata (X-2) serializes plugin-owned outputs before writing to the DOM
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:89:11
-         if (target === undefined) return;
+         if (false) return;
Tests ran:
    DOM plugin metadata (X-2) uses resolved internal-key metadata instead of hardcoding underscore filtering
    DOM plugin metadata (X-2) serializes plugin-owned outputs before writing to the DOM
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/adapters/dom.ts:101:11
-         if (target === undefined) return;
+         if (false) return;
Tests ran:
    DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache

[Survived] StringLiteral
packages/core/src/adapters/dom.ts:19:42
-   const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
+   const transformKeys = new Set(["x", "y", "", "rotation", "rotationX", "rotationY", "scale"]);
Ran all tests for this mutant.

[Survived] StringLiteral
packages/core/src/adapters/dom.ts:19:59
-   const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
+   const transformKeys = new Set(["x", "y", "z", "rotation", "", "rotationY", "scale"]);
Ran all tests for this mutant.

[Survived] StringLiteral
packages/core/src/adapters/dom.ts:19:72
-   const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
+   const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "", "scale"]);
Ran all tests for this mutant.

[NoCoverage] StringLiteral
packages/core/src/domain/motion.ts:31:27
-         throw new TypeError("Motion stagger must be a finite non-negative number.");
+         throw new TypeError("");

[NoCoverage] StringLiteral
packages/core/src/domain/motion.ts:35:25
-           throw new Error(`Duplicate Motion track id: ${entry.id}.`);
+           throw new Error(``);

[NoCoverage] StringLiteral
packages/core/src/domain/motion.ts:37:29
-           throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
+           throw new TypeError(``);

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:51:15
-     get state() {
-       return this.#lifecycle.state;
-     }
+     get state() {}

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:54:17
-     get playing() {
-       return this.#playing;
-     }
+     get playing() {}

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:57:18
-     get position() {
-       return this.#position;
-     }
+     get position() {}

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:89:18
-     reflow(): void {
-       this.assertActive();
-       this.schedule();
-     }
+     reflow(): void {}

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:96:19
-     destroy(): void {
-       this.#lifecycle.destroy();
-     }
+     destroy(): void {}

[NoCoverage] StringLiteral
packages/core/src/domain/motion.ts:120:64
-       if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
+       if (this.#lifecycle.state === "destroyed") throw new Error("");

[Survived] BooleanLiteral
packages/core/src/domain/motion.ts:25:14
-     #playing = false;
+     #playing = true;
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:30:9
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (false)
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:30:9
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (!Number.isFinite(options.stagger ?? 0) && (options.stagger ?? 0) < 0)
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!
