[Survived] LogicalOperator
packages/core/src/domain/motion.ts:30:26
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (!Number.isFinite(options.stagger && 0) || (options.stagger ?? 0) < 0)
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:30:51
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (!Number.isFinite(options.stagger ?? 0) || false)
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:30:52
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger && 0) < 0)
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] BlockStatement
packages/core/src/domain/motion.ts:33:41
-       for (const entry of options.tracks) {
-         if (!entry.id || ids.has(entry.id))
-           throw new Error(`Duplicate Motion track id: ${entry.id}.`);
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
-           throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
-         ids.add(entry.id);
-       }
+       for (const entry of options.tracks) {}
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:34:11
-         if (!entry.id || ids.has(entry.id))
+         if (false)
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:34:11
-         if (!entry.id || ids.has(entry.id))
+         if (!entry.id && ids.has(entry.id))
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:36:11
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (false)
Tests ran:
    Motion composite preserves authored order and computes deterministic stagger offsets
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:36:44
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) && entry.duration <= 0))
Tests ran:
    Motion composite converts clock time into normalized progress using authored duration

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:36:80
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || false))
Tests ran:
    Motion composite converts clock time into normalized progress using authored duration

[Survived] EqualityOperator
packages/core/src/domain/motion.ts:36:80
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration < 0))
Tests ran:
    Motion composite converts clock time into normalized progress using authored duration

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:72:9
-       if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
+       if (true) this.mount();
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work
  and 1 more test!

[Survived] BlockStatement
packages/core/src/domain/motion.ts:75:17
-     pause(): void {
-       this.#playing = false;
-       for (const handle of this.#scheduled) handle.cancel();
-       this.#scheduled.clear();
-       this.#unsubscribe?.();
-       this.#unsubscribe = undefined;
-       this.#lifecycle.detach();
-     }
+     pause(): void {}
Tests ran:
    Motion composite pausing detaches the clock and play resubscribes without duplicate work
    Motion composite pauses and disposes owner-first without leaking clock work

[Survived] BooleanLiteral
packages/core/src/domain/motion.ts:76:21
-       this.#playing = false;
+       this.#playing = true;
Tests ran:
    Motion composite pausing detaches the clock and play resubscribes without duplicate work
    Motion composite pauses and disposes owner-first without leaking clock work

[Survived] MethodExpression
packages/core/src/domain/motion.ts:86:34
-       this.#position = Math.max(0, Math.min(1, progress));
+       this.#position = Math.max(0, Math.max(1, progress));
Tests ran:
    Motion composite clamps seek and rejects non-finite values

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:100:9
-       if (this.#unsubscribe === undefined)
+       if (true)
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:104:9
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (false) return;
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:104:9
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (!this.#playing && this.#lifecycle.state !== "mounted") return;
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:104:27
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (!this.#playing || false) return;
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work

[Survived] BlockStatement
packages/core/src/domain/motion.ts:119:32
-     private assertActive(): void {
-       if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
-     }
+     private assertActive(): void {}
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work
  and 2 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:120:9
-       if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
+       if (false) throw new Error("Motion is destroyed.");
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work
  and 2 more tests!

[Survived] StringLiteral
packages/core/src/domain/motion.ts:120:35
-       if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
+       if (this.#lifecycle.state === "") throw new Error("Motion is destroyed.");
Tests ran:
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
    Motion composite pausing detaches the clock and play resubscribes without duplicate work
  and 2 more tests!

[NoCoverage] ConditionalExpression
packages/core/src/domain/track.ts:25:44
-     return prototype === Object.prototype || prototype === null;
+     return prototype === Object.prototype || false;

[NoCoverage] EqualityOperator
packages/core/src/domain/track.ts:25:44
-     return prototype === Object.prototype || prototype === null;
+     return prototype === Object.prototype || prototype !== null;

[NoCoverage] StringLiteral
packages/core/src/domain/track.ts:40:38
-       throw new CompositionOutputError("Interpolator state must be a renderer-neutral record.");
+       throw new CompositionOutputError("");

[NoCoverage] StringLiteral
packages/core/src/domain/track.ts:47:38
-       throw new CompositionOutputError("Composition output must be a renderer-neutral record.");
+       throw new CompositionOutputError("");

[Survived] ConditionalExpression
packages/core/src/domain/track.ts:23:7
-     if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+     if (false || typeof value !== "object" || Array.isArray(value)) return false;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    P2 runtime smell hardening rejects host objects from interpolator state at the renderer edge
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/track.ts:25:10
-     return prototype === Object.prototype || prototype === null;
+     return true;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    P2 runtime smell hardening rejects host objects from interpolator state at the renderer edge
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/track.ts:39:7
-     if (!isRecord(state))
+     if (false)
Tests ran:
    P2 runtime smell hardening rejects host objects from interpolator state at the renderer edge
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
    Track leaf rejects non-finite progress and composes local values once per dirty state
  and 5 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/track.ts:46:7
-     if (!isRecord(values))
+     if (false)
Tests ran:
    P2 runtime smell hardening rejects host objects from interpolator state at the renderer edge
    Track leaf rejects non-finite progress and composes local values once per dirty state
    Track leaf recomposes a clean track when its inputs change
  and 4 more tests!

[Survived] BooleanLiteral
packages/core/src/domain/track.ts:67:12
-     #dirty = true;
+     #dirty = false;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    P2 runtime smell hardening rejects host objects from interpolator state at the renderer edge
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/track.ts:98:7
-         this.#lastInputs !== undefined &&
+         true &&
Tests ran:
    Track leaf rejects non-finite progress and composes local values once per dirty state
    Track leaf recomposes a clean track when its inputs change

[Survived] ConditionalExpression
packages/core/src/domain/track.ts:99:8
-         (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
+         (false || equalValues(this.#lastInputs, inputs))
Tests ran:
    Track leaf rejects non-finite progress and composes local values once per dirty state
    Track leaf recomposes a clean track when its inputs change

[Survived] StringLiteral
packages/core/src/domain/track.ts:107:11
-             `Plugin "${plugin.name}" must return a renderer-neutral record.`,
+             ``,
Tests ran:
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value

[Survived] ConditionalExpression
packages/core/src/domain/track.ts:105:11
-         if (!isRecord(composed))
+         if (false)
Tests ran:
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
    Track leaf rejects non-finite progress and composes local values once per dirty state
    Track leaf recomposes a clean track when its inputs change
  and 1 more test!

[Survived] ArrayDeclaration
packages/core/src/domain/track.ts:59:31
-     internalKeys: Object.freeze([]),
+     internalKeys: Object.freeze(["Stryker was here"]),
Ran all tests for this mutant.

[Survived] ArrayDeclaration
packages/core/src/domain/track.ts:58:30
-     diagnostics: Object.freeze([]),
+     diagnostics: Object.freeze(["Stryker was here"]),
Ran all tests for this mutant.

[Survived] ObjectLiteral
packages/core/src/domain/track.ts:61:30
-     preparation: Object.freeze({ keyframes: Object.freeze({}), tweenVars: Object.freeze({}) }),
+     preparation: Object.freeze({}),
Ran all tests for this mutant.

[NoCoverage] BlockStatement
packages/core/src/graph/ids.ts:71:57
-   export function qualifiedId(value: QualifiedId): string {
-     return value.value;
-   }
+   export function qualifiedId(value: QualifiedId): string {}

[Survived] ConditionalExpression
packages/core/src/graph/ids.ts:17:7
-     if (typeof value !== "string" || value.length === 0) {
+     if (false || value.length === 0) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 67 more tests!

[Survived] StringLiteral
packages/core/src/graph/ids.ts:54:25
-     assertNonEmpty(value, "Qualified id");
+     assertNonEmpty(value, "");
Tests ran:
    qualified node ids round-trips qualified ids without losing identity
    qualified node ids rejects reserved or malformed authored ids

[Survived] StringLiteral
packages/core/src/graph/ids.ts:23:28
-     assertNonEmpty(motionId, "Motion id");
+     assertNonEmpty(motionId, "");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 67 more tests!

[Survived] LogicalOperator
packages/core/src/graph/ids.ts:62:5
-       separator <= 0 ||
-       separator === value.length - 1 ||
+       separator <= 0 && separator === value.length - 1 ||
Tests ran:
    qualified node ids round-trips qualified ids without losing identity
    qualified node ids rejects reserved or malformed authored ids

[Survived] ConditionalExpression
packages/core/src/graph/ids.ts:62:5
-       separator <= 0 ||
-       separator === value.length - 1 ||
+       false ||
Tests ran:
    qualified node ids round-trips qualified ids without losing identity
    qualified node ids rejects reserved or malformed authored ids

[Survived] ConditionalExpression
packages/core/src/graph/ids.ts:62:5
-       separator <= 0 ||
+       false ||
Tests ran:
    qualified node ids round-trips qualified ids without losing identity
    qualified node ids rejects reserved or malformed authored ids

[Survived] EqualityOperator
packages/core/src/graph/ids.ts:62:5
-       separator <= 0 ||
+       separator < 0 ||
Tests ran:
    qualified node ids round-trips qualified ids without losing identity
    qualified node ids rejects reserved or malformed authored ids

[Survived] ConditionalExpression
packages/core/src/graph/ids.ts:63:5
-       separator === value.length - 1 ||
+       false ||
Tests ran:
    qualified node ids round-trips qualified ids without losing identity
    qualified node ids rejects reserved or malformed authored ids

[Survived] ArithmeticOperator
packages/core/src/graph/ids.ts:63:19
-       separator === value.length - 1 ||
+       separator === value.length + 1 ||
Tests ran:
    qualified node ids round-trips qualified ids without losing identity
    qualified node ids rejects reserved or malformed authored ids

[Survived] StringLiteral
packages/core/src/graph/ids.ts:29:27
-     assertNonEmpty(trackId, "Track id");
+     assertNonEmpty(trackId, "");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 67 more tests!

[NoCoverage] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:64:44
-     return prototype === Object.prototype || prototype === null;
+     return prototype === Object.prototype || false;

[NoCoverage] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:64:44
-     return prototype === Object.prototype || prototype === null;
+     return prototype === Object.prototype || prototype !== null;

[NoCoverage] BooleanLiteral
packages/core/src/runtime/graph-publisher.ts:67:30
-     if (value === null) return true;
+     if (value === null) return false;

[NoCoverage] MethodExpression
packages/core/src/runtime/graph-publisher.ts:72:36
-     if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
+     if (Array.isArray(value)) return value.some(item => isRendererNeutral(item, seen));

[NoCoverage] ArrowFunction
packages/core/src/runtime/graph-publisher.ts:72:48
-     if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
+     if (Array.isArray(value)) return value.every(() => undefined);

[NoCoverage] BooleanLiteral
packages/core/src/runtime/graph-publisher.ts:73:32
-     if (!isRecord(value)) return false;
+     if (!isRecord(value)) return true;

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-publisher.ts:106:5
-       "observation-input-shape",
+       "",

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-publisher.ts:107:5
-       "Input projection must define pick or map.",
+       "",

[NoCoverage] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:129:44
-         queue.push(...(dependents.get(id) ?? []));
+         queue.push(...(dependents.get(id) ?? ["Stryker was here"]));

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-publisher.ts:177:17
-                   "observation-input-shape",
+                   "",

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-publisher.ts:178:17
-                   `Input observation source "${edge.sourceId}" must be a record.`,
+                   ``,

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-publisher.ts:203:17
-                   "observation-missing-upstream",
+                   "",

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-publisher.ts:204:17
-                   `Output observation source "${edge.sourceId}" has no published value.`,
+                   ``,

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:37:17
-       this.name = "observation-output-shape";
+       this.name = "";
Tests ran:
    composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:47:9
-         : "composition-failure";
+         : "";
Tests ran:
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:43:5
-       error instanceof InputObservationError ||
-       error instanceof OutputObservationError ||
-       error instanceof CompositionOutputError
+       true
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
  and 4 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:52:15
-       severity: "error",
+       severity: "",
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
  and 4 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:53:24
-       ids: Object.freeze([nodeId]),
+       ids: Object.freeze([]),
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:59:10
-     return left < right ? -1 : left > right ? 1 : 0;
+     return true ? -1 : left > right ? 1 : 0;
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:59:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : true ? 1 : 0;
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
    GraphPublisher partial-seed inputs uses the last published flat value for an unseeded input source

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:59:10
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left <= right ? -1 : left > right ? 1 : 0;
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:59:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : false ? 1 : 0;
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
    GraphPublisher partial-seed inputs uses the last published flat value for an unseeded input source

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:59:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : left >= right ? 1 : 0;
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
    GraphPublisher partial-seed inputs uses the last published flat value for an unseeded input source

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:59:30
-     return left < right ? -1 : left > right ? 1 : 0;
+     return left < right ? -1 : left <= right ? 1 : 0;
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
    GraphPublisher partial-seed inputs uses the last published flat value for an unseeded input source

[Survived] LogicalOperator
packages/core/src/runtime/graph-publisher.ts:62:7
-     if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+     if ((value === null || typeof value !== "object") && Array.isArray(value)) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:62:7
-     if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+     if (false) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:62:7
-     if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+     if (false || Array.isArray(value)) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/graph-publisher.ts:62:7
-     if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+     if (value === null && typeof value !== "object" || Array.isArray(value)) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!
