[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:62:7
-     if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+     if (false || typeof value !== "object" || Array.isArray(value)) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:62:25
-     if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+     if (value === null || false || Array.isArray(value)) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:64:10
-     return prototype === Object.prototype || prototype === null;
+     return true;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:67:7
-     if (value === null) return true;
+     if (false) return true;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:70:7
-     if (typeof value !== "object" || seen.has(value)) return false;
+     if (false) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:70:7
-     if (typeof value !== "object" || seen.has(value)) return false;
+     if (false || seen.has(value)) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/graph-publisher.ts:70:7
-     if (typeof value !== "object" || seen.has(value)) return false;
+     if (typeof value !== "object" && seen.has(value)) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:72:7
-     if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
+     if (false) return value.every((item) => isRendererNeutral(item, seen));
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:73:7
-     if (!isRecord(value)) return false;
+     if (false) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:81:7
-         "Composition output must contain only renderer-neutral values.",
+         "",
Tests ran:
    composition and output-shape diagnostics does not publish malformed composition values as ready patches

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:88:10
-     return overlay === undefined ? base : Object.freeze({ ...base, ...overlay });
+     return false ? base : Object.freeze({ ...base, ...overlay });
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
    GraphPublisher: memo/registry consistency (recovery A1) a later flush resolves the source's merged flat value via registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] MethodExpression
packages/core/src/runtime/graph-publisher.ts:75:23
-       ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
+       ([key, item]) => !key.endsWith("_") && isRendererNeutral(item, seen),
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 28 more tests!

[Survived] MethodExpression
packages/core/src/runtime/graph-publisher.ts:97:7
-         projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
+         projection.pick.map((key) => [key, source[key]]),
Tests ran:
    flat projected input observations (X-1) applies an explicit pick projection before merging input keys

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:99:7
-     if (projection.map !== undefined)
+     if (true)
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting

[Survived] MethodExpression
packages/core/src/runtime/graph-publisher.ts:101:7
-         Object.entries(projection.map)
-           .filter(([sourceKey]) => sourceKey in source)
+         Object.entries(projection.map)
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:103:42
-           .map(([sourceKey, targetKey]) => [targetKey, source[sourceKey]]),
+           .map(([sourceKey, targetKey]) => []),
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:117:9
-       if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+       if (false) throw new Error(REENTRANT_BATCH_MESSAGE);
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:120:64
-       for (const node of snapshot.nodes) dependents.set(node.id, []);
+       for (const node of snapshot.nodes) dependents.set(node.id, ["Stryker was here"]);
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-publisher.ts:125:25
-       for (let index = 0; index < queue.length; index += 1) {
+       for (let index = 0; index <= queue.length; index += 1) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:127:11
-         if (id === undefined || affected.has(id)) continue;
+         if (false) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/graph-publisher.ts:127:11
-         if (id === undefined || affected.has(id)) continue;
+         if (id === undefined && affected.has(id)) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:127:11
-         if (id === undefined || affected.has(id)) continue;
+         if (false || affected.has(id)) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:139:13
-           if (node === undefined) continue;
+           if (false) continue;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:151:25
-                   ruleId: "blocked-upstream",
+                   ruleId: "",
Tests ran:
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:153:26
-                   message: `Blocked by upstream failure at ${sourceFailure}.`,
+                   message: ``,
Tests ran:
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:154:27
-                   severity: "error",
+                   severity: "",
Tests ran:
    P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
    GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:173:17
-                   `Input observation source "${edge.sourceId}" has no published value.`,
+                   ``,
Tests ran:
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole

[Survived] MethodExpression
packages/core/src/runtime/graph-publisher.ts:165:30
-             for (const edge of node.edges
-               .filter(({ role }) => role === "input")
-               .sort(compareEdgeKeys)) {
+             for (const edge of node.edges.filter(({
+     role
+   }) => role === "input")) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 31 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:175:17
-               if (!isRecord(sourceValues))
+               if (false)
Tests ran:
    flat projected input observations (X-1) merges an upstream record into the observer source object
    flat projected input observations (X-1) applies an explicit pick projection before merging input keys
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:180:17
-               if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
+               if (true) sourceRevisions[edge.sourceId] = sourcePatch.revision;
Tests ran:
    flat projected input observations (X-1) merges an upstream record into the observer source object
    flat projected input observations (X-1) applies an explicit pick projection before merging input keys
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
  and 4 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:187:19
-                     `Input key "${key}" from ${edgeKey(edge)} collides with ${previous}.`,
+                     ``,
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting

[Survived] OptionalChaining
packages/core/src/runtime/graph-publisher.ts:200:69
-               const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;
+               const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch.values;
Tests ran:
    composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:201:17
-               if (sourceValues === undefined)
+               if (false)
Tests ran:
    composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
    GraphPublisher: memo/registry consistency (recovery A1) a later flush resolves the source's merged flat value via registry fallback
  and 3 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-publisher.ts:208:17
-                   `Output observation source "${edge.sourceId}" must publish a renderer-neutral record.`,
+                   ``,
Tests ran:
    composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:210:17
-               if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
+               if (true) sourceRevisions[edge.sourceId] = sourcePatch.revision;
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
    GraphPublisher: memo/registry consistency (recovery A1) a later flush resolves the source's merged flat value via registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-publisher.ts:210:17
-               if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
+               if (false) sourceRevisions[edge.sourceId] = sourcePatch.revision;
Tests ran:
    GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
    GraphPublisher: memo/registry consistency (recovery A1) a later flush resolves the source's merged flat value via registry fallback
    GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
  and 2 more tests!

[Survived] BlockStatement
packages/core/src/runtime/graph-publisher.ts:240:11
-         try {
-           this.#registry.closeBatch();
-         } catch {
+         try {} catch {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
    clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
    PatchRegistry: subscriber error handling (recovery A2) GraphPublisher.flush() surfaces the real subscriber error, not a masked 'No patch batch is open'

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-publisher.ts:225:26
-               diagnostics: [],
+               diagnostics: ["Stryker was here"],
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 26 more tests!

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:25:21
-       path: ids[0] ?? "",
+       path: ids[0] ?? "Stryker was here!",

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:105:27
-         throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+         throw new TypeError(``);

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:121:55
-         if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
+         if (!Number.isFinite(tick)) throw new TypeError("");

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:122:55
-         if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+         if (tick < this.#lastTick) throw new RangeError("");

[NoCoverage] BlockStatement
packages/core/src/runtime/graph-runtime.ts:176:25
-           } catch (error) {
-             this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
-           }
+           } catch (error) {}

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:177:44
-             this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
+             this.#report(FLUSH_FAILURE_RULE, ``);

[NoCoverage] BlockStatement
packages/core/src/runtime/graph-runtime.ts:187:39
-       if (event.tick <= this.#lastTick) {
-         this.#report(
-           CLOCK_REGRESSION_RULE,
-           `Clock tick ${event.tick} did not advance past ${this.#lastTick}.`,
-         );
-         return;
-       }
+       if (event.tick <= this.#lastTick) {}

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:190:9
-           `Clock tick ${event.tick} did not advance past ${this.#lastTick}.`,
+           ``,

[NoCoverage] StringLiteral
packages/core/src/runtime/graph-runtime.ts:212:41
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+       if (this.#disposed) throw new Error("");

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:27:7
-         "A flush requested while subscribers were being notified was queued as one follow-up " +
+         "" +
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/graph-runtime.ts:25:11
-       path: ids[0] ?? "",
+       path: ids[0] && "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 3 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:28:7
-         "invalidation for the scheduler.",
+         "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 3 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:29:15
-       severity: "warning",
+       severity: "",
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 3 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/graph-runtime.ts:59:21
-     #scheduledDrain = false;
+     #scheduledDrain = true;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 24 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:104:9
-       if (!this.#binding.graph.nodeById[nodeId])
+       if (false)
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 16 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:121:11
-         if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
+         if (false) throw new TypeError("Runtime ticks must be finite.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 8 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:122:11
-         if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+         if (false) throw new RangeError("Runtime ticks must be monotonic.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 8 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-runtime.ts:122:11
-         if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
+         if (tick <= this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 8 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:132:11
-         if (cached) return cached;
+         if (false) return cached;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 14 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-runtime.ts:137:75
-       const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [node.id, node])));
+       const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [])));
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 14 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:151:11
-         if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
+         if (true) this.#scheduleDrain();
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 14 more tests!
