[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:151:11
-         if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
+         if (false) this.#scheduleDrain();
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 14 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-runtime.ts:151:11
-         if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
+         if (this.#pendingSeeds.size >= 0) this.#scheduleDrain();
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 14 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-runtime.ts:151:11
-         if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
+         if (this.#pendingSeeds.size <= 0) this.#scheduleDrain();
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 14 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:159:9
-       if (this.#disposed) return;
+       if (false) return;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 23 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/graph-runtime.ts:160:22
-       this.#disposed = true;
+       this.#disposed = false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 23 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/graph-runtime.ts:165:28
-       this.#scheduledDrain = false;
+       this.#scheduledDrain = true;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 23 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/graph-runtime.ts:172:32
-           this.#scheduledDrain = false;
+           this.#scheduledDrain = true;
Tests ran:
    scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
    scheduler-driven reentrancy (P1-7/P1-8) coalesces repeated invalidations into one scheduled follow-up
    scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:173:13
-           if (this.#disposed || this.#pendingSeeds.size === 0) return;
+           if (false) return;
Tests ran:
    scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
    scheduler-driven reentrancy (P1-7/P1-8) coalesces repeated invalidations into one scheduled follow-up
    scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure

[Survived] LogicalOperator
packages/core/src/runtime/graph-runtime.ts:173:13
-           if (this.#disposed || this.#pendingSeeds.size === 0) return;
+           if (this.#disposed && this.#pendingSeeds.size === 0) return;
Tests ran:
    scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
    scheduler-driven reentrancy (P1-7/P1-8) coalesces repeated invalidations into one scheduled follow-up
    scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:173:31
-           if (this.#disposed || this.#pendingSeeds.size === 0) return;
+           if (this.#disposed || false) return;
Tests ran:
    scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
    scheduler-driven reentrancy (P1-7/P1-8) coalesces repeated invalidations into one scheduled follow-up
    scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-runtime.ts:175:22
-             this.flush([]);
+             this.flush(["Stryker was here"]);
Tests ran:
    scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
    scheduler-driven reentrancy (P1-7/P1-8) coalesces repeated invalidations into one scheduled follow-up
    scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:182:44
-         this.#report(SCHEDULER_FAILURE_RULE, `Deferred flush scheduling failed: ${describe(error)}`);
+         this.#report(SCHEDULER_FAILURE_RULE, ``);
Tests ran:
    scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:187:9
-       if (event.tick <= this.#lastTick) {
+       if (false) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 7 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/graph-runtime.ts:187:9
-       if (event.tick <= this.#lastTick) {
+       if (event.tick < this.#lastTick) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 7 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/graph-runtime.ts:206:26
-         ids: Object.freeze([...this.#members]),
+         ids: Object.freeze([]),
Tests ran:
    clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
    scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure

[Survived] BlockStatement
packages/core/src/runtime/graph-runtime.ts:211:23
-     #assertLive(): void {
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
-     }
+     #assertLive(): void {}
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 16 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/graph-runtime.ts:212:9
-       if (this.#disposed) throw new Error("GraphRuntime is disposed.");
+       if (false) throw new Error("GraphRuntime is disposed.");
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 16 more tests!

[Survived] StringLiteral
packages/core/src/runtime/graph-runtime.ts:13:38
-   export const CLOCK_REGRESSION_RULE = "clock-tick-regression";
+   export const CLOCK_REGRESSION_RULE = "";
Ran all tests for this mutant.

[NoCoverage] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:28:50
-     if (a === undefined || b === undefined) return a === b;
+     if (a === undefined || b === undefined) return true;

[NoCoverage] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:28:50
-     if (a === undefined || b === undefined) return a === b;
+     if (a === undefined || b === undefined) return false;

[NoCoverage] EqualityOperator
packages/core/src/runtime/patch-registry.ts:28:50
-     if (a === undefined || b === undefined) return a === b;
+     if (a === undefined || b === undefined) return a !== b;

[NoCoverage] BooleanLiteral
packages/core/src/runtime/patch-registry.ts:29:37
-     if (a.length !== b.length) return false;
+     if (a.length !== b.length) return true;

[NoCoverage] BooleanLiteral
packages/core/src/runtime/patch-registry.ts:42:37
-     if (a.length !== b.length) return false;
+     if (a.length !== b.length) return true;

[NoCoverage] BlockStatement
packages/core/src/runtime/patch-registry.ts:158:25
-           } catch (error) {
-             if (!hasError) {
-               hasError = true;
-               firstError = error;
-             }
-           }
+           } catch (error) {}

[NoCoverage] BooleanLiteral
packages/core/src/runtime/patch-registry.ts:159:15
-             if (!hasError) {
+             if (hasError) {

[NoCoverage] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:159:15
-             if (!hasError) {
+             if (true) {

[NoCoverage] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:159:15
-             if (!hasError) {
+             if (false) {

[NoCoverage] BlockStatement
packages/core/src/runtime/patch-registry.ts:159:26
-             if (!hasError) {
-               hasError = true;
-               firstError = error;
-             }
+             if (!hasError) {}

[NoCoverage] BooleanLiteral
packages/core/src/runtime/patch-registry.ts:160:24
-               hasError = true;
+               hasError = false;

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:28:7
-     if (a === undefined || b === undefined) return a === b;
+     if (false) return a === b;
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:28:7
-     if (a === undefined || b === undefined) return a === b;
+     if (a === undefined && b === undefined) return a === b;
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:28:7
-     if (a === undefined || b === undefined) return a === b;
+     if (false || b === undefined) return a === b;
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:28:26
-     if (a === undefined || b === undefined) return a === b;
+     if (a === undefined || false) return a === b;
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:29:7
-     if (a.length !== b.length) return false;
+     if (false) return false;
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:34:5
-       a.ruleId === b.ruleId &&
-       a.path === b.path &&
-       a.message === b.message &&
-       a.severity === b.severity &&
+       true &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:34:5
-       a.ruleId === b.ruleId &&
-       a.path === b.path &&
-       a.message === b.message &&
-       a.severity === b.severity &&
+       a.ruleId === b.ruleId && a.path === b.path && a.message === b.message || a.severity === b.severity &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:34:5
-       a.ruleId === b.ruleId &&
-       a.path === b.path &&
-       a.message === b.message &&
+       true &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:34:5
-       a.ruleId === b.ruleId &&
-       a.path === b.path &&
-       a.message === b.message &&
+       a.ruleId === b.ruleId && a.path === b.path || a.message === b.message &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:34:5
-       a.ruleId === b.ruleId &&
-       a.path === b.path &&
+       true &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:34:5
-       a.ruleId === b.ruleId &&
-       a.path === b.path &&
+       a.ruleId === b.ruleId || a.path === b.path &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:34:5
-       a.ruleId === b.ruleId &&
+       true &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:35:5
-       a.path === b.path &&
+       true &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:36:5
-       a.message === b.message &&
+       true &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:21:7
-     if (value === null || typeof value !== "object") return value;
+     if (false || typeof value !== "object") return value;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 55 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:37:5
-       a.severity === b.severity &&
+       true &&
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:45:12
-       return other !== undefined && sameDiagnostic(item, other);
+       return true && sameDiagnostic(item, other);
Tests ran:
    PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
    PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:22:7
-     if (seen.has(value)) return value;
+     if (false) return value;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 55 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:42:7
-     if (a.length !== b.length) return false;
+     if (false) return false;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    PatchRegistry: structural change detection (recovery P1-5) suppresses the republish when a freshly allocated nested record is structurally equal
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:54:5
-       a.status === b.status &&
+       true &&
Tests ran:
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
    P2 runtime smell hardening preserves the last known good values when a node publishes error
  and 10 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:63:21
-     #batch: Patch[] = [];
+     #batch: Patch[] = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 64 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:64:37
-     #batchDiagnostics: Diagnostic[] = [];
+     #batchDiagnostics: Diagnostic[] = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 64 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:66:27
-     #batchSeeds: string[] = [];
+     #batchSeeds: string[] = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 64 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:83:30
-       this.#batchDiagnostics = [];
+       this.#batchDiagnostics = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 55 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:89:7
-         input.values === undefined && input.status !== "ready"
+         false
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:89:7
-         input.values === undefined && input.status !== "ready"
+         true
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:89:7
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined || input.status !== "ready"
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:89:37
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined && true
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/patch-registry.ts:89:37
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined && input.status === "ready"
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] StringLiteral
packages/core/src/runtime/patch-registry.ts:89:54
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined && input.status !== ""
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:90:12
-           ? (previous?.sourceProgress ?? input.sourceProgress)
+           ? (previous?.sourceProgress && input.sourceProgress)
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:89:7
-         input.values === undefined && input.status !== "ready"
+         true && input.status !== "ready"
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/patch-registry.ts:89:7
-         input.values === undefined && input.status !== "ready"
+         input.values !== undefined && input.status !== "ready"
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:93:7
-         input.values === undefined && input.status !== "ready"
+         false
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:93:7
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined || input.status !== "ready"
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!
