[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:93:37
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined && true
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/patch-registry.ts:93:37
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined && input.status === "ready"
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] StringLiteral
packages/core/src/runtime/patch-registry.ts:93:54
-         input.values === undefined && input.status !== "ready"
+         input.values === undefined && input.status !== ""
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:93:7
-         input.values === undefined && input.status !== "ready"
+         true && input.status !== "ready"
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:94:12
-           ? (previous?.sourceRevisions ?? input.sourceRevisions ?? {})
+           ? ((previous?.sourceRevisions ?? input.sourceRevisions) && {})
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] LogicalOperator
packages/core/src/runtime/patch-registry.ts:94:12
-           ? (previous?.sourceRevisions ?? input.sourceRevisions ?? {})
+           ? (previous?.sourceRevisions && input.sourceRevisions ?? {})
Tests ran:
    flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
  and 7 more tests!

[Survived] EqualityOperator
packages/core/src/runtime/patch-registry.ts:93:7
-         input.values === undefined && input.status !== "ready"
+         input.values !== undefined && input.status !== "ready"
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 54 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:103:41
-         diagnostics: input.diagnostics ?? [],
+         diagnostics: input.diagnostics ?? ["Stryker was here"],
Tests ran:
    subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
    P2 runtime smell hardening preserves the last known good values when a node publishes error
    PatchRegistry: structural change detection (recovery P1-5) suppresses the republish when a freshly allocated nested record is structurally equal
  and 19 more tests!

[Survived] ArrowFunction
packages/core/src/runtime/patch-registry.ts:120:12
-       return () => this.#batchListeners.delete(listener);
+       return () => undefined;
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 7 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:138:19
-       this.#batch = [];
+       this.#batch = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 55 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:139:30
-       this.#batchDiagnostics = [];
+       this.#batchDiagnostics = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 55 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/patch-registry.ts:140:24
-       this.#batchSeeds = [];
+       this.#batchSeeds = ["Stryker was here"];
Tests ran:
    subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
    subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
    subscriber-triggered reentrancy (recovery A3) coalesces several subscriber-triggered invalidations into one follow-up
  and 55 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/patch-registry.ts:150:17
-               if (!hasError) {
+               if (true) {
Tests ran:
    subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
    clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
    PatchRegistry: subscriber error handling (recovery A2) a throwing node subscriber does not prevent other subscribers from being notified
  and 3 more tests!

[Survived] StringLiteral
packages/core/src/runtime/patch-registry.ts:18:3
-     "Queue one follow-up invalidation instead of recursing.";
+     "";
Ran all tests for this mutant.

[NoCoverage] BlockStatement
packages/core/src/runtime/project-runtime.ts:35:36
-     get project(): ProjectDefinition {
-       return this.#project;
-     }
+     get project(): ProjectDefinition {}

[NoCoverage] StringLiteral
packages/core/src/runtime/project-runtime.ts:72:41
-       if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
+       if (this.#disposed) throw new Error("");

[Survived] StringLiteral
packages/core/src/runtime/project-runtime.ts:46:58
-       if (this.#instances.has(nodeId)) throw new TypeError(`Node "${nodeId}" is already mounted.`);
+       if (this.#instances.has(nodeId)) throw new TypeError(``);
Tests ran:
    ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime

[Survived] ObjectLiteral
packages/core/src/runtime/project-runtime.ts:27:79
-         this.#graph = new GraphRuntime(project, options.clock, options.compose, {
-           scheduler: options.scheduler,
-         });
+         this.#graph = new GraphRuntime(project, options.clock, options.compose, {});
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/project-runtime.ts:54:9
-       if (instance === undefined) return;
+       if (false) return;
Tests ran:
    ProjectRuntime TR-R-14 mounts through one project-owned GraphRuntime

[Survived] BlockStatement
packages/core/src/runtime/project-runtime.ts:71:23
-     #assertLive(): void {
-       if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
-     }
+     #assertLive(): void {}
Tests ran:
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
    Engine publishes a progress change through the public project handle
  and 5 more tests!

[Survived] BooleanLiteral
packages/core/src/runtime/project-runtime.ts:65:22
-       this.#disposed = true;
+       this.#disposed = false;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/project-runtime.ts:64:9
-       if (this.#disposed) return;
+       if (false) return;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 9 more tests!

[Survived] ArrayDeclaration
packages/core/src/runtime/project-runtime.ts:66:26
-       for (const nodeId of [...this.#instances.keys()]) this.#graph.detach(nodeId);
+       for (const nodeId of []) this.#graph.detach(nodeId);
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
  and 9 more tests!

[Survived] ConditionalExpression
packages/core/src/runtime/project-runtime.ts:72:9
-       if (this.#disposed) throw new Error("ProjectRuntime is disposed.");
+       if (false) throw new Error("ProjectRuntime is disposed.");
Tests ran:
    clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
    Engine publishes a progress change through the public project handle
  and 5 more tests!

[NoCoverage] StringLiteral
packages/core/src/engine.ts:58:11
-           ? "Project failed v5 validation."
+           ? ""

[NoCoverage] StringLiteral
packages/core/src/engine.ts:90:44
-         if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+         if (!definition) throw new TypeError(``);

[Survived] ArrowFunction
packages/core/src/engine.ts:41:12
-       mount: (nodeId, instance = {}) => runtime.mount(nodeId, instance),
+       mount: () => undefined,
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 6 more tests!

[Survived] ArrowFunction
packages/core/src/engine.ts:42:14
-       unmount: (nodeId) => runtime.unmount(nodeId),
+       unmount: () => undefined,
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 6 more tests!

[Survived] ArrowFunction
packages/core/src/engine.ts:45:14
-       dispose: () => runtime.dispose(),
+       dispose: () => undefined,
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 6 more tests!

[Survived] StringLiteral
packages/core/src/engine.ts:51:11
-       .join(" ");
+       .join("");
Tests ran:
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
    X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
    X-3 contribution through the product load path merges contributed keyframes into compiler diagnostics before timeline creation
  and 4 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:57:7
-         result.diagnostics.length === 0
+         false
Tests ran:
    Engine product-load validation (X-1 follow-up) rejects malformed authored stops before constructing a runtime
    Engine product-load validation (X-1 follow-up) rejects malformed authored stops before any timeline is created
    S6 plugin use contract rejects the dead TrackDefinition.use field instead of silently ignoring it

[Survived] LogicalOperator
packages/core/src/engine.ts:55:7
-     if (!result.valid || result.value === null)
+     if (!result.valid && result.value === null)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 13 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:55:24
-     if (!result.valid || result.value === null)
+     if (!result.valid || false)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 10 more tests!

[Survived] ObjectLiteral
packages/core/src/engine.ts:85:51
-         nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
+         nodes.set(qualifyFreeTrack(track.id).value, {});
Tests ran:
    Engine publishes a progress change through the public project handle
    Engine keeps one clock owner while clock progress publishes once
    Engine still resolves authored-key plugins during progress updates

[Survived] ConditionalExpression
packages/core/src/engine.ts:88:11
-         if (existing) return existing;
+         if (false) return existing;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:90:11
-         if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+         if (false) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 10 more tests!

[Survived] StringLiteral
packages/core/src/engine.ts:91:20
-         const path = `${nodeId}.keyframes`;
+         const path = ``;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 10 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:102:46
-         if (diagnostics.some(({ severity }) => severity === "error"))
+         if (diagnostics.some(({ severity }) => true))
Tests ran:
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
    X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
    X-3 contribution through the product load path merges contributed keyframes into compiler diagnostics before timeline creation
  and 1 more test!

[Survived] ArrayDeclaration
packages/core/src/engine.ts:101:57
-         const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
+         const diagnostics = [...(resolved?.diagnostics ?? ["Stryker was here"]), ...keyframeCompilation.diagnostics];
Tests ran:
    X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
    Engine product-load validation (X-1 follow-up) accepts a valid project and creates its timelines during load
    Engine publishes a progress change through the public project handle
  and 3 more tests!

[Survived] BlockStatement
packages/core/src/engine.ts:132:35
-           disposeComposition: () => {
-             for (const track of tracks.values()) track.dispose();
-             tracks.clear();
-           },
+           disposeComposition: () => {},
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 6 more tests!
