[Killed] StringLiteral
core/src/adapters/dom.ts:19:32
   clear(target?: DomTarget): void;
 }
 
-const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
+const transformKeys = new Set(["", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
 const transformState = new WeakMap<object, Record<string, unknown>>();
 function transformValue(key: string, value: unknown): string {
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(0px, 20px, 0px) rotate(30…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] StringLiteral
core/src/adapters/dom.ts:19:85
   clear(target?: DomTarget): void;
 }
 
-const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
+const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", ""]);
 const transformState = new WeakMap<object, Record<string, unknown>>();
 function transformValue(key: string, value: unknown): string {
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px) rotate(3…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] BlockStatement
core/src/adapters/dom.ts:21:62
 
 const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
 const transformState = new WeakMap<object, Record<string, unknown>>();
-function transformValue(key: string, value: unknown): string {
-  if (key === "scale") return `scale(${String(value)})`;
-  if (key === "rotation") return `rotate(${String(value)}deg)`;
-  if (key === "rotationX") return `rotateX(${String(value)}deg)`;
-  if (key === "rotationY") return `rotateY(${String(value)}deg)`;
-  return `${key}(${String(value)}px)`;
-}
+function transformValue(key: string, value: unknown): string {}
 function composeTransform(values: Readonly<Record<string, unknown>>): string {
   const parts: string[] = [];
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px)  ' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] EqualityOperator
core/src/adapters/dom.ts:22:7
 const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
 const transformState = new WeakMap<object, Record<string, unknown>>();
 function transformValue(key: string, value: unknown): string {
-  if (key === "scale") return `scale(${String(value)})`;
+  if (key !== "scale") return `scale(${String(value)})`;
   if (key === "rotation") return `rotate(${String(value)}deg)`;
   if (key === "rotationX") return `rotateX(${String(value)}deg)`;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px) scale(30…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:22:7
 const transformKeys = new Set(["x", "y", "z", "rotation", "rotationX", "rotationY", "scale"]);
 const transformState = new WeakMap<object, Record<string, unknown>>();
 function transformValue(key: string, value: unknown): string {
-  if (key === "scale") return `scale(${String(value)})`;
+  if (false) return `scale(${String(value)})`;
   if (key === "rotation") return `rotate(${String(value)}deg)`;
   if (key === "rotationX") return `rotateX(${String(value)}deg)`;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px) rotate(3…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:23:7
 const transformState = new WeakMap<object, Record<string, unknown>>();
 function transformValue(key: string, value: unknown): string {
   if (key === "scale") return `scale(${String(value)})`;
-  if (key === "rotation") return `rotate(${String(value)}deg)`;
+  if (false) return `rotate(${String(value)}deg)`;
   if (key === "rotationX") return `rotateX(${String(value)}deg)`;
   if (key === "rotationY") return `rotateY(${String(value)}deg)`;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px) rotation…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] EqualityOperator
core/src/adapters/dom.ts:23:7
 const transformState = new WeakMap<object, Record<string, unknown>>();
 function transformValue(key: string, value: unknown): string {
   if (key === "scale") return `scale(${String(value)})`;
-  if (key === "rotation") return `rotate(${String(value)}deg)`;
+  if (key !== "rotation") return `rotate(${String(value)}deg)`;
   if (key === "rotationX") return `rotateX(${String(value)}deg)`;
   if (key === "rotationY") return `rotateY(${String(value)}deg)`;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px) rotation…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[NoCoverage] ConditionalExpression
core/src/adapters/dom.ts:24:7
 function transformValue(key: string, value: unknown): string {
   if (key === "scale") return `scale(${String(value)})`;
   if (key === "rotation") return `rotate(${String(value)}deg)`;
-  if (key === "rotationX") return `rotateX(${String(value)}deg)`;
+  if (true) return `rotateX(${String(value)}deg)`;
   if (key === "rotationY") return `rotateY(${String(value)}deg)`;
   return `${key}(${String(value)}px)`;

[NoCoverage] ConditionalExpression
core/src/adapters/dom.ts:24:7
 function transformValue(key: string, value: unknown): string {
   if (key === "scale") return `scale(${String(value)})`;
   if (key === "rotation") return `rotate(${String(value)}deg)`;
-  if (key === "rotationX") return `rotateX(${String(value)}deg)`;
+  if (false) return `rotateX(${String(value)}deg)`;
   if (key === "rotationY") return `rotateY(${String(value)}deg)`;
   return `${key}(${String(value)}px)`;

[NoCoverage] ConditionalExpression
core/src/adapters/dom.ts:25:7
   if (key === "scale") return `scale(${String(value)})`;
   if (key === "rotation") return `rotate(${String(value)}deg)`;
   if (key === "rotationX") return `rotateX(${String(value)}deg)`;
-  if (key === "rotationY") return `rotateY(${String(value)}deg)`;
+  if (false) return `rotateY(${String(value)}deg)`;
   return `${key}(${String(value)}px)`;
 }

[NoCoverage] ConditionalExpression
core/src/adapters/dom.ts:25:7
   if (key === "scale") return `scale(${String(value)})`;
   if (key === "rotation") return `rotate(${String(value)}deg)`;
   if (key === "rotationX") return `rotateX(${String(value)}deg)`;
-  if (key === "rotationY") return `rotateY(${String(value)}deg)`;
+  if (true) return `rotateY(${String(value)}deg)`;
   return `${key}(${String(value)}px)`;
 }

[NoCoverage] StringLiteral
core/src/adapters/dom.ts:26:10
   if (key === "rotation") return `rotate(${String(value)}deg)`;
   if (key === "rotationX") return `rotateX(${String(value)}deg)`;
   if (key === "rotationY") return `rotateY(${String(value)}deg)`;
-  return `${key}(${String(value)}px)`;
+  return ``;
 }
 function composeTransform(values: Readonly<Record<string, unknown>>): string {

[Killed] BlockStatement
core/src/adapters/dom.ts:28:78
   if (key === "rotationY") return `rotateY(${String(value)}deg)`;
   return `${key}(${String(value)}px)`;
 }
-function composeTransform(values: Readonly<Record<string, unknown>>): string {
-  const parts: string[] = [];
-  if ("x" in values || "y" in values || "z" in values) {
-    const x = values.x ?? 0;
-    const y = values.y ?? 0;
-    const z = values.z ?? 0;
-    parts.push(`translate3d(${String(x)}px, ${String(y)}px, ${String(z)}px)`);
-  }
-  for (const key of ["rotation", "rotationX", "rotationY", "scale"])
-    if (key in values) parts.push(transformValue(key, values[key]));
-  return parts.join(" ");
-}
+function composeTransform(values: Readonly<Record<string, unknown>>): string {}
 function removeStyleProperty(target: DomTarget, key: string): void {
   if (typeof target.style.removeProperty === "function") target.style.removeProperty(key);
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:30:7
 }
 function composeTransform(values: Readonly<Record<string, unknown>>): string {
   const parts: string[] = [];
-  if ("x" in values || "y" in values || "z" in values) {
+  if (false) {
     const x = values.x ?? 0;
     const y = values.y ?? 0;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'rotate(30deg) scale(2)' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:30:7
 }
 function composeTransform(values: Readonly<Record<string, unknown>>): string {
   const parts: string[] = [];
-  if ("x" in values || "y" in values || "z" in values) {
+  if (false || "z" in values) {
     const x = values.x ?? 0;
     const y = values.y ?? 0;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'rotate(30deg) scale(2)' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] LogicalOperator
core/src/adapters/dom.ts:31:15
 function composeTransform(values: Readonly<Record<string, unknown>>): string {
   const parts: string[] = [];
   if ("x" in values || "y" in values || "z" in values) {
-    const x = values.x ?? 0;
+    const x = values.x && 0;
     const y = values.y ?? 0;
     const z = values.z ?? 0;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(0px, 20px, 0px) rotate(30…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] LogicalOperator
core/src/adapters/dom.ts:32:15
   const parts: string[] = [];
   if ("x" in values || "y" in values || "z" in values) {
     const x = values.x ?? 0;
-    const y = values.y ?? 0;
+    const y = values.y && 0;
     const z = values.z ?? 0;
     parts.push(`translate3d(${String(x)}px, ${String(y)}px, ${String(z)}px)`);
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 0px, 0px) rotate(30…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] LogicalOperator
core/src/adapters/dom.ts:33:15
   if ("x" in values || "y" in values || "z" in values) {
     const x = values.x ?? 0;
     const y = values.y ?? 0;
-    const z = values.z ?? 0;
+    const z = values.z && 0;
     parts.push(`translate3d(${String(x)}px, ${String(y)}px, ${String(z)}px)`);
   }
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, undefinedpx) …' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] StringLiteral
core/src/adapters/dom.ts:36:60
     const z = values.z ?? 0;
     parts.push(`translate3d(${String(x)}px, ${String(y)}px, ${String(z)}px)`);
   }
-  for (const key of ["rotation", "rotationX", "rotationY", "scale"])
+  for (const key of ["rotation", "rotationX", "rotationY", ""])
     if (key in values) parts.push(transformValue(key, values[key]));
   return parts.join(" ");
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px) rotate(3…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Survived] StringLiteral
core/src/adapters/dom.ts:36:47
     const z = values.z ?? 0;
     parts.push(`translate3d(${String(x)}px, ${String(y)}px, ${String(z)}px)`);
   }
-  for (const key of ["rotation", "rotationX", "rotationY", "scale"])
+  for (const key of ["rotation", "rotationX", "", "scale"])
     if (key in values) parts.push(transformValue(key, values[key]));
   return parts.join(" ");

[Killed] ConditionalExpression
core/src/adapters/dom.ts:37:9
     parts.push(`translate3d(${String(x)}px, ${String(y)}px, ${String(z)}px)`);
   }
   for (const key of ["rotation", "rotationX", "rotationY", "scale"])
-    if (key in values) parts.push(transformValue(key, values[key]));
+    if (true) parts.push(transformValue(key, values[key]));
   return parts.join(" ");
 }
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px) rotate(3…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:37:9
     parts.push(`translate3d(${String(x)}px, ${String(y)}px, ${String(z)}px)`);
   }
   for (const key of ["rotation", "rotationX", "rotationY", "scale"])
-    if (key in values) parts.push(transformValue(key, values[key]));
+    if (false) parts.push(transformValue(key, values[key]));
   return parts.join(" ");
 }
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px)' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] StringLiteral
core/src/adapters/dom.ts:38:21
   }
   for (const key of ["rotation", "rotationX", "rotationY", "scale"])
     if (key in values) parts.push(transformValue(key, values[key]));
-  return parts.join(" ");
+  return parts.join("");
 }
 function removeStyleProperty(target: DomTarget, key: string): void {
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected 'translate3d(10px, 20px, 0px)rotate(30…' to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] BlockStatement
core/src/adapters/dom.ts:40:68
     if (key in values) parts.push(transformValue(key, values[key]));
   return parts.join(" ");
 }
-function removeStyleProperty(target: DomTarget, key: string): void {
-  if (typeof target.style.removeProperty === "function") target.style.removeProperty(key);
-  else target.style[key] = undefined;
-}
+function removeStyleProperty(target: DomTarget, key: string): void {}
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
   const state = transformState.get(target) ?? {};
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [] to deeply equal [ 'opacity' ]

[Killed] ConditionalExpression
core/src/adapters/dom.ts:41:7
   return parts.join(" ");
 }
 function removeStyleProperty(target: DomTarget, key: string): void {
-  if (typeof target.style.removeProperty === "function") target.style.removeProperty(key);
+  if (false) target.style.removeProperty(key);
   else target.style[key] = undefined;
 }
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [] to deeply equal [ 'opacity' ]

[Killed] EqualityOperator
core/src/adapters/dom.ts:41:7
   return parts.join(" ");
 }
 function removeStyleProperty(target: DomTarget, key: string): void {
-  if (typeof target.style.removeProperty === "function") target.style.removeProperty(key);
+  if (typeof target.style.removeProperty !== "function") target.style.removeProperty(key);
   else target.style[key] = undefined;
 }
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [] to deeply equal [ 'opacity' ]

[Killed] BlockStatement
core/src/adapters/dom.ts:44:92
   if (typeof target.style.removeProperty === "function") target.style.removeProperty(key);
   else target.style[key] = undefined;
 }
-function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
-  const state = transformState.get(target) ?? {};
-  const hadTransform = Object.keys(state).length > 0;
-  for (const [key, value] of Object.entries(values)) {
-    if (transformKeys.has(key)) {
-      if (value === undefined) delete state[key];
-      else state[key] = value;
-      continue;
-    }
-    if (value === undefined) removeStyleProperty(target, key);
-    else if (key in target.style || key.startsWith("--")) target.style[key] = value;
-    else target[key] = value;
-  }
-  if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
-  else if (hadTransform) removeStyleProperty(target, "transform");
-  transformState.set(target, state);
-}
+function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {}
 function renderableValues(
   values: Readonly<Record<string, unknown>>,
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] LogicalOperator
core/src/adapters/dom.ts:45:17
   else target.style[key] = undefined;
 }
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
-  const state = transformState.get(target) ?? {};
+  const state = transformState.get(target) && {};
   const hadTransform = Object.keys(state).length > 0;
   for (const [key, value] of Object.entries(values)) {
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
core/src/adapters/dom.ts:46:24
 }
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
   const state = transformState.get(target) ?? {};
-  const hadTransform = Object.keys(state).length > 0;
+  const hadTransform = true;
   for (const [key, value] of Object.entries(values)) {
     if (transformKeys.has(key)) {
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [ 'transform', 'opacity', 'transform' ] to deeply equal [ 'opacity' ]

[Killed] EqualityOperator
core/src/adapters/dom.ts:46:24
 }
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
   const state = transformState.get(target) ?? {};
-  const hadTransform = Object.keys(state).length > 0;
+  const hadTransform = Object.keys(state).length <= 0;
   for (const [key, value] of Object.entries(values)) {
     if (transformKeys.has(key)) {
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [ 'transform', 'opacity', 'transform' ] to deeply equal [ 'opacity' ]

[Killed] BlockStatement
core/src/adapters/dom.ts:47:54
 function defaultWriter(target: DomTarget, values: Readonly<Record<string, unknown>>): void {
   const state = transformState.get(target) ?? {};
   const hadTransform = Object.keys(state).length > 0;
-  for (const [key, value] of Object.entries(values)) {
-    if (transformKeys.has(key)) {
-      if (value === undefined) delete state[key];
-      else state[key] = value;
-      continue;
-    }
-    if (value === undefined) removeStyleProperty(target, key);
-    else if (key in target.style || key.startsWith("--")) target.style[key] = value;
-    else target[key] = value;
-  }
+  for (const [key, value] of Object.entries(values)) {}
   if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
   else if (hadTransform) removeStyleProperty(target, "transform");
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:48:9
   const state = transformState.get(target) ?? {};
   const hadTransform = Object.keys(state).length > 0;
   for (const [key, value] of Object.entries(values)) {
-    if (transformKeys.has(key)) {
+    if (true) {
       if (value === undefined) delete state[key];
       else state[key] = value;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ConditionalExpression
core/src/adapters/dom.ts:48:9
   const state = transformState.get(target) ?? {};
   const hadTransform = Object.keys(state).length > 0;
   for (const [key, value] of Object.entries(values)) {
-    if (transformKeys.has(key)) {
+    if (false) {
       if (value === undefined) delete state[key];
       else state[key] = value;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:49:11
   const hadTransform = Object.keys(state).length > 0;
   for (const [key, value] of Object.entries(values)) {
     if (transformKeys.has(key)) {
-      if (value === undefined) delete state[key];
+      if (true) delete state[key];
       else state[key] = value;
       continue;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] EqualityOperator
core/src/adapters/dom.ts:49:11
   const hadTransform = Object.keys(state).length > 0;
   for (const [key, value] of Object.entries(values)) {
     if (transformKeys.has(key)) {
-      if (value === undefined) delete state[key];
+      if (value !== undefined) delete state[key];
       else state[key] = value;
       continue;
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:53:9
       else state[key] = value;
       continue;
     }
-    if (value === undefined) removeStyleProperty(target, key);
+    if (true) removeStyleProperty(target, key);
     else if (key in target.style || key.startsWith("--")) target.style[key] = value;
     else target[key] = value;
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [ 'opacity', 'opacity' ] to deeply equal [ 'opacity' ]

[Killed] ConditionalExpression
core/src/adapters/dom.ts:53:9
       else state[key] = value;
       continue;
     }
-    if (value === undefined) removeStyleProperty(target, key);
+    if (false) removeStyleProperty(target, key);
     else if (key in target.style || key.startsWith("--")) target.style[key] = value;
     else target[key] = value;
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [] to deeply equal [ 'opacity' ]

[Killed] LogicalOperator
core/src/adapters/dom.ts:54:14
       continue;
     }
     if (value === undefined) removeStyleProperty(target, key);
-    else if (key in target.style || key.startsWith("--")) target.style[key] = value;
+    else if (key in target.style && key.startsWith("--")) target.style[key] = value;
     else target[key] = value;
   }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ConditionalExpression
core/src/adapters/dom.ts:54:14
       continue;
     }
     if (value === undefined) removeStyleProperty(target, key);
-    else if (key in target.style || key.startsWith("--")) target.style[key] = value;
+    else if (false) target.style[key] = value;
     else target[key] = value;
   }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] EqualityOperator
core/src/adapters/dom.ts:57:7
     else if (key in target.style || key.startsWith("--")) target.style[key] = value;
     else target[key] = value;
   }
-  if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
+  if (Object.keys(state).length <= 0) target.style.transform = composeTransform(state);
   else if (hadTransform) removeStyleProperty(target, "transform");
   transformState.set(target, state);
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:57:7
     else if (key in target.style || key.startsWith("--")) target.style[key] = value;
     else target[key] = value;
   }
-  if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
+  if (false) target.style.transform = composeTransform(state);
   else if (hadTransform) removeStyleProperty(target, "transform");
   transformState.set(target, state);
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:58:12
     else target[key] = value;
   }
   if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
-  else if (hadTransform) removeStyleProperty(target, "transform");
+  else if (true) removeStyleProperty(target, "transform");
   transformState.set(target, state);
 }
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [ 'transform', 'opacity', 'transform' ] to deeply equal [ 'opacity' ]

[Survived] ConditionalExpression
core/src/adapters/dom.ts:58:12
     else target[key] = value;
   }
   if (Object.keys(state).length > 0) target.style.transform = composeTransform(state);
-  else if (hadTransform) removeStyleProperty(target, "transform");
+  else if (false) removeStyleProperty(target, "transform");
   transformState.set(target, state);
 }

[Killed] BlockStatement
core/src/adapters/dom.ts:64:28
 function renderableValues(
   values: Readonly<Record<string, unknown>>,
   metadata?: ResolvedPlugins,
-): Record<string, unknown> {
-  const result: Record<string, unknown> = {};
-  const internalKeys = metadata?.internalKeys ?? [];
-  const outputSerializers = metadata?.outputSerializers ?? {};
-  for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset" || internalKeys.includes(key)) continue;
-    const serializer = outputSerializers[key];
-    result[key] = serializer ? serializer(value) : value;
-  }
-  return result;
-}
+): Record<string, unknown> {}
 export function createDomPatchAdapter(
   stage: StageLike,
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
core/src/adapters/dom.ts:66:24
   metadata?: ResolvedPlugins,
 ): Record<string, unknown> {
   const result: Record<string, unknown> = {};
-  const internalKeys = metadata?.internalKeys ?? [];
+  const internalKeys = metadata?.internalKeys && [];
   const outputSerializers = metadata?.outputSerializers ?? {};
   for (const [key, value] of Object.entries(values)) {
killedBy: DOM plugin metadata (X-2) uses resolved internal-key metadata instead of hardcoding underscore filtering
statusReason: expected [ { x: 10, secret: 'do-not-render' } ] to deeply equal [ { x: 10 } ]

[Killed] OptionalChaining
core/src/adapters/dom.ts:66:24
   metadata?: ResolvedPlugins,
 ): Record<string, unknown> {
   const result: Record<string, unknown> = {};
-  const internalKeys = metadata?.internalKeys ?? [];
+  const internalKeys = metadata.internalKeys ?? [];
   const outputSerializers = metadata?.outputSerializers ?? {};
   for (const [key, value] of Object.entries(values)) {
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: Cannot read properties of undefined (reading 'internalKeys')

[Killed] LogicalOperator
core/src/adapters/dom.ts:67:29
 ): Record<string, unknown> {
   const result: Record<string, unknown> = {};
   const internalKeys = metadata?.internalKeys ?? [];
-  const outputSerializers = metadata?.outputSerializers ?? {};
+  const outputSerializers = metadata?.outputSerializers && {};
   for (const [key, value] of Object.entries(values)) {
     if (key.startsWith("_") || key === "offset" || internalKeys.includes(key)) continue;
killedBy: DOM plugin metadata (X-2) serializes plugin-owned outputs before writing to the DOM
statusReason: expected [ { transform: { x: 10, y: 20 } } ] to deeply equal [ Array(1) ]
