[Killed] OptionalChaining
core/src/adapters/dom.ts:67:29
 ): Record<string, unknown> {
   const result: Record<string, unknown> = {};
   const internalKeys = metadata?.internalKeys ?? [];
-  const outputSerializers = metadata?.outputSerializers ?? {};
+  const outputSerializers = metadata.outputSerializers ?? {};
   for (const [key, value] of Object.entries(values)) {
     if (key.startsWith("_") || key === "offset" || internalKeys.includes(key)) continue;
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: Cannot read properties of undefined (reading 'outputSerializers')

[Killed] BlockStatement
core/src/adapters/dom.ts:68:54
   const result: Record<string, unknown> = {};
   const internalKeys = metadata?.internalKeys ?? [];
   const outputSerializers = metadata?.outputSerializers ?? {};
-  for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset" || internalKeys.includes(key)) continue;
-    const serializer = outputSerializers[key];
-    result[key] = serializer ? serializer(value) : value;
-  }
+  for (const [key, value] of Object.entries(values)) {}
   return result;
 }
killedBy: DOM transform and removal contract (P0-4) writes motion transform keys into style.transform
statusReason: expected undefined to be 'translate3d(10px, 20px, 0px) rotate(3…' // Object.is equality

[Killed] ConditionalExpression
core/src/adapters/dom.ts:69:9
   const internalKeys = metadata?.internalKeys ?? [];
   const outputSerializers = metadata?.outputSerializers ?? {};
   for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset" || internalKeys.includes(key)) continue;
+    if (false || internalKeys.includes(key)) continue;
     const serializer = outputSerializers[key];
     result[key] = serializer ? serializer(value) : value;
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [ { target: { style: {} }, …(1) } ] to deeply equal [ { target: { style: {} }, …(1) } ]

[Killed] ConditionalExpression
core/src/adapters/dom.ts:69:9
   const internalKeys = metadata?.internalKeys ?? [];
   const outputSerializers = metadata?.outputSerializers ?? {};
   for (const [key, value] of Object.entries(values)) {
-    if (key.startsWith("_") || key === "offset" || internalKeys.includes(key)) continue;
+    if (false) continue;
     const serializer = outputSerializers[key];
     result[key] = serializer ? serializer(value) : value;
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected [ { target: { style: {} }, …(1) } ] to deeply equal [ { target: { style: {} }, …(1) } ]

[Killed] ObjectLiteral
core/src/adapters/dom.ts:85:10
   if (perspective !== undefined && Number.isFinite(perspective) && perspective > 0)
     stage.style.perspective = `${perspective}px`;
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
-  return {
-    apply(patch) {
-      if (patch.status !== "ready") return;
-      const target = resolveTarget(patch.nodeId);
-      if (target === undefined) return;
-      const next = renderableValues(patch.values, metadata);
-      const previous = lastApplied.get(target) ?? {};
-      const dirty: Record<string, unknown> = {};
-      for (const [key, value] of Object.entries(next))
-        if (!Object.is(previous[key], value)) dirty[key] = value;
-      for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
-      if (Object.keys(dirty).length === 0) return;
-      write(target, dirty);
-      lastApplied.set(target, next);
-    },
-    clear(target) {
-      if (target === undefined) return;
-      lastApplied.delete(target);
-      transformState.delete(target);
-    },
-  };
+  return {};
 }
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: dom.apply is not a function

[Killed] BlockStatement
core/src/adapters/dom.ts:86:18
     stage.style.perspective = `${perspective}px`;
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
   return {
-    apply(patch) {
-      if (patch.status !== "ready") return;
-      const target = resolveTarget(patch.nodeId);
-      if (target === undefined) return;
-      const next = renderableValues(patch.values, metadata);
-      const previous = lastApplied.get(target) ?? {};
-      const dirty: Record<string, unknown> = {};
-      for (const [key, value] of Object.entries(next))
-        if (!Object.is(previous[key], value)) dirty[key] = value;
-      for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
-      if (Object.keys(dirty).length === 0) return;
-      write(target, dirty);
-      lastApplied.set(target, next);
-    },
+    apply(patch) {},
     clear(target) {
       if (target === undefined) return;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ConditionalExpression
core/src/adapters/dom.ts:87:11
   const lastApplied = new WeakMap<object, Record<string, unknown>>();
   return {
     apply(patch) {
-      if (patch.status !== "ready") return;
+      if (false) return;
       const target = resolveTarget(patch.nodeId);
       if (target === undefined) return;
killedBy: adapter ports applies perspective once and never applies blocked patches
statusReason: expected 1 to be undefined

[Killed] LogicalOperator
core/src/adapters/dom.ts:91:24
       const target = resolveTarget(patch.nodeId);
       if (target === undefined) return;
       const next = renderableValues(patch.values, metadata);
-      const previous = lastApplied.get(target) ?? {};
+      const previous = lastApplied.get(target) && {};
       const dirty: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(next))
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Cannot read properties of undefined (reading 'opacity')

[Killed] ConditionalExpression
core/src/adapters/dom.ts:95:52
       const dirty: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(next))
         if (!Object.is(previous[key], value)) dirty[key] = value;
-      for (const key of Object.keys(previous)) if (!(key in next)) dirty[key] = undefined;
+      for (const key of Object.keys(previous)) if (false) dirty[key] = undefined;
       if (Object.keys(dirty).length === 0) return;
       write(target, dirty);
killedBy: DOM transform and removal contract (P0-4) removes omitted CSS properties instead of assigning undefined
statusReason: expected [] to deeply equal [ 'opacity' ]

[Killed] BlockStatement
core/src/adapters/dom.ts:100:19
       write(target, dirty);
       lastApplied.set(target, next);
     },
-    clear(target) {
-      if (target === undefined) return;
-      lastApplied.delete(target);
-      transformState.delete(target);
-    },
+    clear(target) {},
   };
 }
killedBy: DOM patch adapter contract (C3) resolves each node, filters internal values, diffs writes, removes omitted keys, and clears cache
statusReason: expected undefined to deeply equal { target: { style: {} }, …(1) }
