[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:20:69
 export interface GsapLike {
   timeline(vars?: Record<string, unknown>): GsapTimelineLike;
 }
-function isRecord(value: unknown): value is Record<string, unknown> {
-  return value !== null && typeof value === "object" && !Array.isArray(value);
-}
+function isRecord(value: unknown): value is Record<string, unknown> {}
 function readDuration(config: unknown): number {
   if (!isRecord(config)) return 1;
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:21:10
   timeline(vars?: Record<string, unknown>): GsapTimelineLike;
 }
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return value !== null && typeof value === "object" && !Array.isArray(value);
+  return true;
 }
 function readDuration(config: unknown): number {
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: Cannot use 'in' operator to search for 'ease' in undefined

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:21:10
   timeline(vars?: Record<string, unknown>): GsapTimelineLike;
 }
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return value !== null && typeof value === "object" && !Array.isArray(value);
+  return true && !Array.isArray(value);
 }
 function readDuration(config: unknown): number {
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: Cannot use 'in' operator to search for 'ease' in undefined

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:23:48
 function isRecord(value: unknown): value is Record<string, unknown> {
   return value !== null && typeof value === "object" && !Array.isArray(value);
 }
-function readDuration(config: unknown): number {
-  if (!isRecord(config)) return 1;
-  const duration = config.duration;
-  return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
-}
+function readDuration(config: unknown): number {}
 function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {
   return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected undefined to be close to 1, received difference is NaN, but expected 5e-11

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:24:7
   return value !== null && typeof value === "object" && !Array.isArray(value);
 }
 function readDuration(config: unknown): number {
-  if (!isRecord(config)) return 1;
+  if (isRecord(config)) return 1;
   const duration = config.duration;
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
killedBy: GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
statusReason: expected 1 to be close to 2, received difference is 1, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:24:7
   return value !== null && typeof value === "object" && !Array.isArray(value);
 }
 function readDuration(config: unknown): number {
-  if (!isRecord(config)) return 1;
+  if (true) return 1;
   const duration = config.duration;
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
killedBy: GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
statusReason: expected 1 to be close to 2, received difference is 1, but expected 5e-11

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:26:10
 function readDuration(config: unknown): number {
   if (!isRecord(config)) return 1;
   const duration = config.duration;
-  return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+  return typeof duration !== "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
 }
 function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {
killedBy: GSAP authored-duration pinning (P0-3b) scales the shared tween by the configured track duration
statusReason: expected 1 to be close to 2, received difference is 1, but expected 5e-11

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:26:10
 function readDuration(config: unknown): number {
   if (!isRecord(config)) return 1;
   const duration = config.duration;
-  return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
+  return true ? duration : 1;
 }
 function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected 1 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:28:76
   const duration = config.duration;
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
 }
-function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {
-  return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
-}
+function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {}
 function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {
   return !isRecord(config) || !isRecord(config.tweenVars) ? {} : config.tweenVars;
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:29:10
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
 }
 function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {
-  return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
+  return false ? config.keyframes : {};
 }
 function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Survived] ConditionalExpression
src/adapters/interpolator/gsap.ts:29:10
   return typeof duration === "number" && Number.isFinite(duration) && duration >= 0 ? duration : 1;
 }
 function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {
-  return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
+  return true ? config.keyframes : {};
 }
 function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:31:76
 function readKeyframes(config: unknown): Readonly<Record<string, unknown>> {
   return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
 }
-function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {
-  return !isRecord(config) || !isRecord(config.tweenVars) ? {} : config.tweenVars;
-}
+function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {}
 function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
   return diagnostics
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Cannot use 'in' operator to search for 'ease' in undefined

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:32:10
   return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
 }
 function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {
-  return !isRecord(config) || !isRecord(config.tweenVars) ? {} : config.tweenVars;
+  return false ? {} : config.tweenVars;
 }
 function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: Cannot use 'in' operator to search for 'ease' in undefined

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:32:10
   return isRecord(config) && isRecord(config.keyframes) ? config.keyframes : {};
 }
 function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {
-  return !isRecord(config) || !isRecord(config.tweenVars) ? {} : config.tweenVars;
+  return isRecord(config) || !isRecord(config.tweenVars) ? {} : config.tweenVars;
 }
 function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
killedBy: GSAP absolute multi-property stops (P0-3) uses tweenVars ease when a stop does not override it
statusReason: expected 50 to be close to 25, received difference is 25, but expected 0.0005

[NoCoverage] BlockStatement
src/adapters/interpolator/gsap.ts:34:74
 function readTweenVars(config: unknown): Readonly<Record<string, unknown>> {
   return !isRecord(config) || !isRecord(config.tweenVars) ? {} : config.tweenVars;
 }
-function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
-  return diagnostics
-    .map(({ ruleId, path, message }) => `${ruleId} at ${path}: ${message}`)
-    .join(" ");
-}
+function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {}
 export class KeyframeCompilationError extends TypeError {
   readonly diagnostics: readonly Diagnostic[];

[NoCoverage] ArrowFunction
src/adapters/interpolator/gsap.ts:36:10
 }
 function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
   return diagnostics
-    .map(({ ruleId, path, message }) => `${ruleId} at ${path}: ${message}`)
+    .map(() => undefined)
     .join(" ");
 }

[NoCoverage] StringLiteral
src/adapters/interpolator/gsap.ts:37:11
 function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
   return diagnostics
     .map(({ ruleId, path, message }) => `${ruleId} at ${path}: ${message}`)
-    .join(" ");
+    .join("");
 }
 export class KeyframeCompilationError extends TypeError {

[NoCoverage] BlockStatement
src/adapters/interpolator/gsap.ts:41:51
 }
 export class KeyframeCompilationError extends TypeError {
   readonly diagnostics: readonly Diagnostic[];
-  constructor(diagnostics: readonly Diagnostic[]) {
-    super(describeDiagnostics(diagnostics));
-    this.name = "keyframe-compilation";
-    this.diagnostics = diagnostics;
-  }
+  constructor(diagnostics: readonly Diagnostic[]) {}
 }
 

[NoCoverage] StringLiteral
src/adapters/interpolator/gsap.ts:43:17
   readonly diagnostics: readonly Diagnostic[];
   constructor(diagnostics: readonly Diagnostic[]) {
     super(describeDiagnostics(diagnostics));
-    this.name = "keyframe-compilation";
+    this.name = "";
     this.diagnostics = diagnostics;
   }

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:52:11
   return {
     create(config): InterpolationTimeline {
       const compiled = compilePercentKeyframes(readKeyframes(config));
-      if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+      if (true)
         throw new KeyframeCompilationError(compiled.diagnostics);
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter

[Killed] MethodExpression
src/adapters/interpolator/gsap.ts:52:11
   return {
     create(config): InterpolationTimeline {
       const compiled = compilePercentKeyframes(readKeyframes(config));
-      if (compiled.diagnostics.some(({ severity }) => severity === "error"))
+      if (compiled.diagnostics.every(({
+  severity
+}) => severity === "error"))
         throw new KeyframeCompilationError(compiled.diagnostics);
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:58:48
       const proxy: Record<string, unknown> = { ...compiled.initial };
       const duration = readDuration(config);
       const tweenVars = readTweenVars(config);
-      const timeline = gsap.timeline({ paused: true });
+      const timeline = gsap.timeline({ paused: false });
 
       for (const { key, stops } of compiled.properties) {
killedBy: GSAP absolute multi-property stops (P0-3) uses one shared paused timeline with independent absolute grids
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:60:57
       const tweenVars = readTweenVars(config);
       const timeline = gsap.timeline({ paused: true });
 
-      for (const { key, stops } of compiled.properties) {
-        for (let index = 1; index < stops.length; index += 1) {
-          const previous = stops[index - 1];
-          const next = stops[index];
-          if (!previous || !next) continue;
-          const vars: Record<string, unknown> = {
-            ...tweenVars,
-            [key]: next.v,
-            duration: (next.p - previous.p) * duration,
-          };
-          if (next.ease !== undefined) vars.ease = next.ease;
-          else if (!("ease" in tweenVars)) vars.ease = "none";
-          timeline.to(proxy, vars, previous.p * duration);
-        }
-      }
+      for (const { key, stops } of compiled.properties) {}
       if (duration > 0) timeline.to(proxy, { duration: 0 }, duration);
 
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:61:29
       const timeline = gsap.timeline({ paused: true });
 
       for (const { key, stops } of compiled.properties) {
-        for (let index = 1; index < stops.length; index += 1) {
+        for (let index = 1; index >= stops.length; index += 1) {
           const previous = stops[index - 1];
           const next = stops[index];
killedBy: GSAP absolute multi-property stops (P0-3) uses one shared paused timeline with independent absolute grids
statusReason: expected +0 to be close to 20, received difference is 20, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:61:29
       const timeline = gsap.timeline({ paused: true });
 
       for (const { key, stops } of compiled.properties) {
-        for (let index = 1; index < stops.length; index += 1) {
+        for (let index = 1; false; index += 1) {
           const previous = stops[index - 1];
           const next = stops[index];
killedBy: GSAP absolute multi-property stops (P0-3) uses one shared paused timeline with independent absolute grids
statusReason: expected +0 to be close to 20, received difference is 20, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:64:15
         for (let index = 1; index < stops.length; index += 1) {
           const previous = stops[index - 1];
           const next = stops[index];
-          if (!previous || !next) continue;
+          if (true) continue;
           const vars: Record<string, unknown> = {
             ...tweenVars,
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:64:15
         for (let index = 1; index < stops.length; index += 1) {
           const previous = stops[index - 1];
           const next = stops[index];
-          if (!previous || !next) continue;
+          if (previous || !next) continue;
           const vars: Record<string, unknown> = {
             ...tweenVars,
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ObjectLiteral
src/adapters/interpolator/gsap.ts:65:49
           const previous = stops[index - 1];
           const next = stops[index];
           if (!previous || !next) continue;
-          const vars: Record<string, unknown> = {
-            ...tweenVars,
-            [key]: next.v,
-            duration: (next.p - previous.p) * duration,
-          };
+          const vars: Record<string, unknown> = {};
           if (next.ease !== undefined) vars.ease = next.ease;
           else if (!("ease" in tweenVars)) vars.ease = "none";
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] ArithmeticOperator
src/adapters/interpolator/gsap.ts:68:24
           const vars: Record<string, unknown> = {
             ...tweenVars,
             [key]: next.v,
-            duration: (next.p - previous.p) * duration,
+            duration: (next.p + previous.p) * duration,
           };
           if (next.ease !== undefined) vars.ease = next.ease;
killedBy: GSAP absolute multi-property stops (P0-3) uses one shared paused timeline with independent absolute grids
statusReason: expected 40 to be close to 20, received difference is 20, but expected 5e-7

[Killed] ArithmeticOperator
src/adapters/interpolator/gsap.ts:68:23
           const vars: Record<string, unknown> = {
             ...tweenVars,
             [key]: next.v,
-            duration: (next.p - previous.p) * duration,
+            duration: (next.p - previous.p) / duration,
           };
           if (next.ease !== undefined) vars.ease = next.ease;
killedBy: adapter ports compiles authored stops onto an adapter-owned proxy state
statusReason: expected { x: 100, …(1) } to match object { x: 50 }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:70:15
             [key]: next.v,
             duration: (next.p - previous.p) * duration,
           };
-          if (next.ease !== undefined) vars.ease = next.ease;
+          if (false) vars.ease = next.ease;
           else if (!("ease" in tweenVars)) vars.ease = "none";
           timeline.to(proxy, vars, previous.p * duration);
killedBy: GSAP absolute multi-property stops (P0-3) preserves authored easing without resampling a linear sibling
statusReason: expected 50 to be close to 87.5, received difference is 37.5, but expected 0.0005

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:70:15
             [key]: next.v,
             duration: (next.p - previous.p) * duration,
           };
-          if (next.ease !== undefined) vars.ease = next.ease;
+          if (next.ease === undefined) vars.ease = next.ease;
           else if (!("ease" in tweenVars)) vars.ease = "none";
           timeline.to(proxy, vars, previous.p * duration);
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected 0.75 to be close to 0.5, received difference is 0.25, but expected 5e-11

[Killed] BooleanLiteral
src/adapters/interpolator/gsap.ts:71:20
             duration: (next.p - previous.p) * duration,
           };
           if (next.ease !== undefined) vars.ease = next.ease;
-          else if (!("ease" in tweenVars)) vars.ease = "none";
+          else if ("ease" in tweenVars) vars.ease = "none";
           timeline.to(proxy, vars, previous.p * duration);
         }
killedBy: GSAP absolute multi-property stops (P0-3) uses one shared paused timeline with independent absolute grids
statusReason: expected 32 to be close to 20, received difference is 12, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:71:20
             duration: (next.p - previous.p) * duration,
           };
           if (next.ease !== undefined) vars.ease = next.ease;
-          else if (!("ease" in tweenVars)) vars.ease = "none";
+          else if (true) vars.ease = "none";
           timeline.to(proxy, vars, previous.p * duration);
         }
killedBy: GSAP absolute multi-property stops (P0-3) uses tweenVars ease when a stop does not override it
statusReason: expected 50 to be close to 25, received difference is 25, but expected 0.0005

[Survived] ArithmeticOperator
src/adapters/interpolator/gsap.ts:72:36
           };
           if (next.ease !== undefined) vars.ease = next.ease;
           else if (!("ease" in tweenVars)) vars.ease = "none";
-          timeline.to(proxy, vars, previous.p * duration);
+          timeline.to(proxy, vars, previous.p / duration);
         }
       }

[Killed] EqualityOperator
src/adapters/interpolator/gsap.ts:75:11
           timeline.to(proxy, vars, previous.p * duration);
         }
       }
-      if (duration > 0) timeline.to(proxy, { duration: 0 }, duration);
+      if (duration <= 0) timeline.to(proxy, { duration: 0 }, duration);
 
       function progress(): number;
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected 25 to be close to 50, received difference is 25, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:75:11
           timeline.to(proxy, vars, previous.p * duration);
         }
       }
-      if (duration > 0) timeline.to(proxy, { duration: 0 }, duration);
+      if (false) timeline.to(proxy, { duration: 0 }, duration);
 
       function progress(): number;
killedBy: GSAP authored-duration pinning (P0-3b) keeps the authored duration when the last stop ends before the end
statusReason: expected 25 to be close to 50, received difference is 25, but expected 5e-7

[Killed] ConditionalExpression
src/adapters/interpolator/gsap.ts:80:13
       function progress(): number;
       function progress(value: number): void;
       function progress(value?: number): number | void {
-        if (value === undefined) return timeline.progress();
+        if (false) return timeline.progress();
         timeline.progress(value);
       }
killedBy: adapter ports adapts a GSAP-like paused timeline without leaking the engine object
statusReason: expected undefined to be 0.5 // Object.is equality

[Killed] BlockStatement
src/adapters/interpolator/gsap.ts:84:24
         timeline.progress(value);
       }
       return {
-        get duration() {
-          return duration;
-        },
+        get duration() {},
         state: proxy,
         progress,
killedBy: GSAP absolute multi-property stops (P0-3) uses one shared paused timeline with independent absolute grids
statusReason: expected undefined to be close to 1, received difference is NaN, but expected 5e-7
