[Survived] BooleanLiteral
core/src/domain/motion.ts:25:14
   readonly #stagger: number;
   readonly #lifecycle: Lifecycle;
   readonly #scheduled = new Set<{ cancel(): void }>();
-  #playing = false;
+  #playing = true;
   #position = 0;
   #unsubscribe: (() => void) | undefined;

[Killed] BlockStatement
core/src/domain/motion.ts:29:39
   #position = 0;
   #unsubscribe: (() => void) | undefined;
 
-  constructor(options: MotionOptions) {
-    if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
-      throw new TypeError("Motion stagger must be a finite non-negative number.");
-    const ids = new Set<string>();
-    for (const entry of options.tracks) {
-      if (!entry.id || ids.has(entry.id))
-        throw new Error(`Duplicate Motion track id: ${entry.id}.`);
-      if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
-        throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
-      ids.add(entry.id);
-    }
-    this.#clock = options.clock;
-    this.#scheduler = options.scheduler;
-    this.#tracks = Object.freeze([...options.tracks]);
-    this.#stagger = options.stagger ?? 0;
-    this.#lifecycle = new Lifecycle({
-      beforeDispose: () => {
-        this.pause();
-        for (const track of this.#tracks) track.track.dispose();
-      },
-    });
-  }
+  constructor(options: MotionOptions) {}
   get state() {
     return this.#lifecycle.state;
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
core/src/domain/motion.ts:30:51
   #unsubscribe: (() => void) | undefined;
 
   constructor(options: MotionOptions) {
-    if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+    if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) <= 0)
       throw new TypeError("Motion stagger must be a finite non-negative number.");
     const ids = new Set<string>();
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Motion stagger must be a finite non-negative number.

[Killed] EqualityOperator
core/src/domain/motion.ts:30:51
   #unsubscribe: (() => void) | undefined;
 
   constructor(options: MotionOptions) {
-    if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+    if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) >= 0)
       throw new TypeError("Motion stagger must be a finite non-negative number.");
     const ids = new Set<string>();
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Motion stagger must be a finite non-negative number.

[Survived] BlockStatement
core/src/domain/motion.ts:33:41
     if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
       throw new TypeError("Motion stagger must be a finite non-negative number.");
     const ids = new Set<string>();
-    for (const entry of options.tracks) {
-      if (!entry.id || ids.has(entry.id))
-        throw new Error(`Duplicate Motion track id: ${entry.id}.`);
-      if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
-        throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
-      ids.add(entry.id);
-    }
+    for (const entry of options.tracks) {}
     this.#clock = options.clock;
     this.#scheduler = options.scheduler;

[Killed] BooleanLiteral
core/src/domain/motion.ts:34:11
       throw new TypeError("Motion stagger must be a finite non-negative number.");
     const ids = new Set<string>();
     for (const entry of options.tracks) {
-      if (!entry.id || ids.has(entry.id))
+      if (entry.id || ids.has(entry.id))
         throw new Error(`Duplicate Motion track id: ${entry.id}.`);
       if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Duplicate Motion track id: track-0.

[Killed] ConditionalExpression
core/src/domain/motion.ts:34:11
       throw new TypeError("Motion stagger must be a finite non-negative number.");
     const ids = new Set<string>();
     for (const entry of options.tracks) {
-      if (!entry.id || ids.has(entry.id))
+      if (true)
         throw new Error(`Duplicate Motion track id: ${entry.id}.`);
       if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Duplicate Motion track id: track-0.

[Killed] ConditionalExpression
core/src/domain/motion.ts:36:11
     for (const entry of options.tracks) {
       if (!entry.id || ids.has(entry.id))
         throw new Error(`Duplicate Motion track id: ${entry.id}.`);
-      if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+      if (true)
         throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
       ids.add(entry.id);
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Motion track duration must be a finite positive number: track-0.

[Killed] ConditionalExpression
core/src/domain/motion.ts:36:11
     for (const entry of options.tracks) {
       if (!entry.id || ids.has(entry.id))
         throw new Error(`Duplicate Motion track id: ${entry.id}.`);
-      if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+      if (true && (!Number.isFinite(entry.duration) || entry.duration <= 0))
         throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
       ids.add(entry.id);
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Motion track duration must be a finite positive number: track-0.

[Killed] ArrayDeclaration
core/src/domain/motion.ts:42:34
     }
     this.#clock = options.clock;
     this.#scheduler = options.scheduler;
-    this.#tracks = Object.freeze([...options.tracks]);
+    this.#tracks = Object.freeze([]);
     this.#stagger = options.stagger ?? 0;
     this.#lifecycle = new Lifecycle({
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: expected [] to deeply equal [ 'track-0', 'track-1', 'track-2' ]

[Killed] LogicalOperator
core/src/domain/motion.ts:43:21
     this.#clock = options.clock;
     this.#scheduler = options.scheduler;
     this.#tracks = Object.freeze([...options.tracks]);
-    this.#stagger = options.stagger ?? 0;
+    this.#stagger = options.stagger && 0;
     this.#lifecycle = new Lifecycle({
       beforeDispose: () => {
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: expected [ +0, +0, +0 ] to deeply equal [ +0, 0.08, 0.16 ]

[Killed] ObjectLiteral
core/src/domain/motion.ts:44:37
     this.#scheduler = options.scheduler;
     this.#tracks = Object.freeze([...options.tracks]);
     this.#stagger = options.stagger ?? 0;
-    this.#lifecycle = new Lifecycle({
-      beforeDispose: () => {
-        this.pause();
-        for (const track of this.#tracks) track.track.dispose();
-      },
-    });
+    this.#lifecycle = new Lifecycle({});
   }
   get state() {
killedBy: Motion composite pauses and disposes owner-first without leaking clock work
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
core/src/domain/motion.ts:45:28
     this.#tracks = Object.freeze([...options.tracks]);
     this.#stagger = options.stagger ?? 0;
     this.#lifecycle = new Lifecycle({
-      beforeDispose: () => {
-        this.pause();
-        for (const track of this.#tracks) track.track.dispose();
-      },
+      beforeDispose: () => {},
     });
   }
killedBy: Motion composite pauses and disposes owner-first without leaking clock work
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
core/src/domain/motion.ts:51:15
       },
     });
   }
-  get state() {
-    return this.#lifecycle.state;
-  }
+  get state() {}
   get playing() {
     return this.#playing;

[NoCoverage] BlockStatement
core/src/domain/motion.ts:54:17
   get state() {
     return this.#lifecycle.state;
   }
-  get playing() {
-    return this.#playing;
-  }
+  get playing() {}
   get position() {
     return this.#position;

[NoCoverage] BlockStatement
core/src/domain/motion.ts:57:18
   get playing() {
     return this.#playing;
   }
-  get position() {
-    return this.#position;
-  }
+  get position() {}
   get tracks() {
     return this.#tracks;

[Killed] BlockStatement
core/src/domain/motion.ts:60:16
   get position() {
     return this.#position;
   }
-  get tracks() {
-    return this.#tracks;
-  }
+  get tracks() {}
   schedule(): readonly number[] {
     return this.#tracks.map((_, index) => index * this.#stagger);
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
core/src/domain/motion.ts:63:33
   get tracks() {
     return this.#tracks;
   }
-  schedule(): readonly number[] {
-    return this.#tracks.map((_, index) => index * this.#stagger);
-  }
+  schedule(): readonly number[] {}
   mount(): void {
     this.#lifecycle.mount();
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: expected undefined to deeply equal [ +0, 0.08, 0.16 ]

[Killed] ArithmeticOperator
core/src/domain/motion.ts:64:43
     return this.#tracks;
   }
   schedule(): readonly number[] {
-    return this.#tracks.map((_, index) => index * this.#stagger);
+    return this.#tracks.map((_, index) => index / this.#stagger);
   }
   mount(): void {
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: expected [ +0, 12.5, 25 ] to deeply equal [ +0, 0.08, 0.16 ]

[Killed] ArrowFunction
core/src/domain/motion.ts:64:29
     return this.#tracks;
   }
   schedule(): readonly number[] {
-    return this.#tracks.map((_, index) => index * this.#stagger);
+    return this.#tracks.map(() => undefined);
   }
   mount(): void {
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ +0, 0.08, 0.16 ]

[Killed] BlockStatement
core/src/domain/motion.ts:66:17
   schedule(): readonly number[] {
     return this.#tracks.map((_, index) => index * this.#stagger);
   }
-  mount(): void {
-    this.#lifecycle.mount();
-    this.#subscribe();
-  }
+  mount(): void {}
   play(): void {
     this.assertActive();
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
core/src/domain/motion.ts:70:16
     this.#lifecycle.mount();
     this.#subscribe();
   }
-  play(): void {
-    this.assertActive();
-    if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
-    this.#playing = true;
-  }
+  play(): void {}
   pause(): void {
     this.#playing = false;
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
core/src/domain/motion.ts:72:48
   }
   play(): void {
     this.assertActive();
-    if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
+    if (this.#lifecycle.state === "created" || this.#lifecycle.state !== "detached") this.mount();
     this.#playing = true;
   }
killedBy: Motion composite pausing detaches the clock and play resubscribes without duplicate work
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
core/src/domain/motion.ts:72:9
   }
   play(): void {
     this.assertActive();
-    if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
+    if (this.#lifecycle.state !== "created" || this.#lifecycle.state === "detached") this.mount();
     this.#playing = true;
   }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
core/src/domain/motion.ts:73:21
   play(): void {
     this.assertActive();
     if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
-    this.#playing = true;
+    this.#playing = false;
   }
   pause(): void {
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Survived] BlockStatement
core/src/domain/motion.ts:75:17
     if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
     this.#playing = true;
   }
-  pause(): void {
-    this.#playing = false;
-    for (const handle of this.#scheduled) handle.cancel();
-    this.#scheduled.clear();
-    this.#unsubscribe?.();
-    this.#unsubscribe = undefined;
-    this.#lifecycle.detach();
-  }
+  pause(): void {}
   seek(progress: number): void {
     this.assertActive();

[Survived] BooleanLiteral
core/src/domain/motion.ts:76:21
     this.#playing = true;
   }
   pause(): void {
-    this.#playing = false;
+    this.#playing = true;
     for (const handle of this.#scheduled) handle.cancel();
     this.#scheduled.clear();

[Killed] OptionalChaining
core/src/domain/motion.ts:79:5
     this.#playing = false;
     for (const handle of this.#scheduled) handle.cancel();
     this.#scheduled.clear();
-    this.#unsubscribe?.();
+    this.#unsubscribe();
     this.#unsubscribe = undefined;
     this.#lifecycle.detach();
killedBy: Motion composite pauses and disposes owner-first without leaking clock work
statusReason: this[#unsubscribe] is not a function

[Killed] BlockStatement
core/src/domain/motion.ts:83:32
     this.#unsubscribe = undefined;
     this.#lifecycle.detach();
   }
-  seek(progress: number): void {
-    this.assertActive();
-    if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
-    this.#position = Math.max(0, Math.min(1, progress));
-    for (const entry of this.#tracks) entry.track.setProgress(this.#position);
-  }
+  seek(progress: number): void {}
   reflow(): void {
     this.assertActive();
killedBy: Motion composite clamps seek and rejects non-finite values
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
core/src/domain/motion.ts:85:9
   }
   seek(progress: number): void {
     this.assertActive();
-    if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
+    if (false) throw new TypeError("Motion progress must be finite.");
     this.#position = Math.max(0, Math.min(1, progress));
     for (const entry of this.#tracks) entry.track.setProgress(this.#position);
killedBy: Motion composite clamps seek and rejects non-finite values
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
core/src/domain/motion.ts:85:9
   }
   seek(progress: number): void {
     this.assertActive();
-    if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
+    if (Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
     this.#position = Math.max(0, Math.min(1, progress));
     for (const entry of this.#tracks) entry.track.setProgress(this.#position);
killedBy: Motion composite clamps seek and rejects non-finite values
statusReason: Motion progress must be finite.

[Killed] MethodExpression
core/src/domain/motion.ts:86:22
   seek(progress: number): void {
     this.assertActive();
     if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
-    this.#position = Math.max(0, Math.min(1, progress));
+    this.#position = Math.min(0, Math.min(1, progress));
     for (const entry of this.#tracks) entry.track.setProgress(this.#position);
   }
killedBy: Motion composite clamps seek and rejects non-finite values
statusReason: expected +0 to be 1 // Object.is equality

[Survived] MethodExpression
core/src/domain/motion.ts:86:34
   seek(progress: number): void {
     this.assertActive();
     if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
-    this.#position = Math.max(0, Math.min(1, progress));
+    this.#position = Math.max(0, Math.max(1, progress));
     for (const entry of this.#tracks) entry.track.setProgress(this.#position);
   }

[NoCoverage] BlockStatement
core/src/domain/motion.ts:89:18
     this.#position = Math.max(0, Math.min(1, progress));
     for (const entry of this.#tracks) entry.track.setProgress(this.#position);
   }
-  reflow(): void {
-    this.assertActive();
-    this.schedule();
-  }
+  reflow(): void {}
   dispose(): void {
     this.#lifecycle.dispose();

[Killed] BlockStatement
core/src/domain/motion.ts:93:19
     this.assertActive();
     this.schedule();
   }
-  dispose(): void {
-    this.#lifecycle.dispose();
-  }
+  dispose(): void {}
   destroy(): void {
     this.#lifecycle.destroy();
killedBy: Motion composite pauses and disposes owner-first without leaking clock work
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
core/src/domain/motion.ts:96:19
   dispose(): void {
     this.#lifecycle.dispose();
   }
-  destroy(): void {
-    this.#lifecycle.destroy();
-  }
+  destroy(): void {}
   #subscribe(): void {
     if (this.#unsubscribe === undefined)

[Killed] BlockStatement
core/src/domain/motion.ts:99:22
   destroy(): void {
     this.#lifecycle.destroy();
   }
-  #subscribe(): void {
-    if (this.#unsubscribe === undefined)
-      this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
-  }
+  #subscribe(): void {}
   #onTick(event: ClockTick): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
core/src/domain/motion.ts:100:9
     this.#lifecycle.destroy();
   }
   #subscribe(): void {
-    if (this.#unsubscribe === undefined)
+    if (this.#unsubscribe !== undefined)
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
core/src/domain/motion.ts:100:9
     this.#lifecycle.destroy();
   }
   #subscribe(): void {
-    if (this.#unsubscribe === undefined)
+    if (false)
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
core/src/domain/motion.ts:101:49
   }
   #subscribe(): void {
     if (this.#unsubscribe === undefined)
-      this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
+      this.#unsubscribe = this.#clock.subscribe(() => undefined);
   }
   #onTick(event: ClockTick): void {
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
core/src/domain/motion.ts:103:35
     if (this.#unsubscribe === undefined)
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
-  #onTick(event: ClockTick): void {
-    if (!this.#playing || this.#lifecycle.state !== "mounted") return;
-    const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
-    this.#position = next;
-    const handle = this.#scheduler.schedule(() => {
-      for (const entry of this.#tracks) entry.track.setProgress(next);
-    });
-    this.#scheduled.add(handle);
-  }
+  #onTick(event: ClockTick): void {}
   #progressDelta(delta: number): number {
     const duration = this.#tracks.reduce(
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
core/src/domain/motion.ts:104:27
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
   #onTick(event: ClockTick): void {
-    if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+    if (!this.#playing || this.#lifecycle.state === "mounted") return;
     const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
     this.#position = next;
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
core/src/domain/motion.ts:104:9
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
   #onTick(event: ClockTick): void {
-    if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+    if (this.#playing || this.#lifecycle.state !== "mounted") return;
     const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
     this.#position = next;
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
core/src/domain/motion.ts:105:18
   }
   #onTick(event: ClockTick): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
-    const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
+    const next = Math.max(1, this.#position + this.#progressDelta(event.delta));
     this.#position = next;
     const handle = this.#scheduler.schedule(() => {
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected 1 to be 0.25 // Object.is equality

[Killed] ArithmeticOperator
core/src/domain/motion.ts:105:30
   }
   #onTick(event: ClockTick): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
-    const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
+    const next = Math.min(1, this.#position - this.#progressDelta(event.delta));
     this.#position = next;
     const handle = this.#scheduler.schedule(() => {
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected +0 to be 0.25 // Object.is equality

[Killed] BlockStatement
core/src/domain/motion.ts:107:51
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
     const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
     this.#position = next;
-    const handle = this.#scheduler.schedule(() => {
-      for (const entry of this.#tracks) entry.track.setProgress(next);
-    });
+    const handle = this.#scheduler.schedule(() => {});
     this.#scheduled.add(handle);
   }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected +0 to be 0.25 // Object.is equality

[Killed] BlockStatement
core/src/domain/motion.ts:112:41
     });
     this.#scheduled.add(handle);
   }
-  #progressDelta(delta: number): number {
-    const duration = this.#tracks.reduce(
-      (maximum, entry) => Math.max(maximum, entry.duration ?? 1),
-      1,
-    );
-    return delta / duration;
-  }
+  #progressDelta(delta: number): number {}
   private assertActive(): void {
     if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Track progress must be finite.

[Killed] ArrowFunction
core/src/domain/motion.ts:114:7
   }
   #progressDelta(delta: number): number {
     const duration = this.#tracks.reduce(
-      (maximum, entry) => Math.max(maximum, entry.duration ?? 1),
+      () => undefined,
       1,
     );
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Track progress must be finite.

[Killed] LogicalOperator
core/src/domain/motion.ts:114:45
   }
   #progressDelta(delta: number): number {
     const duration = this.#tracks.reduce(
-      (maximum, entry) => Math.max(maximum, entry.duration ?? 1),
+      (maximum, entry) => Math.max(maximum, entry.duration && 1),
       1,
     );
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Track progress must be finite.

[Killed] ArithmeticOperator
core/src/domain/motion.ts:117:12
       (maximum, entry) => Math.max(maximum, entry.duration ?? 1),
       1,
     );
-    return delta / duration;
+    return delta * duration;
   }
   private assertActive(): void {
killedBy: Motion composite converts clock time into normalized progress using authored duration
statusReason: expected 1 to be 0.25 // Object.is equality

[Survived] BlockStatement
core/src/domain/motion.ts:119:32
     );
     return delta / duration;
   }
-  private assertActive(): void {
-    if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
-  }
+  private assertActive(): void {}
 }
 

[Killed] ConditionalExpression
core/src/domain/motion.ts:120:9
     return delta / duration;
   }
   private assertActive(): void {
-    if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
+    if (true) throw new Error("Motion is destroyed.");
   }
 }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Motion is destroyed.

[Killed] EqualityOperator
core/src/domain/motion.ts:120:9
     return delta / duration;
   }
   private assertActive(): void {
-    if (this.#lifecycle.state === "destroyed") throw new Error("Motion is destroyed.");
+    if (this.#lifecycle.state !== "destroyed") throw new Error("Motion is destroyed.");
   }
 }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Motion is destroyed.
