[Killed] BlockStatement
core/src/domain/track.ts:22:69
     this.name = this.ruleId;
   }
 }
-function isRecord(value: unknown): value is Record<string, unknown> {
-  if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
-  const prototype = Object.getPrototypeOf(value);
-  return prototype === Object.prototype || prototype === null;
-}
+function isRecord(value: unknown): value is Record<string, unknown> {}
 function preparedConfig(config: unknown, plugins: ResolvedPlugins): unknown {
   if (!isRecord(config)) return config;
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: expected "create" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st create call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
core/src/domain/track.ts:23:83
   }
 }
 function isRecord(value: unknown): value is Record<string, unknown> {
-  if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+  if (value === null || typeof value !== "object" || Array.isArray(value)) return true;
   const prototype = Object.getPrototypeOf(value);
   return prototype === Object.prototype || prototype === null;
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Cannot read properties of undefined (reading 'keyframes')

[Killed] EqualityOperator
core/src/domain/track.ts:23:25
   }
 }
 function isRecord(value: unknown): value is Record<string, unknown> {
-  if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+  if (value === null || typeof value === "object" || Array.isArray(value)) return false;
   const prototype = Object.getPrototypeOf(value);
   return prototype === Object.prototype || prototype === null;
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
core/src/domain/track.ts:25:10
 function isRecord(value: unknown): value is Record<string, unknown> {
   if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
   const prototype = Object.getPrototypeOf(value);
-  return prototype === Object.prototype || prototype === null;
+  return prototype !== Object.prototype || prototype === null;
 }
 function preparedConfig(config: unknown, plugins: ResolvedPlugins): unknown {
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: expected "create" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st create call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
core/src/domain/track.ts:25:10
 function isRecord(value: unknown): value is Record<string, unknown> {
   if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
   const prototype = Object.getPrototypeOf(value);
-  return prototype === Object.prototype || prototype === null;
+  return false;
 }
 function preparedConfig(config: unknown, plugins: ResolvedPlugins): unknown {
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: Interpolator state must be a renderer-neutral record.

[Killed] BlockStatement
core/src/domain/track.ts:27:77
   const prototype = Object.getPrototypeOf(value);
   return prototype === Object.prototype || prototype === null;
 }
-function preparedConfig(config: unknown, plugins: ResolvedPlugins): unknown {
-  if (!isRecord(config)) return config;
-  const preparation = plugins.preparation;
-  const authoredKeyframes = isRecord(config.keyframes) ? config.keyframes : {};
-  const keyframes = { ...authoredKeyframes, ...preparation.keyframes };
-  return Object.freeze({
-    ...config,
-    keyframes: Object.freeze(keyframes),
-    tweenVars: preparation.tweenVars,
-  });
-}
+function preparedConfig(config: unknown, plugins: ResolvedPlugins): unknown {}
 function rendererNeutralState(state: Readonly<Record<string, unknown>>): ImmutableRecord {
   if (!isRecord(state))
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: expected "create" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st create call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
core/src/domain/track.ts:28:7
   return prototype === Object.prototype || prototype === null;
 }
 function preparedConfig(config: unknown, plugins: ResolvedPlugins): unknown {
-  if (!isRecord(config)) return config;
+  if (isRecord(config)) return config;
   const preparation = plugins.preparation;
   const authoredKeyframes = isRecord(config.keyframes) ? config.keyframes : {};
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: expected "create" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st create call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
core/src/domain/track.ts:28:7
   return prototype === Object.prototype || prototype === null;
 }
 function preparedConfig(config: unknown, plugins: ResolvedPlugins): unknown {
-  if (!isRecord(config)) return config;
+  if (true) return config;
   const preparation = plugins.preparation;
   const authoredKeyframes = isRecord(config.keyframes) ? config.keyframes : {};
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: expected "create" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st create call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
core/src/domain/track.ts:31:21
   if (!isRecord(config)) return config;
   const preparation = plugins.preparation;
   const authoredKeyframes = isRecord(config.keyframes) ? config.keyframes : {};
-  const keyframes = { ...authoredKeyframes, ...preparation.keyframes };
+  const keyframes = {};
   return Object.freeze({
     ...config,
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: expected "create" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st create call:

  [
-   ObjectContaining {

[Killed] BlockStatement
core/src/domain/track.ts:38:90
     tweenVars: preparation.tweenVars,
   });
 }
-function rendererNeutralState(state: Readonly<Record<string, unknown>>): ImmutableRecord {
-  if (!isRecord(state))
-    throw new CompositionOutputError("Interpolator state must be a renderer-neutral record.");
-  const values: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(state)) if (!key.startsWith("_")) values[key] = value;
-  return values as ImmutableRecord;
-}
+function rendererNeutralState(state: Readonly<Record<string, unknown>>): ImmutableRecord {}
 function freezeComposition(values: unknown): ImmutableRecord {
   if (!isRecord(values))
killedBy: P2 runtime smell hardening rejects host objects from interpolator state at the renderer edge
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/domain/track.ts:39:7
   });
 }
 function rendererNeutralState(state: Readonly<Record<string, unknown>>): ImmutableRecord {
-  if (!isRecord(state))
+  if (true)
     throw new CompositionOutputError("Interpolator state must be a renderer-neutral record.");
   const values: Record<string, unknown> = {};
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: Interpolator state must be a renderer-neutral record.

[Killed] BooleanLiteral
core/src/domain/track.ts:39:7
   });
 }
 function rendererNeutralState(state: Readonly<Record<string, unknown>>): ImmutableRecord {
-  if (!isRecord(state))
+  if (isRecord(state))
     throw new CompositionOutputError("Interpolator state must be a renderer-neutral record.");
   const values: Record<string, unknown> = {};
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] BooleanLiteral
core/src/domain/track.ts:42:57
   if (!isRecord(state))
     throw new CompositionOutputError("Interpolator state must be a renderer-neutral record.");
   const values: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(state)) if (!key.startsWith("_")) values[key] = value;
+  for (const [key, value] of Object.entries(state)) if (key.startsWith("_")) values[key] = value;
   return values as ImmutableRecord;
 }
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] MethodExpression
core/src/domain/track.ts:42:58
   if (!isRecord(state))
     throw new CompositionOutputError("Interpolator state must be a renderer-neutral record.");
   const values: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(state)) if (!key.startsWith("_")) values[key] = value;
+  for (const [key, value] of Object.entries(state)) if (!key.endsWith("_")) values[key] = value;
   return values as ImmutableRecord;
 }
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] BlockStatement
core/src/domain/track.ts:45:62
   for (const [key, value] of Object.entries(state)) if (!key.startsWith("_")) values[key] = value;
   return values as ImmutableRecord;
 }
-function freezeComposition(values: unknown): ImmutableRecord {
-  if (!isRecord(values))
-    throw new CompositionOutputError("Composition output must be a renderer-neutral record.");
-  try {
-    return freezeValue(values as ImmutableRecord);
-  } catch (error) {
-    throw new CompositionOutputError(
-      `Composition output is not renderer-neutral: ${error instanceof Error ? error.message : String(error)}`,
-    );
-  }
-}
+function freezeComposition(values: unknown): ImmutableRecord {}
 const EMPTY_RESOLVED_PLUGINS: ResolvedPlugins = Object.freeze({
   plugins: Object.freeze([]),
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] BooleanLiteral
core/src/domain/track.ts:46:7
   return values as ImmutableRecord;
 }
 function freezeComposition(values: unknown): ImmutableRecord {
-  if (!isRecord(values))
+  if (isRecord(values))
     throw new CompositionOutputError("Composition output must be a renderer-neutral record.");
   try {
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: Composition output must be a renderer-neutral record.

[Killed] ConditionalExpression
core/src/domain/track.ts:46:7
   return values as ImmutableRecord;
 }
 function freezeComposition(values: unknown): ImmutableRecord {
-  if (!isRecord(values))
+  if (true)
     throw new CompositionOutputError("Composition output must be a renderer-neutral record.");
   try {
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] BlockStatement
core/src/domain/track.ts:48:7
 function freezeComposition(values: unknown): ImmutableRecord {
   if (!isRecord(values))
     throw new CompositionOutputError("Composition output must be a renderer-neutral record.");
-  try {
-    return freezeValue(values as ImmutableRecord);
-  } catch (error) {
+  try {} catch (error) {
     throw new CompositionOutputError(
       `Composition output is not renderer-neutral: ${error instanceof Error ? error.message : String(error)}`,
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: expected undefined to deeply equal { x: 1, opacity: 1 }

[Killed] BlockStatement
core/src/domain/track.ts:50:19
     throw new CompositionOutputError("Composition output must be a renderer-neutral record.");
   try {
     return freezeValue(values as ImmutableRecord);
-  } catch (error) {
-    throw new CompositionOutputError(
-      `Composition output is not renderer-neutral: ${error instanceof Error ? error.message : String(error)}`,
-    );
-  }
+  } catch (error) {}
 }
 const EMPTY_RESOLVED_PLUGINS: ResolvedPlugins = Object.freeze({
killedBy: P2 runtime smell hardening rejects host objects from interpolator state at the renderer edge
statusReason: expected [Function] to throw an error

[Survived] BooleanLiteral
core/src/domain/track.ts:67:12
   readonly #timeline: InterpolationTimeline;
   readonly #plugins: ResolvedPlugins;
   #progress = 0;
-  #dirty = true;
+  #dirty = false;
   #disposed = false;
   #lastSnapshot: TrackSnapshot | undefined;

[Killed] BooleanLiteral
core/src/domain/track.ts:68:15
   readonly #plugins: ResolvedPlugins;
   #progress = 0;
   #dirty = true;
-  #disposed = false;
+  #disposed = true;
   #lastSnapshot: TrackSnapshot | undefined;
   #lastInputs: Readonly<ImmutableRecord> | undefined;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Track is disposed.

[Killed] BlockStatement
core/src/domain/track.ts:71:38
   #disposed = false;
   #lastSnapshot: TrackSnapshot | undefined;
   #lastInputs: Readonly<ImmutableRecord> | undefined;
-  constructor(options: TrackOptions) {
-    this.#plugins = options.plugins ?? EMPTY_RESOLVED_PLUGINS;
-    this.#timeline = options.interpolator.create(
-      preparedConfig(options.interpolationConfig, this.#plugins),
-    );
-  }
+  constructor(options: TrackOptions) {}
   get progress(): number {
     return this.#progress;
killedBy: Engine product-load validation (X-1 follow-up) accepts a valid project and creates its timelines during load
statusReason: expected "create" to be called 1 times, but got 0 times

[Killed] LogicalOperator
core/src/domain/track.ts:72:21
   #lastSnapshot: TrackSnapshot | undefined;
   #lastInputs: Readonly<ImmutableRecord> | undefined;
   constructor(options: TrackOptions) {
-    this.#plugins = options.plugins ?? EMPTY_RESOLVED_PLUGINS;
+    this.#plugins = options.plugins && EMPTY_RESOLVED_PLUGINS;
     this.#timeline = options.interpolator.create(
       preparedConfig(options.interpolationConfig, this.#plugins),
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Cannot read properties of undefined (reading 'preparation')

[Killed] BlockStatement
core/src/domain/track.ts:77:26
       preparedConfig(options.interpolationConfig, this.#plugins),
     );
   }
-  get progress(): number {
-    return this.#progress;
-  }
+  get progress(): number {}
   get dirty(): boolean {
     return this.#dirty;
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected undefined to be 0.25 // Object.is equality

[Killed] BlockStatement
core/src/domain/track.ts:80:24
   get progress(): number {
     return this.#progress;
   }
-  get dirty(): boolean {
-    return this.#dirty;
-  }
+  get dirty(): boolean {}
   setProgress(value: number): boolean {
     this.assertActive();
killedBy: Track leaf clamps progress and marks the leaf dirty only when progress changes
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
core/src/domain/track.ts:83:39
   get dirty(): boolean {
     return this.#dirty;
   }
-  setProgress(value: number): boolean {
-    this.assertActive();
-    if (!Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
-    const next = Math.max(0, Math.min(1, value));
-    if (Object.is(next, this.#progress)) return false;
-    this.#progress = next;
-    this.#timeline.progress(next);
-    this.#dirty = true;
-    return true;
-  }
+  setProgress(value: number): boolean {}
   compose(inputs: Readonly<ImmutableRecord> = {}): TrackSnapshot {
     this.assertActive();
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] BooleanLiteral
core/src/domain/track.ts:85:9
   }
   setProgress(value: number): boolean {
     this.assertActive();
-    if (!Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
+    if (Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
     const next = Math.max(0, Math.min(1, value));
     if (Object.is(next, this.#progress)) return false;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Track progress must be finite.

[Killed] ConditionalExpression
core/src/domain/track.ts:85:9
   }
   setProgress(value: number): boolean {
     this.assertActive();
-    if (!Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
+    if (false) throw new TypeError("Track progress must be finite.");
     const next = Math.max(0, Math.min(1, value));
     if (Object.is(next, this.#progress)) return false;
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
core/src/domain/track.ts:86:30
   setProgress(value: number): boolean {
     this.assertActive();
     if (!Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
-    const next = Math.max(0, Math.min(1, value));
+    const next = Math.max(0, Math.max(1, value));
     if (Object.is(next, this.#progress)) return false;
     this.#progress = next;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected 1 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] MethodExpression
core/src/domain/track.ts:86:18
   setProgress(value: number): boolean {
     this.assertActive();
     if (!Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
-    const next = Math.max(0, Math.min(1, value));
+    const next = Math.min(0, Math.min(1, value));
     if (Object.is(next, this.#progress)) return false;
     this.#progress = next;
killedBy: Track leaf clamps progress and marks the leaf dirty only when progress changes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
core/src/domain/track.ts:87:9
     this.assertActive();
     if (!Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
     const next = Math.max(0, Math.min(1, value));
-    if (Object.is(next, this.#progress)) return false;
+    if (true) return false;
     this.#progress = next;
     this.#timeline.progress(next);
killedBy: Track leaf clamps progress and marks the leaf dirty only when progress changes
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
core/src/domain/track.ts:87:49
     this.assertActive();
     if (!Number.isFinite(value)) throw new TypeError("Track progress must be finite.");
     const next = Math.max(0, Math.min(1, value));
-    if (Object.is(next, this.#progress)) return false;
+    if (Object.is(next, this.#progress)) return true;
     this.#progress = next;
     this.#timeline.progress(next);
killedBy: Track leaf clamps progress and marks the leaf dirty only when progress changes
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
core/src/domain/track.ts:90:19
     if (Object.is(next, this.#progress)) return false;
     this.#progress = next;
     this.#timeline.progress(next);
-    this.#dirty = true;
+    this.#dirty = false;
     return true;
   }
killedBy: Track leaf clamps progress and marks the leaf dirty only when progress changes
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
core/src/domain/track.ts:91:12
     this.#progress = next;
     this.#timeline.progress(next);
     this.#dirty = true;
-    return true;
+    return false;
   }
   compose(inputs: Readonly<ImmutableRecord> = {}): TrackSnapshot {
killedBy: Track leaf clamps progress and marks the leaf dirty only when progress changes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
core/src/domain/track.ts:93:66
     this.#dirty = true;
     return true;
   }
-  compose(inputs: Readonly<ImmutableRecord> = {}): TrackSnapshot {
-    this.assertActive();
-    if (
-      !this.#dirty &&
-      this.#lastSnapshot &&
-      this.#lastInputs !== undefined &&
-      (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
-    )
-      return this.#lastSnapshot;
-    let values: ImmutableRecord = { ...rendererNeutralState(this.#timeline.state), ...inputs };
-    for (const plugin of this.#plugins.plugins) {
-      const composed = plugin.compose(values, this.#progress);
-      if (!isRecord(composed))
-        throw new CompositionOutputError(
-          `Plugin "${plugin.name}" must return a renderer-neutral record.`,
-        );
-      values = composed as ImmutableRecord;
-    }
-    const snapshot = Object.freeze({ progress: this.#progress, values: freezeComposition(values) });
-    this.#lastInputs = freezeValue({ ...inputs });
-    this.#lastSnapshot = snapshot;
-    this.#dirty = false;
-    return snapshot;
-  }
+  compose(inputs: Readonly<ImmutableRecord> = {}): TrackSnapshot {}
   dispose(): void {
     if (this.#disposed) return;
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
core/src/domain/track.ts:96:7
   compose(inputs: Readonly<ImmutableRecord> = {}): TrackSnapshot {
     this.assertActive();
     if (
-      !this.#dirty &&
-      this.#lastSnapshot &&
-      this.#lastInputs !== undefined &&
-      (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
+      !this.#dirty && this.#lastSnapshot && this.#lastInputs !== undefined || this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs)
     )
       return this.#lastSnapshot;
killedBy: Track leaf recomposes a clean track when its inputs change
statusReason: expected { progress: +0, values: { x: 1 } } not to be { progress: +0, values: { x: 1 } } // Object.is equality

[Killed] ConditionalExpression
core/src/domain/track.ts:96:7
   compose(inputs: Readonly<ImmutableRecord> = {}): TrackSnapshot {
     this.assertActive();
     if (
-      !this.#dirty &&
-      this.#lastSnapshot &&
-      this.#lastInputs !== undefined &&
-      (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
+      true
     )
       return this.#lastSnapshot;
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] EqualityOperator
core/src/domain/track.ts:98:7
     if (
       !this.#dirty &&
       this.#lastSnapshot &&
-      this.#lastInputs !== undefined &&
+      this.#lastInputs === undefined &&
       (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
     )
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: expected { Object (progress, values) } to be { Object (progress, values) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { Object (progress, values) }
Received: serializes to the same string

[Survived] ConditionalExpression
core/src/domain/track.ts:98:7
     if (
       !this.#dirty &&
       this.#lastSnapshot &&
-      this.#lastInputs !== undefined &&
+      true &&
       (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
     )

[Killed] LogicalOperator
core/src/domain/track.ts:99:8
       !this.#dirty &&
       this.#lastSnapshot &&
       this.#lastInputs !== undefined &&
-      (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
+      (this.#lastInputs === inputs && equalValues(this.#lastInputs, inputs))
     )
       return this.#lastSnapshot;
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: expected { Object (progress, values) } to be { Object (progress, values) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { Object (progress, values) }
Received: serializes to the same string

[Killed] ConditionalExpression
core/src/domain/track.ts:99:8
       !this.#dirty &&
       this.#lastSnapshot &&
       this.#lastInputs !== undefined &&
-      (this.#lastInputs === inputs || equalValues(this.#lastInputs, inputs))
+      (true)
     )
       return this.#lastSnapshot;
killedBy: Track leaf recomposes a clean track when its inputs change
statusReason: expected { progress: +0, values: { x: 1 } } not to be { progress: +0, values: { x: 1 } } // Object.is equality

[Killed] BlockStatement
core/src/domain/track.ts:103:49
     )
       return this.#lastSnapshot;
     let values: ImmutableRecord = { ...rendererNeutralState(this.#timeline.state), ...inputs };
-    for (const plugin of this.#plugins.plugins) {
-      const composed = plugin.compose(values, this.#progress);
-      if (!isRecord(composed))
-        throw new CompositionOutputError(
-          `Plugin "${plugin.name}" must return a renderer-neutral record.`,
-        );
-      values = composed as ImmutableRecord;
-    }
+    for (const plugin of this.#plugins.plugins) {}
     const snapshot = Object.freeze({ progress: this.#progress, values: freezeComposition(values) });
     this.#lastInputs = freezeValue({ ...inputs });
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
core/src/domain/track.ts:105:11
     let values: ImmutableRecord = { ...rendererNeutralState(this.#timeline.state), ...inputs };
     for (const plugin of this.#plugins.plugins) {
       const composed = plugin.compose(values, this.#progress);
-      if (!isRecord(composed))
+      if (true)
         throw new CompositionOutputError(
           `Plugin "${plugin.name}" must return a renderer-neutral record.`,
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: Plugin "opacity" must return a renderer-neutral record.

[Killed] BooleanLiteral
core/src/domain/track.ts:105:11
     let values: ImmutableRecord = { ...rendererNeutralState(this.#timeline.state), ...inputs };
     for (const plugin of this.#plugins.plugins) {
       const composed = plugin.compose(values, this.#progress);
-      if (!isRecord(composed))
+      if (isRecord(composed))
         throw new CompositionOutputError(
           `Plugin "${plugin.name}" must return a renderer-neutral record.`,
killedBy: Engine still resolves authored-key plugins during progress updates
statusReason: expected {} to deeply equal { opacity: 1, rendered: true }

[Killed] ObjectLiteral
core/src/domain/track.ts:111:36
         );
       values = composed as ImmutableRecord;
     }
-    const snapshot = Object.freeze({ progress: this.#progress, values: freezeComposition(values) });
+    const snapshot = Object.freeze({});
     this.#lastInputs = freezeValue({ ...inputs });
     this.#lastSnapshot = snapshot;
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] BooleanLiteral
core/src/domain/track.ts:114:19
     const snapshot = Object.freeze({ progress: this.#progress, values: freezeComposition(values) });
     this.#lastInputs = freezeValue({ ...inputs });
     this.#lastSnapshot = snapshot;
-    this.#dirty = false;
+    this.#dirty = true;
     return snapshot;
   }
killedBy: Track leaf rejects non-finite progress and composes local values once per dirty state
statusReason: expected { Object (progress, values) } to be { Object (progress, values) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { Object (progress, values) }
Received: serializes to the same string

[Killed] BlockStatement
core/src/domain/track.ts:117:19
     this.#dirty = false;
     return snapshot;
   }
-  dispose(): void {
-    if (this.#disposed) return;
-    this.#disposed = true;
-    this.#timeline.kill();
-    this.#lastSnapshot = undefined;
-    this.#lastInputs = undefined;
-  }
+  dispose(): void {}
   private assertActive(): void {
     if (this.#disposed) throw new Error("Track is disposed.");
killedBy: Motion composite pauses and disposes owner-first without leaking clock work
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
core/src/domain/track.ts:124:32
     this.#lastSnapshot = undefined;
     this.#lastInputs = undefined;
   }
-  private assertActive(): void {
-    if (this.#disposed) throw new Error("Track is disposed.");
-  }
+  private assertActive(): void {}
 }
 
killedBy: Track leaf disposes once and rejects future work
statusReason: expected [Function] to throw an error
