[Killed] ConditionalExpression
core/src/domain/track.ts:125:9
     this.#lastInputs = undefined;
   }
   private assertActive(): void {
-    if (this.#disposed) throw new Error("Track is disposed.");
+    if (true) throw new Error("Track is disposed.");
   }
 }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Track is disposed.

[Killed] ConditionalExpression
core/src/domain/track.ts:125:9
     this.#lastInputs = undefined;
   }
   private assertActive(): void {
-    if (this.#disposed) throw new Error("Track is disposed.");
+    if (false) throw new Error("Track is disposed.");
   }
 }
killedBy: Track leaf disposes once and rejects future work
statusReason: expected [Function] to throw an error
