[Killed] BlockStatement
packages/core/src/engine.ts:39:60
   graph: { registry: { subscribeNode(nodeId: string, listener: PatchListener): () => void } };
   dispose(): void;
 };
-function createHandle(runtime: RuntimeLike): ProjectHandle {
-  return {
-    mount: (nodeId, instance = {}) => runtime.mount(nodeId, instance),
-    unmount: (nodeId) => runtime.unmount(nodeId),
-    seek: (nodeId, progress) => runtime.seek(nodeId, progress),
-    subscribe: (nodeId, listener) => runtime.graph.registry.subscribeNode(nodeId, listener),
-    dispose: () => runtime.dispose(),
-  };
-}
+function createHandle(runtime: RuntimeLike): ProjectHandle {}
 function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
   return diagnostics
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'mount')

[Survived] ArrowFunction
packages/core/src/engine.ts:41:12
 };
 function createHandle(runtime: RuntimeLike): ProjectHandle {
   return {
-    mount: (nodeId, instance = {}) => runtime.mount(nodeId, instance),
+    mount: () => undefined,
     unmount: (nodeId) => runtime.unmount(nodeId),
     seek: (nodeId, progress) => runtime.seek(nodeId, progress),

[Survived] ArrowFunction
packages/core/src/engine.ts:42:14
 function createHandle(runtime: RuntimeLike): ProjectHandle {
   return {
     mount: (nodeId, instance = {}) => runtime.mount(nodeId, instance),
-    unmount: (nodeId) => runtime.unmount(nodeId),
+    unmount: () => undefined,
     seek: (nodeId, progress) => runtime.seek(nodeId, progress),
     subscribe: (nodeId, listener) => runtime.graph.registry.subscribeNode(nodeId, listener),

[Killed] ArrowFunction
packages/core/src/engine.ts:43:11
   return {
     mount: (nodeId, instance = {}) => runtime.mount(nodeId, instance),
     unmount: (nodeId) => runtime.unmount(nodeId),
-    seek: (nodeId, progress) => runtime.seek(nodeId, progress),
+    seek: () => undefined,
     subscribe: (nodeId, listener) => runtime.graph.registry.subscribeNode(nodeId, listener),
     dispose: () => runtime.dispose(),
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'patches')

[Killed] ArrowFunction
packages/core/src/engine.ts:44:16
     mount: (nodeId, instance = {}) => runtime.mount(nodeId, instance),
     unmount: (nodeId) => runtime.unmount(nodeId),
     seek: (nodeId, progress) => runtime.seek(nodeId, progress),
-    subscribe: (nodeId, listener) => runtime.graph.registry.subscribeNode(nodeId, listener),
+    subscribe: () => undefined,
     dispose: () => runtime.dispose(),
   };
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Survived] ArrowFunction
packages/core/src/engine.ts:45:14
     unmount: (nodeId) => runtime.unmount(nodeId),
     seek: (nodeId, progress) => runtime.seek(nodeId, progress),
     subscribe: (nodeId, listener) => runtime.graph.registry.subscribeNode(nodeId, listener),
-    dispose: () => runtime.dispose(),
+    dispose: () => undefined,
   };
 }

[Killed] BlockStatement
packages/core/src/engine.ts:53:66
     .map(({ ruleId, path, message }) => `${ruleId} at ${path}: ${message}`)
     .join(" ");
 }
-function assertValidProject(project: unknown): ProjectDefinition {
-  const result = validateV5(project);
-  if (!result.valid || result.value === null)
-    throw new TypeError(
-      result.diagnostics.length === 0
-        ? "Project failed v5 validation."
-        : describeDiagnostics(result.diagnostics),
-    );
-  return result.value;
-}
+function assertValidProject(project: unknown): ProjectDefinition {}
 
 export class Engine {
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'motions')

[Killed] ConditionalExpression
packages/core/src/engine.ts:55:7
 }
 function assertValidProject(project: unknown): ProjectDefinition {
   const result = validateV5(project);
-  if (!result.valid || result.value === null)
+  if (true)
     throw new TypeError(
       result.diagnostics.length === 0
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: Project failed v5 validation.

[Killed] BooleanLiteral
packages/core/src/engine.ts:55:7
 }
 function assertValidProject(project: unknown): ProjectDefinition {
   const result = validateV5(project);
-  if (!result.valid || result.value === null)
+  if (result.valid || result.value === null)
     throw new TypeError(
       result.diagnostics.length === 0
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: Project failed v5 validation.

[Killed] EqualityOperator
packages/core/src/engine.ts:57:7
   const result = validateV5(project);
   if (!result.valid || result.value === null)
     throw new TypeError(
-      result.diagnostics.length === 0
+      result.diagnostics.length !== 0
         ? "Project failed v5 validation."
         : describeDiagnostics(result.diagnostics),
killedBy: Engine product-load validation (X-1 follow-up) rejects malformed authored stops before constructing a runtime
statusReason: expected [Function] to throw error matching /stop-position/ but got 'Project failed v5 validation.'

[Killed] ConditionalExpression
packages/core/src/engine.ts:57:7
   const result = validateV5(project);
   if (!result.valid || result.value === null)
     throw new TypeError(
-      result.diagnostics.length === 0
+      true
         ? "Project failed v5 validation."
         : describeDiagnostics(result.diagnostics),
killedBy: Engine product-load validation (X-1 follow-up) rejects malformed authored stops before constructing a runtime
statusReason: expected [Function] to throw error matching /stop-position/ but got 'Project failed v5 validation.'

[NoCoverage] StringLiteral
packages/core/src/engine.ts:58:11
   if (!result.valid || result.value === null)
     throw new TypeError(
       result.diagnostics.length === 0
-        ? "Project failed v5 validation."
+        ? ""
         : describeDiagnostics(result.diagnostics),
     );

[Killed] BlockStatement
packages/core/src/engine.ts:67:39
 export class Engine {
   readonly #options: EngineOptions;
   readonly #plugins: PluginRegistry | undefined;
-  constructor(options: EngineOptions) {
-    assertClock(options.clock);
-    assertInterpolator(options.interpolator);
-    assertScheduler(options.scheduler);
-    this.#options = options;
-    this.#plugins = options.plugins;
-  }
+  constructor(options: EngineOptions) {}
   load(project: ProjectDefinition): ProjectHandle {
     const acceptedProject = assertValidProject(project);
killedBy: Engine product-load validation (X-1 follow-up) resolves authored plugin ownership during load, not on the first seek
statusReason: expected [Function] to throw error matching /plugin-unknown-key/ but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
packages/core/src/engine.ts:84:25
     for (const motion of acceptedProject.motions)
       for (const track of motion.tracks)
         nodes.set(qualifyMotionTrack(motion.id, track.id).value, { ...track, id: track.id });
-    for (const track of acceptedProject.freeTracks ?? [])
+    for (const track of acceptedProject.freeTracks && [])
       nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
     const compile = (nodeId: string): Track => {
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrayDeclaration
packages/core/src/engine.ts:84:55
     for (const motion of acceptedProject.motions)
       for (const track of motion.tracks)
         nodes.set(qualifyMotionTrack(motion.id, track.id).value, { ...track, id: track.id });
-    for (const track of acceptedProject.freeTracks ?? [])
+    for (const track of acceptedProject.freeTracks ?? ["Stryker was here"])
       nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
     const compile = (nodeId: string): Track => {
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: Track id must be a non-empty string.

[Survived] ObjectLiteral
packages/core/src/engine.ts:85:51
       for (const track of motion.tracks)
         nodes.set(qualifyMotionTrack(motion.id, track.id).value, { ...track, id: track.id });
     for (const track of acceptedProject.freeTracks ?? [])
-      nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
+      nodes.set(qualifyFreeTrack(track.id).value, {});
     const compile = (nodeId: string): Track => {
       const existing = tracks.get(nodeId);

[Killed] ConditionalExpression
packages/core/src/engine.ts:88:11
       nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
     const compile = (nodeId: string): Track => {
       const existing = tracks.get(nodeId);
-      if (existing) return existing;
+      if (true) return existing;
       const definition = nodes.get(nodeId);
       if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Number of calls: 0

[Survived] ConditionalExpression
packages/core/src/engine.ts:88:11
       nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
     const compile = (nodeId: string): Track => {
       const existing = tracks.get(nodeId);
-      if (existing) return existing;
+      if (false) return existing;
       const definition = nodes.get(nodeId);
       if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);

[Killed] BooleanLiteral
packages/core/src/engine.ts:90:11
       const existing = tracks.get(nodeId);
       if (existing) return existing;
       const definition = nodes.get(nodeId);
-      if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+      if (definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
       const path = `${nodeId}.keyframes`;
       const resolved = this.#plugins?.resolveForKeyframes(definition.keyframes ?? {}, path, {
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: Unknown graph node "hero/arm".

[Killed] ConditionalExpression
packages/core/src/engine.ts:90:11
       const existing = tracks.get(nodeId);
       if (existing) return existing;
       const definition = nodes.get(nodeId);
-      if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+      if (true) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
       const path = `${nodeId}.keyframes`;
       const resolved = this.#plugins?.resolveForKeyframes(definition.keyframes ?? {}, path, {
killedBy: Engine product-load validation (X-1 follow-up) resolves authored plugin ownership during load, not on the first seek
statusReason: expected [Function] to throw error matching /plugin-unknown-key/ but got 'Unknown graph node "hero/arm".'

[Killed] OptionalChaining
packages/core/src/engine.ts:92:24
       const definition = nodes.get(nodeId);
       if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
       const path = `${nodeId}.keyframes`;
-      const resolved = this.#plugins?.resolveForKeyframes(definition.keyframes ?? {}, path, {
+      const resolved = this.#plugins.resolveForKeyframes(definition.keyframes ?? {}, path, {
         id: nodeId,
         duration: definition.duration,
killedBy: Engine product-load validation (X-1 follow-up) accepts a valid project and creates its timelines during load
statusReason: Cannot read properties of undefined (reading 'resolveForKeyframes')

[Killed] LogicalOperator
packages/core/src/engine.ts:92:59
       const definition = nodes.get(nodeId);
       if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
       const path = `${nodeId}.keyframes`;
-      const resolved = this.#plugins?.resolveForKeyframes(definition.keyframes ?? {}, path, {
+      const resolved = this.#plugins?.resolveForKeyframes(definition.keyframes && {}, path, {
         id: nodeId,
         duration: definition.duration,
killedBy: Engine product-load validation (X-1 follow-up) resolves authored plugin ownership during load, not on the first seek
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
packages/core/src/engine.ts:97:13
         duration: definition.duration,
       });
       const preparedKeyframes = {
-        ...(definition.keyframes ?? {}),
+        ...(definition.keyframes && {}),
         ...(resolved?.preparation.keyframes ?? {}),
       };
killedBy: X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
packages/core/src/engine.ts:98:13
       });
       const preparedKeyframes = {
         ...(definition.keyframes ?? {}),
-        ...(resolved?.preparation.keyframes ?? {}),
+        ...(resolved.preparation.keyframes ?? {}),
       };
       const keyframeCompilation = compilePercentKeyframes(preparedKeyframes, path);
killedBy: X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
statusReason: expected [Function] to throw error matching /plugin-contribution-ease-collision/ but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
packages/core/src/engine.ts:98:13
       });
       const preparedKeyframes = {
         ...(definition.keyframes ?? {}),
-        ...(resolved?.preparation.keyframes ?? {}),
+        ...(resolved?.preparation.keyframes && {}),
       };
       const keyframeCompilation = compilePercentKeyframes(preparedKeyframes, path);
killedBy: X-3 contribution through the product load path merges contributed keyframes into compiler diagnostics before timeline creation
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
packages/core/src/engine.ts:101:32
         ...(resolved?.preparation.keyframes ?? {}),
       };
       const keyframeCompilation = compilePercentKeyframes(preparedKeyframes, path);
-      const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
+      const diagnostics = [...(resolved?.diagnostics && []), ...keyframeCompilation.diagnostics];
       if (diagnostics.some(({ severity }) => severity === "error"))
         throw new TypeError(describeDiagnostics(diagnostics));
killedBy: X-3 contribution through the product load path rejects malformed contributions during Engine.load
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
packages/core/src/engine.ts:101:32
         ...(resolved?.preparation.keyframes ?? {}),
       };
       const keyframeCompilation = compilePercentKeyframes(preparedKeyframes, path);
-      const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
+      const diagnostics = [...(resolved.diagnostics ?? []), ...keyframeCompilation.diagnostics];
       if (diagnostics.some(({ severity }) => severity === "error"))
         throw new TypeError(describeDiagnostics(diagnostics));
killedBy: X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
statusReason: expected [Function] to throw error matching /plugin-contribution-ease-collision/ but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
packages/core/src/engine.ts:102:11
       };
       const keyframeCompilation = compilePercentKeyframes(preparedKeyframes, path);
       const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
-      if (diagnostics.some(({ severity }) => severity === "error"))
+      if (true)
         throw new TypeError(describeDiagnostics(diagnostics));
       const track = new Track({
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load

[Killed] ArrowFunction
packages/core/src/engine.ts:102:28
       };
       const keyframeCompilation = compilePercentKeyframes(preparedKeyframes, path);
       const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
-      if (diagnostics.some(({ severity }) => severity === "error"))
+      if (diagnostics.some(() => undefined))
         throw new TypeError(describeDiagnostics(diagnostics));
       const track = new Track({
killedBy: X-3 contribution through the product load path rejects malformed contributions during Engine.load
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
packages/core/src/engine.ts:104:31
       const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
       if (diagnostics.some(({ severity }) => severity === "error"))
         throw new TypeError(describeDiagnostics(diagnostics));
-      const track = new Track({
-        interpolator: this.#options.interpolator,
-        interpolationConfig: definition,
-        ...(resolved ? { plugins: resolved } : {}),
-      });
+      const track = new Track({});
       tracks.set(nodeId, track);
       return track;
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: Cannot read properties of undefined (reading 'create')

[Killed] ObjectLiteral
packages/core/src/engine.ts:107:24
       const track = new Track({
         interpolator: this.#options.interpolator,
         interpolationConfig: definition,
-        ...(resolved ? { plugins: resolved } : {}),
+        ...(resolved ? {} : {}),
       });
       tracks.set(nodeId, track);
killedBy: Engine still resolves authored-key plugins during progress updates
statusReason: expected { opacity: 1 } to deeply equal { opacity: 1, rendered: true }

[Killed] ArrowFunction
packages/core/src/engine.ts:115:9
     try {
       for (const nodeId of nodes.keys()) compile(nodeId);
       const compose =
-        (node: {
-          id: string;
-          track: { duration?: number; keyframes?: Readonly<Record<string, unknown>> };
-        }) =>
-        (inputs: Readonly<Record<string, unknown>>) => {
-          const snapshot = tracks.get(node.id)!.compose(inputs as Readonly<ImmutableRecord>);
-          return {
-            values: snapshot.values,
-            sourceProgress: snapshot.progress,
-            sourceRevisions: {},
-          };
-        };
+        () => undefined;
       const runtime = new ProjectRuntime(acceptedProject, {
         clock: this.#options.clock,
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] BlockStatement
packages/core/src/engine.ts:119:56
           id: string;
           track: { duration?: number; keyframes?: Readonly<Record<string, unknown>> };
         }) =>
-        (inputs: Readonly<Record<string, unknown>>) => {
-          const snapshot = tracks.get(node.id)!.compose(inputs as Readonly<ImmutableRecord>);
-          return {
-            values: snapshot.values,
-            sourceProgress: snapshot.progress,
-            sourceRevisions: {},
-          };
-        };
+        (inputs: Readonly<Record<string, unknown>>) => {};
       const runtime = new ProjectRuntime(acceptedProject, {
         clock: this.#options.clock,
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] ArrowFunction
packages/core/src/engine.ts:131:22
         clock: this.#options.clock,
         scheduler: this.#options.scheduler,
         compose,
-        setProgress: (nodeId, progress) => tracks.get(nodeId)!.setProgress(progress),
+        setProgress: () => undefined,
         disposeComposition: () => {
           for (const track of tracks.values()) track.dispose();
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected 0.2 to be close to 0.6, received difference is 0.39999999999999997, but expected 5e-13

[Survived] BlockStatement
packages/core/src/engine.ts:132:35
         scheduler: this.#options.scheduler,
         compose,
         setProgress: (nodeId, progress) => tracks.get(nodeId)!.setProgress(progress),
-        disposeComposition: () => {
-          for (const track of tracks.values()) track.dispose();
-          tracks.clear();
-        },
+        disposeComposition: () => {},
       });
       return createHandle(runtime);

[Killed] BlockStatement
packages/core/src/engine.ts:138:21
         },
       });
       return createHandle(runtime);
-    } catch (error) {
-      for (const track of tracks.values()) track.dispose();
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: X-3 contribution through the product load path rejects malformed contributions during Engine.load
statusReason: expected [Function] to throw an error
