[Killed] BlockStatement
core/src/graph/ids.ts:16:81
 
 export type QualifiedId = MotionQualifiedId | FreeQualifiedId;
 
-function assertNonEmpty(value: unknown, label: string): asserts value is string {
-  if (typeof value !== "string" || value.length === 0) {
-    throw new TypeError(`${label} must be a non-empty string.`);
-  }
-}
+function assertNonEmpty(value: unknown, label: string): asserts value is string {}
 
 export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/graph/ids.ts:17:7
 export type QualifiedId = MotionQualifiedId | FreeQualifiedId;
 
 function assertNonEmpty(value: unknown, label: string): asserts value is string {
-  if (typeof value !== "string" || value.length === 0) {
+  if (false) {
     throw new TypeError(`${label} must be a non-empty string.`);
   }
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/graph/ids.ts:17:7
 export type QualifiedId = MotionQualifiedId | FreeQualifiedId;
 
 function assertNonEmpty(value: unknown, label: string): asserts value is string {
-  if (typeof value !== "string" || value.length === 0) {
+  if (true) {
     throw new TypeError(`${label} must be a non-empty string.`);
   }
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: motion-id at motions[0].id: Motion id must be a non-empty string.

[Killed] BlockStatement
core/src/graph/ids.ts:22:87
   }
 }
 
-export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {
-  assertNonEmpty(motionId, "Motion id");
-  if (motionId.includes("/")) throw new TypeError("Motion id cannot contain '/'.");
-  if (motionId === "~") throw new TypeError("Motion id '~' is reserved.");
-}
+export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {}
 
 export function assertAuthoredTrackId(trackId: unknown): asserts trackId is string {
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
core/src/graph/ids.ts:23:28
 }
 
 export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {
-  assertNonEmpty(motionId, "Motion id");
+  assertNonEmpty(motionId, "");
   if (motionId.includes("/")) throw new TypeError("Motion id cannot contain '/'.");
   if (motionId === "~") throw new TypeError("Motion id '~' is reserved.");

[Killed] ConditionalExpression
core/src/graph/ids.ts:24:7
 
 export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {
   assertNonEmpty(motionId, "Motion id");
-  if (motionId.includes("/")) throw new TypeError("Motion id cannot contain '/'.");
+  if (false) throw new TypeError("Motion id cannot contain '/'.");
   if (motionId === "~") throw new TypeError("Motion id '~' is reserved.");
 }
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/graph/ids.ts:24:7
 
 export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {
   assertNonEmpty(motionId, "Motion id");
-  if (motionId.includes("/")) throw new TypeError("Motion id cannot contain '/'.");
+  if (true) throw new TypeError("Motion id cannot contain '/'.");
   if (motionId === "~") throw new TypeError("Motion id '~' is reserved.");
 }
killedBy: qualified node ids qualifies motion and free tracks exactly once
statusReason: Motion id cannot contain '/'.

[Killed] ConditionalExpression
core/src/graph/ids.ts:25:7
 export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {
   assertNonEmpty(motionId, "Motion id");
   if (motionId.includes("/")) throw new TypeError("Motion id cannot contain '/'.");
-  if (motionId === "~") throw new TypeError("Motion id '~' is reserved.");
+  if (false) throw new TypeError("Motion id '~' is reserved.");
 }
 
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
core/src/graph/ids.ts:25:7
 export function assertAuthoredMotionId(motionId: unknown): asserts motionId is string {
   assertNonEmpty(motionId, "Motion id");
   if (motionId.includes("/")) throw new TypeError("Motion id cannot contain '/'.");
-  if (motionId === "~") throw new TypeError("Motion id '~' is reserved.");
+  if (motionId !== "~") throw new TypeError("Motion id '~' is reserved.");
 }
 
killedBy: qualified node ids qualifies motion and free tracks exactly once
statusReason: Motion id '~' is reserved.

[Killed] BlockStatement
core/src/graph/ids.ts:28:84
   if (motionId === "~") throw new TypeError("Motion id '~' is reserved.");
 }
 
-export function assertAuthoredTrackId(trackId: unknown): asserts trackId is string {
-  assertNonEmpty(trackId, "Track id");
-  if (trackId.includes("/")) throw new TypeError("Track id cannot contain '/'.");
-}
+export function assertAuthoredTrackId(trackId: unknown): asserts trackId is string {}
 
 export function qualifyMotionTrack(motionId: string, trackId: string): MotionQualifiedId {
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
core/src/graph/ids.ts:29:27
 }
 
 export function assertAuthoredTrackId(trackId: unknown): asserts trackId is string {
-  assertNonEmpty(trackId, "Track id");
+  assertNonEmpty(trackId, "");
   if (trackId.includes("/")) throw new TypeError("Track id cannot contain '/'.");
 }

[Killed] ConditionalExpression
core/src/graph/ids.ts:30:7
 
 export function assertAuthoredTrackId(trackId: unknown): asserts trackId is string {
   assertNonEmpty(trackId, "Track id");
-  if (trackId.includes("/")) throw new TypeError("Track id cannot contain '/'.");
+  if (false) throw new TypeError("Track id cannot contain '/'.");
 }
 
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
core/src/graph/ids.ts:30:7
 
 export function assertAuthoredTrackId(trackId: unknown): asserts trackId is string {
   assertNonEmpty(trackId, "Track id");
-  if (trackId.includes("/")) throw new TypeError("Track id cannot contain '/'.");
+  if (true) throw new TypeError("Track id cannot contain '/'.");
 }
 
killedBy: qualified node ids qualifies motion and free tracks exactly once
statusReason: Track id cannot contain '/'.

[Killed] BlockStatement
core/src/graph/ids.ts:33:90
   if (trackId.includes("/")) throw new TypeError("Track id cannot contain '/'.");
 }
 
-export function qualifyMotionTrack(motionId: string, trackId: string): MotionQualifiedId {
-  assertAuthoredMotionId(motionId);
-  assertAuthoredTrackId(trackId);
-  return Object.freeze({
-    kind: "motion",
-    motionId,
-    trackId,
-    value: `${motionId}/${trackId}` as `${string}/${string}`,
-  });
-}
+export function qualifyMotionTrack(motionId: string, trackId: string): MotionQualifiedId {}
 
 export function qualifyFreeTrack(trackId: string): FreeQualifiedId {
killedBy: qualified node ids qualifies motion and free tracks exactly once
statusReason: expected undefined to deeply equal { kind: 'motion', …(3) }

[Killed] ObjectLiteral
core/src/graph/ids.ts:36:24
 export function qualifyMotionTrack(motionId: string, trackId: string): MotionQualifiedId {
   assertAuthoredMotionId(motionId);
   assertAuthoredTrackId(trackId);
-  return Object.freeze({
-    kind: "motion",
-    motionId,
-    trackId,
-    value: `${motionId}/${trackId}` as `${string}/${string}`,
-  });
+  return Object.freeze({});
 }
 
killedBy: qualified node ids qualifies motion and free tracks exactly once
statusReason: expected {} to deeply equal { kind: 'motion', …(3) }

[Killed] BlockStatement
core/src/graph/ids.ts:44:68
   });
 }
 
-export function qualifyFreeTrack(trackId: string): FreeQualifiedId {
-  assertAuthoredTrackId(trackId);
-  return Object.freeze({
-    kind: "free",
-    trackId,
-    value: `~/${trackId}` as `~/${string}`,
-  });
-}
+export function qualifyFreeTrack(trackId: string): FreeQualifiedId {}
 
 export function parseQualifiedId(value: string): QualifiedId {
killedBy: qualified node ids qualifies motion and free tracks exactly once
statusReason: expected undefined to deeply equal { kind: 'free', …(2) }

[Killed] BlockStatement
core/src/graph/ids.ts:53:62
   });
 }
 
-export function parseQualifiedId(value: string): QualifiedId {
-  assertNonEmpty(value, "Qualified id");
-  if (value.startsWith("~/")) {
-    const trackId = value.slice(2);
-    assertAuthoredTrackId(trackId);
-    return qualifyFreeTrack(trackId);
-  }
-  const separator = value.indexOf("/");
-  if (
-    separator <= 0 ||
-    separator === value.length - 1 ||
-    value.indexOf("/", separator + 1) !== -1
-  ) {
-    throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
-  }
-  return qualifyMotionTrack(value.slice(0, separator), value.slice(separator + 1));
-}
+export function parseQualifiedId(value: string): QualifiedId {}
 
 export function qualifiedId(value: QualifiedId): string {
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: expected undefined to deeply equal { kind: 'motion', …(3) }

[Killed] BlockStatement
core/src/graph/ids.ts:55:31
 
 export function parseQualifiedId(value: string): QualifiedId {
   assertNonEmpty(value, "Qualified id");
-  if (value.startsWith("~/")) {
-    const trackId = value.slice(2);
-    assertAuthoredTrackId(trackId);
-    return qualifyFreeTrack(trackId);
-  }
+  if (value.startsWith("~/")) {}
   const separator = value.indexOf("/");
   if (
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Motion id '~' is reserved.

[Killed] ConditionalExpression
core/src/graph/ids.ts:55:7
 
 export function parseQualifiedId(value: string): QualifiedId {
   assertNonEmpty(value, "Qualified id");
-  if (value.startsWith("~/")) {
+  if (true) {
     const trackId = value.slice(2);
     assertAuthoredTrackId(trackId);
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Track id cannot contain '/'.

[Killed] MethodExpression
core/src/graph/ids.ts:56:21
 export function parseQualifiedId(value: string): QualifiedId {
   assertNonEmpty(value, "Qualified id");
   if (value.startsWith("~/")) {
-    const trackId = value.slice(2);
+    const trackId = value;
     assertAuthoredTrackId(trackId);
     return qualifyFreeTrack(trackId);
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Track id cannot contain '/'.

[Killed] EqualityOperator
core/src/graph/ids.ts:62:5
   }
   const separator = value.indexOf("/");
   if (
-    separator <= 0 ||
+    separator > 0 ||
     separator === value.length - 1 ||
     value.indexOf("/", separator + 1) !== -1
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Qualified id must be 'motionId/trackId' or '~/trackId'.

[Killed] ConditionalExpression
core/src/graph/ids.ts:62:5
   }
   const separator = value.indexOf("/");
   if (
-    separator <= 0 ||
-    separator === value.length - 1 ||
-    value.indexOf("/", separator + 1) !== -1
+    true
   ) {
     throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Qualified id must be 'motionId/trackId' or '~/trackId'.

[Killed] EqualityOperator
core/src/graph/ids.ts:63:5
   const separator = value.indexOf("/");
   if (
     separator <= 0 ||
-    separator === value.length - 1 ||
+    separator !== value.length - 1 ||
     value.indexOf("/", separator + 1) !== -1
   ) {
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Qualified id must be 'motionId/trackId' or '~/trackId'.

[Survived] ConditionalExpression
core/src/graph/ids.ts:63:5
   const separator = value.indexOf("/");
   if (
     separator <= 0 ||
-    separator === value.length - 1 ||
+    false ||
     value.indexOf("/", separator + 1) !== -1
   ) {

[Killed] ArithmeticOperator
core/src/graph/ids.ts:64:24
   if (
     separator <= 0 ||
     separator === value.length - 1 ||
-    value.indexOf("/", separator + 1) !== -1
+    value.indexOf("/", separator - 1) !== -1
   ) {
     throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Qualified id must be 'motionId/trackId' or '~/trackId'.

[Killed] UnaryOperator
core/src/graph/ids.ts:64:43
   if (
     separator <= 0 ||
     separator === value.length - 1 ||
-    value.indexOf("/", separator + 1) !== -1
+    value.indexOf("/", separator + 1) !== +1
   ) {
     throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Qualified id must be 'motionId/trackId' or '~/trackId'.

[Killed] BlockStatement
core/src/graph/ids.ts:65:5
     separator <= 0 ||
     separator === value.length - 1 ||
     value.indexOf("/", separator + 1) !== -1
-  ) {
-    throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
-  }
+  ) {}
   return qualifyMotionTrack(value.slice(0, separator), value.slice(separator + 1));
 }
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw error matching /Qualified id/ but got 'Track id cannot contain \'/\'.'

[Killed] StringLiteral
core/src/graph/ids.ts:66:25
     separator === value.length - 1 ||
     value.indexOf("/", separator + 1) !== -1
   ) {
-    throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
+    throw new TypeError("");
   }
   return qualifyMotionTrack(value.slice(0, separator), value.slice(separator + 1));
killedBy: qualified node ids rejects reserved or malformed authored ids
statusReason: expected [Function] to throw error matching /Qualified id/ but got ''

[Killed] MethodExpression
core/src/graph/ids.ts:68:56
   ) {
     throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
   }
-  return qualifyMotionTrack(value.slice(0, separator), value.slice(separator + 1));
+  return qualifyMotionTrack(value.slice(0, separator), value);
 }
 
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Track id cannot contain '/'.

[Killed] ArithmeticOperator
core/src/graph/ids.ts:68:68
   ) {
     throw new TypeError("Qualified id must be 'motionId/trackId' or '~/trackId'.");
   }
-  return qualifyMotionTrack(value.slice(0, separator), value.slice(separator + 1));
+  return qualifyMotionTrack(value.slice(0, separator), value.slice(separator - 1));
 }
 
killedBy: qualified node ids round-trips qualified ids without losing identity
statusReason: Track id cannot contain '/'.

[NoCoverage] BlockStatement
core/src/graph/ids.ts:71:57
   return qualifyMotionTrack(value.slice(0, separator), value.slice(separator + 1));
 }
 
-export function qualifiedId(value: QualifiedId): string {
-  return value.value;
-}
+export function qualifiedId(value: QualifiedId): string {}
 
