[Survived] StringLiteral
core/src/runtime/graph-publisher.ts:37:17
 class OutputObservationError extends Error {
   constructor(message: string) {
     super(message);
-    this.name = "observation-output-shape";
+    this.name = "";
   }
   readonly ruleId = "observation-output-shape" as const;

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:41:65
   }
   readonly ruleId = "observation-output-shape" as const;
 }
-function diagnostic(nodeId: string, error: unknown): Diagnostic {
-  const ruleId =
-    error instanceof InputObservationError ||
-    error instanceof OutputObservationError ||
-    error instanceof CompositionOutputError
-      ? error.ruleId
-      : "composition-failure";
-  return Object.freeze({
-    ruleId,
-    path: nodeId,
-    message: error instanceof Error ? error.message : String(error),
-    severity: "error",
-    ids: Object.freeze([nodeId]),
-  });
-}
+function diagnostic(nodeId: string, error: unknown): Diagnostic {}
 function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {
   const left = edgeKey(a),
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected undefined to be 'observation-input-collision' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:43:5
 }
 function diagnostic(nodeId: string, error: unknown): Diagnostic {
   const ruleId =
-    error instanceof InputObservationError ||
-    error instanceof OutputObservationError ||
-    error instanceof CompositionOutputError
+    false
       ? error.ruleId
       : "composition-failure";
killedBy: composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
statusReason: expected 'composition-failure' to be 'composition-output-shape' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:43:5
 }
 function diagnostic(nodeId: string, error: unknown): Diagnostic {
   const ruleId =
-    error instanceof InputObservationError ||
-    error instanceof OutputObservationError ||
+    false ||
     error instanceof CompositionOutputError
       ? error.ruleId
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected 'composition-failure' to be 'observation-input-collision' // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:56:62
     ids: Object.freeze([nodeId]),
   });
 }
-function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {
-  const left = edgeKey(a),
-    right = edgeKey(b);
-  return left < right ? -1 : left > right ? 1 : 0;
-}
+function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {}
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
   if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
killedBy: P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
statusReason: expected [ 'b', 'consumer' ] to deeply equal [ 'a', 'consumer' ]

[Killed] UnaryOperator
core/src/runtime/graph-publisher.ts:59:25
 function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {
   const left = edgeKey(a),
     right = edgeKey(b);
-  return left < right ? -1 : left > right ? 1 : 0;
+  return left < right ? +1 : left > right ? 1 : 0;
 }
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
killedBy: P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
statusReason: expected [ 'b', 'consumer' ] to deeply equal [ 'a', 'consumer' ]

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:59:10
 function compareEdgeKeys(a: GraphEdge, b: GraphEdge): number {
   const left = edgeKey(a),
     right = edgeKey(b);
-  return left < right ? -1 : left > right ? 1 : 0;
+  return left >= right ? -1 : left > right ? 1 : 0;
 }
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
killedBy: P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
statusReason: expected [ 'b', 'consumer' ] to deeply equal [ 'a', 'consumer' ]

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:61:79
     right = edgeKey(b);
   return left < right ? -1 : left > right ? 1 : 0;
 }
-function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
-  const prototype = Object.getPrototypeOf(value);
-  return prototype === Object.prototype || prototype === null;
-}
+function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {}
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
   if (value === null) return true;
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] BooleanLiteral
core/src/runtime/graph-publisher.ts:62:83
   return left < right ? -1 : left > right ? 1 : 0;
 }
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+  if (value === null || typeof value !== "object" || Array.isArray(value)) return true;
   const prototype = Object.getPrototypeOf(value);
   return prototype === Object.prototype || prototype === null;
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected undefined to be 'observation-output-shape' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:62:7
   return left < right ? -1 : left > right ? 1 : 0;
 }
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
+  if (true) return false;
   const prototype = Object.getPrototypeOf(value);
   return prototype === Object.prototype || prototype === null;
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:64:10
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
   if (value === null || typeof value !== "object" || Array.isArray(value)) return false;
   const prototype = Object.getPrototypeOf(value);
-  return prototype === Object.prototype || prototype === null;
+  return prototype === Object.prototype && prototype === null;
 }
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:66:83
   const prototype = Object.getPrototypeOf(value);
   return prototype === Object.prototype || prototype === null;
 }
-function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
-  if (value === null) return true;
-  if (typeof value === "string" || typeof value === "boolean") return true;
-  if (typeof value === "number") return Number.isFinite(value);
-  if (typeof value !== "object" || seen.has(value)) return false;
-  seen.add(value);
-  if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
-  if (!isRecord(value)) return false;
-  return Object.entries(value).every(
-    ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
-  );
-}
+function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {}
 function validateComposition(values: unknown): asserts values is Readonly<Record<string, unknown>> {
   if (!isRecord(values) || !isRendererNeutral(values))
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:67:7
   return prototype === Object.prototype || prototype === null;
 }
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
-  if (value === null) return true;
+  if (value !== null) return true;
   if (typeof value === "string" || typeof value === "boolean") return true;
   if (typeof value === "number") return Number.isFinite(value);
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:67:7
   return prototype === Object.prototype || prototype === null;
 }
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
-  if (value === null) return true;
+  if (true) return true;
   if (typeof value === "string" || typeof value === "boolean") return true;
   if (typeof value === "number") return Number.isFinite(value);
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] BooleanLiteral
core/src/runtime/graph-publisher.ts:68:71
 }
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
   if (value === null) return true;
-  if (typeof value === "string" || typeof value === "boolean") return true;
+  if (typeof value === "string" || typeof value === "boolean") return false;
   if (typeof value === "number") return Number.isFinite(value);
   if (typeof value !== "object" || seen.has(value)) return false;
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected 'composition-output-shape' to be 'observation-output-shape' // Object.is equality

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:68:36
 }
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
   if (value === null) return true;
-  if (typeof value === "string" || typeof value === "boolean") return true;
+  if (typeof value === "string" || typeof value !== "boolean") return true;
   if (typeof value === "number") return Number.isFinite(value);
   if (typeof value !== "object" || seen.has(value)) return false;
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:69:7
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
   if (value === null) return true;
   if (typeof value === "string" || typeof value === "boolean") return true;
-  if (typeof value === "number") return Number.isFinite(value);
+  if (false) return Number.isFinite(value);
   if (typeof value !== "object" || seen.has(value)) return false;
   seen.add(value);
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:69:7
 function isRendererNeutral(value: unknown, seen = new WeakSet<object>()): boolean {
   if (value === null) return true;
   if (typeof value === "string" || typeof value === "boolean") return true;
-  if (typeof value === "number") return Number.isFinite(value);
+  if (true) return Number.isFinite(value);
   if (typeof value !== "object" || seen.has(value)) return false;
   seen.add(value);
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected {} to deeply equal { node: 'caption/label' }

[Killed] BooleanLiteral
core/src/runtime/graph-publisher.ts:70:60
   if (value === null) return true;
   if (typeof value === "string" || typeof value === "boolean") return true;
   if (typeof value === "number") return Number.isFinite(value);
-  if (typeof value !== "object" || seen.has(value)) return false;
+  if (typeof value !== "object" || seen.has(value)) return true;
   seen.add(value);
   if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:70:7
   if (value === null) return true;
   if (typeof value === "string" || typeof value === "boolean") return true;
   if (typeof value === "number") return Number.isFinite(value);
-  if (typeof value !== "object" || seen.has(value)) return false;
+  if (typeof value === "object" || seen.has(value)) return false;
   seen.add(value);
   if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected 'composition-output-shape' to be 'observation-output-shape' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:72:7
   if (typeof value === "number") return Number.isFinite(value);
   if (typeof value !== "object" || seen.has(value)) return false;
   seen.add(value);
-  if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
+  if (true) return value.every((item) => isRendererNeutral(item, seen));
   if (!isRecord(value)) return false;
   return Object.entries(value).every(
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected 'composition-failure' to be 'observation-output-shape' // Object.is equality

[Survived] ConditionalExpression
core/src/runtime/graph-publisher.ts:72:7
   if (typeof value === "number") return Number.isFinite(value);
   if (typeof value !== "object" || seen.has(value)) return false;
   seen.add(value);
-  if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
+  if (false) return value.every((item) => isRendererNeutral(item, seen));
   if (!isRecord(value)) return false;
   return Object.entries(value).every(

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:73:7
   if (typeof value !== "object" || seen.has(value)) return false;
   seen.add(value);
   if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
-  if (!isRecord(value)) return false;
+  if (true) return false;
   return Object.entries(value).every(
     ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] BooleanLiteral
core/src/runtime/graph-publisher.ts:73:7
   if (typeof value !== "object" || seen.has(value)) return false;
   seen.add(value);
   if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
-  if (!isRecord(value)) return false;
+  if (isRecord(value)) return false;
   return Object.entries(value).every(
     ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected {} to deeply equal { node: 'caption/label' }

[Killed] MethodExpression
core/src/runtime/graph-publisher.ts:74:10
   seen.add(value);
   if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
   if (!isRecord(value)) return false;
-  return Object.entries(value).every(
-    ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
-  );
+  return Object.entries(value).some(([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen));
 }
 function validateComposition(values: unknown): asserts values is Readonly<Record<string, unknown>> {
killedBy: GraphPublisher output edges uses canonical edge order when output sources collide
statusReason: expected {} to deeply equal { color: 'b' }

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:75:22
   if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
   if (!isRecord(value)) return false;
   return Object.entries(value).every(
-    ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
+    ([key, item]) => !key.startsWith("_") || isRendererNeutral(item, seen),
   );
 }
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:75:5
   if (Array.isArray(value)) return value.every((item) => isRendererNeutral(item, seen));
   if (!isRecord(value)) return false;
   return Object.entries(value).every(
-    ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
+    () => undefined,
   );
 }
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:78:100
     ([key, item]) => !key.startsWith("_") && isRendererNeutral(item, seen),
   );
 }
-function validateComposition(values: unknown): asserts values is Readonly<Record<string, unknown>> {
-  if (!isRecord(values) || !isRendererNeutral(values))
-    throw new CompositionOutputError(
-      "Composition output must contain only renderer-neutral values.",
-    );
-}
+function validateComposition(values: unknown): asserts values is Readonly<Record<string, unknown>> {}
 function mergeValues(
   base: Readonly<Record<string, unknown>>,
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:79:7
   );
 }
 function validateComposition(values: unknown): asserts values is Readonly<Record<string, unknown>> {
-  if (!isRecord(values) || !isRendererNeutral(values))
+  if (!isRecord(values) && !isRendererNeutral(values))
     throw new CompositionOutputError(
       "Composition output must contain only renderer-neutral values.",
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:79:7
   );
 }
 function validateComposition(values: unknown): asserts values is Readonly<Record<string, unknown>> {
-  if (!isRecord(values) || !isRendererNeutral(values))
+  if (false)
     throw new CompositionOutputError(
       "Composition output must contain only renderer-neutral values.",
killedBy: composition and output-shape diagnostics does not publish malformed composition values as ready patches
statusReason: expected 'ready' to be 'error' // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:87:38
 function mergeValues(
   base: Readonly<Record<string, unknown>>,
   overlay: Readonly<Record<string, unknown>> | undefined,
-): Readonly<Record<string, unknown>> {
-  return overlay === undefined ? base : Object.freeze({ ...base, ...overlay });
-}
+): Readonly<Record<string, unknown>> {}
 function projectValues(
   source: Readonly<Record<string, unknown>>,
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:88:10
   base: Readonly<Record<string, unknown>>,
   overlay: Readonly<Record<string, unknown>> | undefined,
 ): Readonly<Record<string, unknown>> {
-  return overlay === undefined ? base : Object.freeze({ ...base, ...overlay });
+  return overlay !== undefined ? base : Object.freeze({ ...base, ...overlay });
 }
 function projectValues(
killedBy: GraphPublisher output edges merges output source values over the composed patch
statusReason: expected { x: 10 } to deeply equal { opacity: 0.5, x: 10 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:88:10
   base: Readonly<Record<string, unknown>>,
   overlay: Readonly<Record<string, unknown>> | undefined,
 ): Readonly<Record<string, unknown>> {
-  return overlay === undefined ? base : Object.freeze({ ...base, ...overlay });
+  return true ? base : Object.freeze({ ...base, ...overlay });
 }
 function projectValues(
killedBy: GraphPublisher output edges merges output source values over the composed patch
statusReason: expected { x: 10 } to deeply equal { opacity: 0.5, x: 10 }

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:93:38
 function projectValues(
   source: Readonly<Record<string, unknown>>,
   projection: InputProjection | undefined,
-): Readonly<Record<string, unknown>> {
-  if (projection === undefined) return source;
-  if (projection.pick !== undefined)
-    return Object.fromEntries(
-      projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
-    );
-  if (projection.map !== undefined)
-    return Object.fromEntries(
-      Object.entries(projection.map)
-        .filter(([sourceKey]) => sourceKey in source)
-        .map(([sourceKey, targetKey]) => [targetKey, source[sourceKey]]),
-    );
-  throw new InputObservationError(
-    "observation-input-shape",
-    "Input projection must define pick or map.",
-  );
-}
+): Readonly<Record<string, unknown>> {}
 
 export class GraphPublisher {
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:94:7
   source: Readonly<Record<string, unknown>>,
   projection: InputProjection | undefined,
 ): Readonly<Record<string, unknown>> {
-  if (projection === undefined) return source;
+  if (projection !== undefined) return source;
   if (projection.pick !== undefined)
     return Object.fromEntries(
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:94:7
   source: Readonly<Record<string, unknown>>,
   projection: InputProjection | undefined,
 ): Readonly<Record<string, unknown>> {
-  if (projection === undefined) return source;
+  if (false) return source;
   if (projection.pick !== undefined)
     return Object.fromEntries(
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:95:7
   projection: InputProjection | undefined,
 ): Readonly<Record<string, unknown>> {
   if (projection === undefined) return source;
-  if (projection.pick !== undefined)
+  if (projection.pick === undefined)
     return Object.fromEntries(
       projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
killedBy: flat projected input observations (X-1) applies an explicit pick projection before merging input keys
statusReason: expected undefined to deeply equal { overlay: 99 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:95:7
   projection: InputProjection | undefined,
 ): Readonly<Record<string, unknown>> {
   if (projection === undefined) return source;
-  if (projection.pick !== undefined)
+  if (true)
     return Object.fromEntries(
       projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected 'composition-failure' to be 'observation-input-collision' // Object.is equality

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:97:30
   if (projection === undefined) return source;
   if (projection.pick !== undefined)
     return Object.fromEntries(
-      projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
+      projection.pick.filter(() => undefined).map((key) => [key, source[key]]),
     );
   if (projection.map !== undefined)
killedBy: flat projected input observations (X-1) applies an explicit pick projection before merging input keys
statusReason: expected {} to deeply equal { overlay: 99 }

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:97:58
   if (projection === undefined) return source;
   if (projection.pick !== undefined)
     return Object.fromEntries(
-      projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
+      projection.pick.filter((key) => key in source).map(() => undefined),
     );
   if (projection.map !== undefined)
killedBy: flat projected input observations (X-1) applies an explicit pick projection before merging input keys
statusReason: expected undefined to deeply equal { overlay: 99 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:99:7
     return Object.fromEntries(
       projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
     );
-  if (projection.map !== undefined)
+  if (false)
     return Object.fromEntries(
       Object.entries(projection.map)
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected 'observation-input-shape' to be 'observation-input-collision' // Object.is equality

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:99:7
     return Object.fromEntries(
       projection.pick.filter((key) => key in source).map((key) => [key, source[key]]),
     );
-  if (projection.map !== undefined)
+  if (projection.map === undefined)
     return Object.fromEntries(
       Object.entries(projection.map)
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected 'observation-input-shape' to be 'observation-input-collision' // Object.is equality

[Survived] MethodExpression
core/src/runtime/graph-publisher.ts:101:7
     );
   if (projection.map !== undefined)
     return Object.fromEntries(
-      Object.entries(projection.map)
-        .filter(([sourceKey]) => sourceKey in source)
+      Object.entries(projection.map)
         .map(([sourceKey, targetKey]) => [targetKey, source[sourceKey]]),
     );

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:102:17
   if (projection.map !== undefined)
     return Object.fromEntries(
       Object.entries(projection.map)
-        .filter(([sourceKey]) => sourceKey in source)
+        .filter(() => undefined)
         .map(([sourceKey, targetKey]) => [targetKey, source[sourceKey]]),
     );
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected undefined to be 'observation-input-collision' // Object.is equality

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:103:14
     return Object.fromEntries(
       Object.entries(projection.map)
         .filter(([sourceKey]) => sourceKey in source)
-        .map(([sourceKey, targetKey]) => [targetKey, source[sourceKey]]),
+        .map(() => undefined),
     );
   throw new InputObservationError(
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected 'composition-failure' to be 'observation-input-collision' // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:113:40
 
 export class GraphPublisher {
   readonly #registry: PatchRegistry;
-  constructor(registry: PatchRegistry) {
-    this.#registry = registry;
-  }
+  constructor(registry: PatchRegistry) {}
   flush(snapshot: PublisherSnapshot, seeds: readonly string[], tick: number): PatchBatch {
     if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'notifying')

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:117:9
     this.#registry = registry;
   }
   flush(snapshot: PublisherSnapshot, seeds: readonly string[], tick: number): PatchBatch {
-    if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (true) throw new Error(REENTRANT_BATCH_MESSAGE);
     const byId = new Map(snapshot.nodes.map((node) => [node.id, node]));
     const dependents = new Map<string, string[]>();
killedBy: flat projected input observations (X-1) merges an upstream record into the observer source object
statusReason: Cannot open a patch batch while subscribers are being notified. Queue one follow-up invalidation instead of recursing.
