[Survived] ConditionalExpression
core/src/runtime/graph-publisher.ts:117:9
     this.#registry = registry;
   }
   flush(snapshot: PublisherSnapshot, seeds: readonly string[], tick: number): PatchBatch {
-    if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (false) throw new Error(REENTRANT_BATCH_MESSAGE);
     const byId = new Map(snapshot.nodes.map((node) => [node.id, node]));
     const dependents = new Map<string, string[]>();

[Survived] ArrayDeclaration
core/src/runtime/graph-publisher.ts:120:64
     if (this.#registry.notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
     const byId = new Map(snapshot.nodes.map((node) => [node.id, node]));
     const dependents = new Map<string, string[]>();
-    for (const node of snapshot.nodes) dependents.set(node.id, []);
+    for (const node of snapshot.nodes) dependents.set(node.id, ["Stryker was here"]);
     for (const node of snapshot.nodes)
       for (const edge of node.edges) dependents.get(edge.sourceId)?.push(node.id);

[Killed] BooleanLiteral
core/src/runtime/graph-publisher.ts:137:13
     this.#registry.beginBatch(tick, seeds);
     try {
       for (const id of snapshot.order) {
-        if (!affected.has(id)) continue;
+        if (affected.has(id)) continue;
         const node = byId.get(id);
         if (node === undefined) continue;
killedBy: GraphPublisher I-5 composes a shared ancestor once and publishes one whole batch
statusReason: expected Map{} to deeply equal Map{ 'root' => 1, 'left' => 1, …(2) }

[Killed] OptionalChaining
core/src/runtime/graph-publisher.ts:140:31
         if (!affected.has(id)) continue;
         const node = byId.get(id);
         if (node === undefined) continue;
-        const sourceFailure = node.edges
-          .filter((edge) => failed.has(edge.sourceId) || blocked.has(edge.sourceId))
-          .sort(compareEdgeKeys)[0]?.sourceId;
+        const sourceFailure = node.edges.filter(edge => failed.has(edge.sourceId) || blocked.has(edge.sourceId)).sort(compareEdgeKeys)[0].sourceId;
         if (sourceFailure !== undefined) {
           blocked.add(id);
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'sourceId')

[Killed] MethodExpression
core/src/runtime/graph-publisher.ts:140:31
         if (!affected.has(id)) continue;
         const node = byId.get(id);
         if (node === undefined) continue;
-        const sourceFailure = node.edges
-          .filter((edge) => failed.has(edge.sourceId) || blocked.has(edge.sourceId))
+        const sourceFailure = node.edges
           .sort(compareEdgeKeys)[0]?.sourceId;
         if (sourceFailure !== undefined) {
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected 'blocked-upstream' to be 'observation-output-shape' // Object.is equality

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:141:29
         const node = byId.get(id);
         if (node === undefined) continue;
         const sourceFailure = node.edges
-          .filter((edge) => failed.has(edge.sourceId) || blocked.has(edge.sourceId))
+          .filter((edge) => failed.has(edge.sourceId) && blocked.has(edge.sourceId))
           .sort(compareEdgeKeys)[0]?.sourceId;
         if (sourceFailure !== undefined) {
killedBy: P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
statusReason: expected undefined to deeply equal [ 'a', 'consumer' ]

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:141:29
         const node = byId.get(id);
         if (node === undefined) continue;
         const sourceFailure = node.edges
-          .filter((edge) => failed.has(edge.sourceId) || blocked.has(edge.sourceId))
+          .filter((edge) => false)
           .sort(compareEdgeKeys)[0]?.sourceId;
         if (sourceFailure !== undefined) {
killedBy: P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
statusReason: expected undefined to deeply equal [ 'a', 'consumer' ]

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:143:42
         const sourceFailure = node.edges
           .filter((edge) => failed.has(edge.sourceId) || blocked.has(edge.sourceId))
           .sort(compareEdgeKeys)[0]?.sourceId;
-        if (sourceFailure !== undefined) {
-          blocked.add(id);
-          this.#registry.publish({
-            nodeId: id,
-            sourceProgress: 0,
-            status: "blocked",
-            diagnostics: [
-              Object.freeze({
-                ruleId: "blocked-upstream",
-                path: id,
-                message: `Blocked by upstream failure at ${sourceFailure}.`,
-                severity: "error",
-                ids: Object.freeze([sourceFailure, id]),
-              }),
-            ],
-          });
-          continue;
-        }
+        if (sourceFailure !== undefined) {}
         try {
           const inputs: Record<string, unknown> = {};
killedBy: P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
statusReason: expected undefined to deeply equal [ 'a', 'consumer' ]

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:143:13
         const sourceFailure = node.edges
           .filter((edge) => failed.has(edge.sourceId) || blocked.has(edge.sourceId))
           .sort(compareEdgeKeys)[0]?.sourceId;
-        if (sourceFailure !== undefined) {
+        if (sourceFailure === undefined) {
           blocked.add(id);
           this.#registry.publish({
killedBy: P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
statusReason: expected 'blocked' to be 'error' // Object.is equality

[Killed] ArrayDeclaration
core/src/runtime/graph-publisher.ts:149:26
             nodeId: id,
             sourceProgress: 0,
             status: "blocked",
-            diagnostics: [
-              Object.freeze({
-                ruleId: "blocked-upstream",
-                path: id,
-                message: `Blocked by upstream failure at ${sourceFailure}.`,
-                severity: "error",
-                ids: Object.freeze([sourceFailure, id]),
-              }),
-            ],
+            diagnostics: [],
           });
           continue;
killedBy: P2 runtime smell hardening chooses the blocked upstream deterministically by edge key, not authored edge order
statusReason: expected undefined to deeply equal [ 'a', 'consumer' ]

[Killed] MethodExpression
core/src/runtime/graph-publisher.ts:165:30
           const inputs: Record<string, unknown> = {};
           const inputKeys = new Map<string, string>();
           const sourceRevisions: Record<string, number> = {};
-          for (const edge of node.edges
-            .filter(({ role }) => role === "input")
+          for (const edge of node.edges
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected 'observation-input-shape' to be 'observation-output-shape' // Object.is equality

[Survived] MethodExpression
core/src/runtime/graph-publisher.ts:165:30
           const inputs: Record<string, unknown> = {};
           const inputKeys = new Map<string, string>();
           const sourceRevisions: Record<string, number> = {};
-          for (const edge of node.edges
-            .filter(({ role }) => role === "input")
-            .sort(compareEdgeKeys)) {
+          for (const edge of node.edges.filter(({
+  role
+}) => role === "input")) {
             const sourcePatch = this.#registry.get(edge.sourceId);
             const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;

[Killed] ArrowFunction
core/src/runtime/graph-publisher.ts:166:21
           const inputKeys = new Map<string, string>();
           const sourceRevisions: Record<string, number> = {};
           for (const edge of node.edges
-            .filter(({ role }) => role === "input")
+            .filter(() => undefined)
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
killedBy: flat projected input observations (X-1) merges an upstream record into the observer source object
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:166:35
           const inputKeys = new Map<string, string>();
           const sourceRevisions: Record<string, number> = {};
           for (const edge of node.edges
-            .filter(({ role }) => role === "input")
+            .filter(({ role }) => role !== "input")
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] OptionalChaining
core/src/runtime/graph-publisher.ts:169:34
             .filter(({ role }) => role === "input")
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
-            const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;
+            const sourceValues = memo.get(edge.sourceId).values ?? sourcePatch?.values;
             if (sourceValues === undefined)
               throw new InputObservationError(
killedBy: GraphPublisher partial-seed inputs uses the last published flat value for an unseeded input source
statusReason: expected { total: 5 } to deeply equal { total: 7 }

[Killed] LogicalOperator
core/src/runtime/graph-publisher.ts:169:34
             .filter(({ role }) => role === "input")
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
-            const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;
+            const sourceValues = memo.get(edge.sourceId)?.values && sourcePatch?.values;
             if (sourceValues === undefined)
               throw new InputObservationError(
killedBy: GraphPublisher partial-seed inputs uses the last published flat value for an unseeded input source
statusReason: expected { total: 5 } to deeply equal { total: 7 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:170:17
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
             const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;
-            if (sourceValues === undefined)
+            if (true)
               throw new InputObservationError(
                 "observation-missing-upstream",
killedBy: GraphPublisher partial-seed inputs uses the last published flat value for an unseeded input source
statusReason: expected undefined to deeply equal { total: 7 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:170:17
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
             const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;
-            if (sourceValues === undefined)
+            if (false)
               throw new InputObservationError(
                 "observation-missing-upstream",
killedBy: P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
statusReason: expected 'observation-input-shape' to be 'observation-missing-upstream' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:175:17
                 "observation-missing-upstream",
                 `Input observation source "${edge.sourceId}" has no published value.`,
               );
-            if (!isRecord(sourceValues))
+            if (true)
               throw new InputObservationError(
                 "observation-input-shape",
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] BooleanLiteral
core/src/runtime/graph-publisher.ts:175:17
                 "observation-missing-upstream",
                 `Input observation source "${edge.sourceId}" has no published value.`,
               );
-            if (!isRecord(sourceValues))
+            if (isRecord(sourceValues))
               throw new InputObservationError(
                 "observation-input-shape",
killedBy: P2 runtime smell hardening derives source revisions from the upstream patches consumed in the flush
statusReason: expected {} to deeply equal { source: 1 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:180:17
                 "observation-input-shape",
                 `Input observation source "${edge.sourceId}" must be a record.`,
               );
-            if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
+            if (false) sourceRevisions[edge.sourceId] = sourcePatch.revision;
             const projected = projectValues(sourceValues, edge.projection);
             for (const [key, value] of Object.entries(projected)) {
killedBy: P2 runtime smell hardening derives source revisions from the upstream patches consumed in the flush
statusReason: expected {} to deeply equal { source: 1 }

[Survived] ConditionalExpression
core/src/runtime/graph-publisher.ts:180:17
                 "observation-input-shape",
                 `Input observation source "${edge.sourceId}" must be a record.`,
               );
-            if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
+            if (true) sourceRevisions[edge.sourceId] = sourcePatch.revision;
             const projected = projectValues(sourceValues, edge.projection);
             for (const [key, value] of Object.entries(projected)) {

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:182:67
               );
             if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
             const projected = projectValues(sourceValues, edge.projection);
-            for (const [key, value] of Object.entries(projected)) {
-              const previous = inputKeys.get(key);
-              if (previous !== undefined)
-                throw new InputObservationError(
-                  "observation-input-collision",
-                  `Input key "${key}" from ${edgeKey(edge)} collides with ${previous}.`,
-                );
-              inputKeys.set(key, edgeKey(edge));
-              inputs[key] = value;
-            }
+            for (const [key, value] of Object.entries(projected)) {}
           }
           const composed = node.compose(inputs);
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected {} to deeply equal { base: 1, overlay: 99 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:184:19
             const projected = projectValues(sourceValues, edge.projection);
             for (const [key, value] of Object.entries(projected)) {
               const previous = inputKeys.get(key);
-              if (previous !== undefined)
+              if (true)
                 throw new InputObservationError(
                   "observation-input-collision",
killedBy: P2 runtime smell hardening derives source revisions from the upstream patches consumed in the flush
statusReason: expected {} to deeply equal { source: 1 }

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:184:19
             const projected = projectValues(sourceValues, edge.projection);
             for (const [key, value] of Object.entries(projected)) {
               const previous = inputKeys.get(key);
-              if (previous !== undefined)
+              if (false)
                 throw new InputObservationError(
                   "observation-input-collision",
killedBy: flat projected input observations (X-1) rejects colliding projected keys instead of silently overwriting
statusReason: expected undefined to be 'observation-input-collision' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:197:35
           validateComposition(composed.values);
           let values = composed.values;
           for (const edge of node.edges
-            .filter(({ role }) => role === "output")
+            .filter(({ role }) => false)
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected { base: 1 } to deeply equal { base: 1, overlay: 99 }

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:198:37
           let values = composed.values;
           for (const edge of node.edges
             .filter(({ role }) => role === "output")
-            .sort(compareEdgeKeys)) {
-            const sourcePatch = this.#registry.get(edge.sourceId);
-            const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;
-            if (sourceValues === undefined)
-              throw new InputObservationError(
-                "observation-missing-upstream",
-                `Output observation source "${edge.sourceId}" has no published value.`,
-              );
-            if (!isRecord(sourceValues) || !isRendererNeutral(sourceValues))
-              throw new OutputObservationError(
-                `Output observation source "${edge.sourceId}" must publish a renderer-neutral record.`,
-              );
-            if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
-            values = mergeValues(values, sourceValues);
-          }
+            .sort(compareEdgeKeys)) {}
           const finalComposition = {
             ...composed,
killedBy: GraphPublisher: memo/registry consistency (recovery A1) a same-flush input-role consumer sees the source's merged flat value
statusReason: expected { base: 1 } to deeply equal { base: 1, overlay: 99 }

[Killed] EqualityOperator
core/src/runtime/graph-publisher.ts:201:17
             .sort(compareEdgeKeys)) {
             const sourcePatch = this.#registry.get(edge.sourceId);
             const sourceValues = memo.get(edge.sourceId)?.values ?? sourcePatch?.values;
-            if (sourceValues === undefined)
+            if (sourceValues !== undefined)
               throw new InputObservationError(
                 "observation-missing-upstream",
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected 'observation-missing-upstream' to be 'observation-output-shape' // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-publisher.ts:206:17
                 "observation-missing-upstream",
                 `Output observation source "${edge.sourceId}" has no published value.`,
               );
-            if (!isRecord(sourceValues) || !isRendererNeutral(sourceValues))
+            if (false)
               throw new OutputObservationError(
                 `Output observation source "${edge.sourceId}" must publish a renderer-neutral record.`,
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected undefined to be 'observation-output-shape' // Object.is equality

[Killed] BooleanLiteral
core/src/runtime/graph-publisher.ts:206:17
                 "observation-missing-upstream",
                 `Output observation source "${edge.sourceId}" has no published value.`,
               );
-            if (!isRecord(sourceValues) || !isRendererNeutral(sourceValues))
+            if (isRecord(sourceValues) || !isRendererNeutral(sourceValues))
               throw new OutputObservationError(
                 `Output observation source "${edge.sourceId}" must publish a renderer-neutral record.`,
killedBy: composition and output-shape diagnostics diagnoses an output observation whose source has already published a non-record value
statusReason: expected undefined to be 'observation-output-shape' // Object.is equality

[Killed] ObjectLiteral
core/src/runtime/graph-publisher.ts:213:36
             if (sourcePatch) sourceRevisions[edge.sourceId] = sourcePatch.revision;
             values = mergeValues(values, sourceValues);
           }
-          const finalComposition = {
-            ...composed,
-            values,
-            sourceRevisions: { ...composed.sourceRevisions, ...sourceRevisions },
-          };
+          const finalComposition = {};
           memo.set(id, finalComposition);
           this.#registry.publish({
killedBy: P2 runtime smell hardening derives source revisions from the upstream patches consumed in the flush
statusReason: expected {} to deeply equal { source: 1 }

[Killed] ObjectLiteral
core/src/runtime/graph-publisher.ts:216:30
           const finalComposition = {
             ...composed,
             values,
-            sourceRevisions: { ...composed.sourceRevisions, ...sourceRevisions },
+            sourceRevisions: {},
           };
           memo.set(id, finalComposition);
killedBy: P2 runtime smell hardening derives source revisions from the upstream patches consumed in the flush
statusReason: expected {} to deeply equal { source: 1 }

[Killed] StringLiteral
core/src/runtime/graph-publisher.ts:224:21
             values,
             sourceProgress: composed.sourceProgress,
             sourceRevisions: finalComposition.sourceRevisions,
-            status: "ready",
+            status: "",
             diagnostics: [],
           });
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 5e-11

[Killed] StringLiteral
core/src/runtime/graph-publisher.ts:233:21
           this.#registry.publish({
             nodeId: id,
             sourceProgress: 0,
-            status: "error",
+            status: "",
             diagnostics: [failure],
           });
killedBy: P2 runtime smell hardening reports a missing upstream instead of silently composing with an input hole
statusReason: expected '' to be 'error' // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-publisher.ts:239:21
         }
       }
       return this.#registry.closeBatch();
-    } catch (error) {
-      try {
-        this.#registry.closeBatch();
-      } catch {
-        /* preserve original flush failure */
-      }
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: subscriber-triggered reentrancy (recovery A3) rejects a direct publisher flush from inside a subscriber and stays reusable
statusReason: expected [Function] to throw an error

[Survived] BlockStatement
core/src/runtime/graph-publisher.ts:240:11
       }
       return this.#registry.closeBatch();
     } catch (error) {
-      try {
-        this.#registry.closeBatch();
-      } catch {
+      try {} catch {
         /* preserve original flush failure */
       }
