[Killed] StringLiteral
core/src/runtime/graph-runtime.ts:14:35
 
 export const DEFERRED_FLUSH_RULE = "reentrant-flush-deferred";
 export const CLOCK_REGRESSION_RULE = "clock-tick-regression";
-export const FLUSH_FAILURE_RULE = "flush-failure";
+export const FLUSH_FAILURE_RULE = "";
 export const SCHEDULER_FAILURE_RULE = "scheduler-failure";
 
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected [ '' ] to deeply equal [ 'flush-failure' ]

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:21:80
   readonly scheduler?: Scheduler;
   readonly onFlushError?: (diagnostic: Diagnostic) => void;
 }
-function deferredBatch(sequence: number, seeds: readonly string[]): PatchBatch {
-  const ids = Object.freeze([...seeds]);
-  const diagnostic: Diagnostic = Object.freeze({
-    ruleId: DEFERRED_FLUSH_RULE,
-    path: ids[0] ?? "",
-    message:
-      "A flush requested while subscribers were being notified was queued as one follow-up " +
-      "invalidation for the scheduler.",
-    severity: "warning",
-    ids,
-  });
-  return Object.freeze({
-    tick: sequence,
-    seeds: ids,
-    patches: Object.freeze([]),
-    diagnostics: Object.freeze([diagnostic]),
-  }) as PatchBatch;
-}
+function deferredBatch(sequence: number, seeds: readonly string[]): PatchBatch {}
 function describe(error: unknown): string {
   return error instanceof Error ? error.message : String(error);
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Survived] StringLiteral
core/src/runtime/graph-runtime.ts:27:7
     ruleId: DEFERRED_FLUSH_RULE,
     path: ids[0] ?? "",
     message:
-      "A flush requested while subscribers were being notified was queued as one follow-up " +
+      "" +
       "invalidation for the scheduler.",
     severity: "warning",

[Survived] StringLiteral
core/src/runtime/graph-runtime.ts:28:7
     path: ids[0] ?? "",
     message:
       "A flush requested while subscribers were being notified was queued as one follow-up " +
-      "invalidation for the scheduler.",
+      "",
     severity: "warning",
     ids,

[Survived] StringLiteral
core/src/runtime/graph-runtime.ts:29:15
     message:
       "A flush requested while subscribers were being notified was queued as one follow-up " +
       "invalidation for the scheduler.",
-    severity: "warning",
+    severity: "",
     ids,
   });

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:39:43
     diagnostics: Object.freeze([diagnostic]),
   }) as PatchBatch;
 }
-function describe(error: unknown): string {
-  return error instanceof Error ? error.message : String(error);
-}
+function describe(error: unknown): string {}
 
 export class GraphRuntime {
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected 'Flush at tick 1 failed: undefined' to match /subscriber boom/

[Survived] BooleanLiteral
core/src/runtime/graph-runtime.ts:59:21
   #sequence = 0;
   #lastFlushError: Diagnostic | undefined;
   #flushing = false;
-  #scheduledDrain = false;
+  #scheduledDrain = true;
   #disposed = false;
 

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:60:15
   #lastFlushError: Diagnostic | undefined;
   #flushing = false;
   #scheduledDrain = false;
-  #disposed = false;
+  #disposed = true;
 
   constructor(
killedBy: composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
statusReason: GraphRuntime is disposed.

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:67:5
     clock: Clock,
     compose: ComposeResolver,
     options: GraphRuntimeOptions = {},
-  ) {
-    this.#binding = new GraphBinding(project);
-    this.#registry = new PatchRegistry();
-    this.#publisher = new GraphPublisher(this.#registry);
-    this.#clock = clock;
-    this.#compose = compose;
-    this.#scheduler = options.scheduler;
-    this.#onFlushError = options.onFlushError;
-    this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
-  }
+  ) {}
   get binding(): GraphBinding {
     return this.#binding;
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: Cannot read properties of undefined (reading 'graph')

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:77:31
     this.#onFlushError = options.onFlushError;
     this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
-  get binding(): GraphBinding {
-    return this.#binding;
-  }
+  get binding(): GraphBinding {}
   get state() {
     return this.#binding.state;
killedBy: GraphRuntime I-13 owns one registry, one state, and one clock subscription
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:86:22
   get registry(): PatchRegistry {
     return this.#registry;
   }
-  get tick(): number {
-    return this.#lastTick;
-  }
+  get tick(): number {}
   get sequence(): number {
     return this.#sequence;
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:89:26
   get tick(): number {
     return this.#lastTick;
   }
-  get sequence(): number {
-    return this.#sequence;
-  }
+  get sequence(): number {}
   get lastFlushError(): Diagnostic | undefined {
     return this.#lastFlushError;
killedBy: clock and batch identity are independent (P0-1) separates the clock's frame number from batch identity
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:92:48
   get sequence(): number {
     return this.#sequence;
   }
-  get lastFlushError(): Diagnostic | undefined {
-    return this.#lastFlushError;
-  }
+  get lastFlushError(): Diagnostic | undefined {}
   get memberCount(): number {
     return this.#members.size;
killedBy: scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure
statusReason: expected undefined to be 'scheduler-failure' // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:98:41
   get memberCount(): number {
     return this.#members.size;
   }
-  get pendingSeeds(): readonly string[] {
-    return [...this.#pendingSeeds];
-  }
+  get pendingSeeds(): readonly string[] {}
 
   attach(nodeId: string): void {
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrayDeclaration
core/src/runtime/graph-runtime.ts:99:12
     return this.#members.size;
   }
   get pendingSeeds(): readonly string[] {
-    return [...this.#pendingSeeds];
+    return [];
   }
 
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 'caption/label' ]

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:115:9
 
   flush(seeds: readonly string[] = [...this.#members], tick?: number): PatchBatch {
     this.#assertLive();
-    if (this.#flushing) {
+    if (true) {
       for (const seed of seeds) this.#pendingSeeds.add(seed);
       this.#scheduleDrain();
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:115:9
 
   flush(seeds: readonly string[] = [...this.#members], tick?: number): PatchBatch {
     this.#assertLive();
-    if (this.#flushing) {
+    if (false) {
       for (const seed of seeds) this.#pendingSeeds.add(seed);
       this.#scheduleDrain();
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected undefined to deeply equal []

[Killed] EqualityOperator
core/src/runtime/graph-runtime.ts:120:9
       this.#scheduleDrain();
       return deferredBatch(this.#sequence, seeds);
     }
-    if (tick !== undefined) {
+    if (tick === undefined) {
       if (!Number.isFinite(tick)) throw new TypeError("Runtime ticks must be finite.");
       if (tick < this.#lastTick) throw new RangeError("Runtime ticks must be monotonic.");
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:127:28
     }
     const carried = [...this.#pendingSeeds];
     this.#pendingSeeds.clear();
-    this.#scheduledDrain = false;
+    this.#scheduledDrain = true;
     const effectiveSeeds = [...new Set([...seeds, ...carried])];
     const graph = this.#binding.graph;
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Killed] ArrayDeclaration
core/src/runtime/graph-runtime.ts:128:28
     const carried = [...this.#pendingSeeds];
     this.#pendingSeeds.clear();
     this.#scheduledDrain = false;
-    const effectiveSeeds = [...new Set([...seeds, ...carried])];
+    const effectiveSeeds = [];
     const graph = this.#binding.graph;
     const nodes = graph.nodes.map((node) => {
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected [] to deeply equal [ 'flush-failure' ]

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:130:45
     this.#scheduledDrain = false;
     const effectiveSeeds = [...new Set([...seeds, ...carried])];
     const graph = this.#binding.graph;
-    const nodes = graph.nodes.map((node) => {
-      const cached = this.#publisherNodes.get(node);
-      if (cached) return cached;
-      const publisherNode = Object.freeze({ ...node, compose: this.#compose(node) });
-      this.#publisherNodes.set(node, publisherNode);
-      return publisherNode;
-    });
+    const nodes = graph.nodes.map((node) => {});
     const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [node.id, node])));
     this.#sequence += 1;
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:132:11
     const graph = this.#binding.graph;
     const nodes = graph.nodes.map((node) => {
       const cached = this.#publisherNodes.get(node);
-      if (cached) return cached;
+      if (true) return cached;
       const publisherNode = Object.freeze({ ...node, compose: this.#compose(node) });
       this.#publisherNodes.set(node, publisherNode);
killedBy: GraphRuntime membership starts empty and publishes only attached nodes by default
statusReason: Cannot read properties of undefined (reading 'id')

[Survived] ConditionalExpression
core/src/runtime/graph-runtime.ts:132:11
     const graph = this.#binding.graph;
     const nodes = graph.nodes.map((node) => {
       const cached = this.#publisherNodes.get(node);
-      if (cached) return cached;
+      if (false) return cached;
       const publisherNode = Object.freeze({ ...node, compose: this.#compose(node) });
       this.#publisherNodes.set(node, publisherNode);

[Killed] ObjectLiteral
core/src/runtime/graph-runtime.ts:133:43
     const nodes = graph.nodes.map((node) => {
       const cached = this.#publisherNodes.get(node);
       if (cached) return cached;
-      const publisherNode = Object.freeze({ ...node, compose: this.#compose(node) });
+      const publisherNode = Object.freeze({});
       this.#publisherNodes.set(node, publisherNode);
       return publisherNode;
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: node.edges is not iterable

[Killed] ArrowFunction
core/src/runtime/graph-runtime.ts:137:65
       this.#publisherNodes.set(node, publisherNode);
       return publisherNode;
     });
-    const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [node.id, node])));
+    const nodeById = Object.freeze(Object.fromEntries(nodes.map(() => undefined)));
     this.#sequence += 1;
     this.#flushing = true;
killedBy: GraphRuntime membership starts empty and publishes only attached nodes by default
statusReason: Iterator value undefined is not an entry object

[Survived] ArrayDeclaration
core/src/runtime/graph-runtime.ts:137:75
       this.#publisherNodes.set(node, publisherNode);
       return publisherNode;
     });
-    const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [node.id, node])));
+    const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [])));
     this.#sequence += 1;
     this.#flushing = true;

[Killed] AssignmentOperator
core/src/runtime/graph-runtime.ts:138:5
       return publisherNode;
     });
     const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [node.id, node])));
-    this.#sequence += 1;
+    this.#sequence -= 1;
     this.#flushing = true;
     try {
killedBy: clock and batch identity are independent (P0-1) separates the clock's frame number from batch identity
statusReason: expected -3 to be 3 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:140:9
     const nodeById = Object.freeze(Object.fromEntries(nodes.map((node) => [node.id, node])));
     this.#sequence += 1;
     this.#flushing = true;
-    try {
-      return this.#publisher.flush(
-        Object.freeze({ ...graph, nodes: Object.freeze(nodes), nodeById }),
-        effectiveSeeds,
-        this.#sequence,
-      );
-    } catch (error) {
+    try {} catch (error) {
       for (const seed of effectiveSeeds) this.#pendingSeeds.add(seed);
       throw error;
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [] to deeply equal [ 'caption/label' ]

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:146:21
         effectiveSeeds,
         this.#sequence,
       );
-    } catch (error) {
-      for (const seed of effectiveSeeds) this.#pendingSeeds.add(seed);
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       this.#flushing = false;
       if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
killedBy: clock and batch identity are independent (P0-1) reports a failed flush as a diagnostic instead of propagating it into the clock
statusReason: expected [] to deeply equal [ 'flush-failure' ]

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:149:15
     } catch (error) {
       for (const seed of effectiveSeeds) this.#pendingSeeds.add(seed);
       throw error;
-    } finally {
-      this.#flushing = false;
-      if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
-    }
+    } finally {}
   }
   invalidate(seeds: readonly string[]): PatchBatch {
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ConditionalExpression
core/src/runtime/graph-runtime.ts:151:11
       throw error;
     } finally {
       this.#flushing = false;
-      if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
+      if (true) this.#scheduleDrain();
     }
   }

[Survived] ConditionalExpression
core/src/runtime/graph-runtime.ts:151:11
       throw error;
     } finally {
       this.#flushing = false;
-      if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
+      if (false) this.#scheduleDrain();
     }
   }

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:154:52
       if (this.#pendingSeeds.size > 0) this.#scheduleDrain();
     }
   }
-  invalidate(seeds: readonly string[]): PatchBatch {
-    this.#assertLive();
-    return this.flush(seeds);
-  }
+  invalidate(seeds: readonly string[]): PatchBatch {}
   dispose(): void {
     if (this.#disposed) return;
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'patches')

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:158:19
     this.#assertLive();
     return this.flush(seeds);
   }
-  dispose(): void {
-    if (this.#disposed) return;
-    this.#disposed = true;
-    this.#unsubscribe();
-    this.#members.clear();
-    this.#pendingSeeds.clear();
-    this.#publisherNodes.clear();
-    this.#scheduledDrain = false;
-  }
+  dispose(): void {}
   #scheduleDrain(): void {
     if (this.#scheduler === undefined || this.#scheduledDrain || this.#disposed) return;
killedBy: GraphRuntime publishes only attached seeds and stops after disposal
statusReason: expected [ [ 'hero/arm', '~/cursor' ], …(2) ] to have a length of 2 but got 3

[Survived] BooleanLiteral
core/src/runtime/graph-runtime.ts:165:28
     this.#members.clear();
     this.#pendingSeeds.clear();
     this.#publisherNodes.clear();
-    this.#scheduledDrain = false;
+    this.#scheduledDrain = true;
   }
   #scheduleDrain(): void {

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:167:26
     this.#publisherNodes.clear();
     this.#scheduledDrain = false;
   }
-  #scheduleDrain(): void {
-    if (this.#scheduler === undefined || this.#scheduledDrain || this.#disposed) return;
-    this.#scheduledDrain = true;
-    try {
-      this.#scheduler.schedule(() => {
-        this.#scheduledDrain = false;
-        if (this.#disposed || this.#pendingSeeds.size === 0) return;
-        try {
-          this.flush([]);
-        } catch (error) {
-          this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
-        }
-      });
-    } catch (error) {
-      this.#scheduledDrain = false;
-      this.#report(SCHEDULER_FAILURE_RULE, `Deferred flush scheduling failed: ${describe(error)}`);
-    }
-  }
+  #scheduleDrain(): void {}
   #onTick(event: ClockTick): void {
     if (this.#disposed) return;
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:168:9
     this.#scheduledDrain = false;
   }
   #scheduleDrain(): void {
-    if (this.#scheduler === undefined || this.#scheduledDrain || this.#disposed) return;
+    if (true) return;
     this.#scheduledDrain = true;
     try {
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Killed] LogicalOperator
core/src/runtime/graph-runtime.ts:168:9
     this.#scheduledDrain = false;
   }
   #scheduleDrain(): void {
-    if (this.#scheduler === undefined || this.#scheduledDrain || this.#disposed) return;
+    if ((this.#scheduler === undefined || this.#scheduledDrain) && this.#disposed) return;
     this.#scheduledDrain = true;
     try {
killedBy: scheduler-driven reentrancy (P1-7/P1-8) coalesces repeated invalidations into one scheduled follow-up
statusReason: expected [ { job: [Function], …(3) }, …(3) ] to have a length of 1 but got 4

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:169:28
   }
   #scheduleDrain(): void {
     if (this.#scheduler === undefined || this.#scheduledDrain || this.#disposed) return;
-    this.#scheduledDrain = true;
+    this.#scheduledDrain = false;
     try {
       this.#scheduler.schedule(() => {
killedBy: scheduler-driven reentrancy (P1-7/P1-8) coalesces repeated invalidations into one scheduled follow-up
statusReason: expected [ { job: [Function], …(3) }, …(3) ] to have a length of 1 but got 4

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:170:9
   #scheduleDrain(): void {
     if (this.#scheduler === undefined || this.#scheduledDrain || this.#disposed) return;
     this.#scheduledDrain = true;
-    try {
-      this.#scheduler.schedule(() => {
-        this.#scheduledDrain = false;
-        if (this.#disposed || this.#pendingSeeds.size === 0) return;
-        try {
-          this.flush([]);
-        } catch (error) {
-          this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
-        }
-      });
-    } catch (error) {
+    try {} catch (error) {
       this.#scheduledDrain = false;
       this.#report(SCHEDULER_FAILURE_RULE, `Deferred flush scheduling failed: ${describe(error)}`);
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:171:38
     if (this.#scheduler === undefined || this.#scheduledDrain || this.#disposed) return;
     this.#scheduledDrain = true;
     try {
-      this.#scheduler.schedule(() => {
-        this.#scheduledDrain = false;
-        if (this.#disposed || this.#pendingSeeds.size === 0) return;
-        try {
-          this.flush([]);
-        } catch (error) {
-          this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
-        }
-      });
+      this.#scheduler.schedule(() => {});
     } catch (error) {
       this.#scheduledDrain = false;
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Survived] BooleanLiteral
core/src/runtime/graph-runtime.ts:172:32
     this.#scheduledDrain = true;
     try {
       this.#scheduler.schedule(() => {
-        this.#scheduledDrain = false;
+        this.#scheduledDrain = true;
         if (this.#disposed || this.#pendingSeeds.size === 0) return;
         try {

[Killed] EqualityOperator
core/src/runtime/graph-runtime.ts:173:31
     try {
       this.#scheduler.schedule(() => {
         this.#scheduledDrain = false;
-        if (this.#disposed || this.#pendingSeeds.size === 0) return;
+        if (this.#disposed || this.#pendingSeeds.size !== 0) return;
         try {
           this.flush([]);
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:173:13
     try {
       this.#scheduler.schedule(() => {
         this.#scheduledDrain = false;
-        if (this.#disposed || this.#pendingSeeds.size === 0) return;
+        if (true) return;
         try {
           this.flush([]);
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:174:13
       this.#scheduler.schedule(() => {
         this.#scheduledDrain = false;
         if (this.#disposed || this.#pendingSeeds.size === 0) return;
-        try {
-          this.flush([]);
-        } catch (error) {
+        try {} catch (error) {
           this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
         }
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [ 'caption/label' ] to deeply equal []

[NoCoverage] BlockStatement
core/src/runtime/graph-runtime.ts:176:25
         if (this.#disposed || this.#pendingSeeds.size === 0) return;
         try {
           this.flush([]);
-        } catch (error) {
-          this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
-        }
+        } catch (error) {}
       });
     } catch (error) {

[NoCoverage] StringLiteral
core/src/runtime/graph-runtime.ts:177:44
         try {
           this.flush([]);
         } catch (error) {
-          this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
+          this.#report(FLUSH_FAILURE_RULE, ``);
         }
       });

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:180:21
           this.#report(FLUSH_FAILURE_RULE, `Scheduled flush failed: ${describe(error)}`);
         }
       });
-    } catch (error) {
-      this.#scheduledDrain = false;
-      this.#report(SCHEDULER_FAILURE_RULE, `Deferred flush scheduling failed: ${describe(error)}`);
-    }
+    } catch (error) {}
   }
   #onTick(event: ClockTick): void {
killedBy: scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
core/src/runtime/graph-runtime.ts:181:30
         }
       });
     } catch (error) {
-      this.#scheduledDrain = false;
+      this.#scheduledDrain = true;
       this.#report(SCHEDULER_FAILURE_RULE, `Deferred flush scheduling failed: ${describe(error)}`);
     }
killedBy: scheduler-driven reentrancy (P1-7/P1-8) retries scheduling after a synchronous scheduler failure
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
core/src/runtime/graph-runtime.ts:185:35
       this.#report(SCHEDULER_FAILURE_RULE, `Deferred flush scheduling failed: ${describe(error)}`);
     }
   }
-  #onTick(event: ClockTick): void {
-    if (this.#disposed) return;
-    if (event.tick <= this.#lastTick) {
-      this.#report(
-        CLOCK_REGRESSION_RULE,
-        `Clock tick ${event.tick} did not advance past ${this.#lastTick}.`,
-      );
-      return;
-    }
-    try {
-      this.flush([...this.#members], event.tick);
-    } catch (error) {
-      this.#report(FLUSH_FAILURE_RULE, `Flush at tick ${event.tick} failed: ${describe(error)}`);
-    }
-  }
+  #onTick(event: ClockTick): void {}
   #report(ruleId: string, message: string): void {
     const diagnostic: Diagnostic = Object.freeze({
killedBy: GraphRuntime I-13 keeps ticks monotonic across detach and reattach
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
core/src/runtime/graph-runtime.ts:187:9
   }
   #onTick(event: ClockTick): void {
     if (this.#disposed) return;
-    if (event.tick <= this.#lastTick) {
+    if (true) {
       this.#report(
         CLOCK_REGRESSION_RULE,
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
core/src/runtime/graph-runtime.ts:187:9
   }
   #onTick(event: ClockTick): void {
     if (this.#disposed) return;
-    if (event.tick <= this.#lastTick) {
+    if (event.tick > this.#lastTick) {
       this.#report(
         CLOCK_REGRESSION_RULE,
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] StringLiteral
core/src/runtime/graph-runtime.ts:190:9
     if (event.tick <= this.#lastTick) {
       this.#report(
         CLOCK_REGRESSION_RULE,
-        `Clock tick ${event.tick} did not advance past ${this.#lastTick}.`,
+        ``,
       );
       return;
