[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:21:7
   "Queue one follow-up invalidation instead of recursing.";
 
 function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {
-  if (value === null || typeof value !== "object") return value;
+  if (value === null && typeof value !== "object") return value;
   if (seen.has(value)) return value;
   seen.add(value);
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Invalid value used in weak set

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:21:25
   "Queue one follow-up invalidation instead of recursing.";
 
 function deepFreeze<T>(value: T, seen = new WeakSet<object>()): T {
-  if (value === null || typeof value !== "object") return value;
+  if (value === null || false) return value;
   if (seen.has(value)) return value;
   seen.add(value);
killedBy: PatchRegistry I-7 deeply freezes published patches and batches
statusReason: Invalid value used in weak set

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:27:95
   for (const child of Object.values(value)) deepFreeze(child, seen);
   return Object.freeze(value);
 }
-function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {
-  if (a === undefined || b === undefined) return a === b;
-  if (a.length !== b.length) return false;
-  return a.every((id, index) => id === b[index]);
-}
+function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {}
 function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
   return (
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:28:7
   return Object.freeze(value);
 }
 function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {
-  if (a === undefined || b === undefined) return a === b;
+  if (true) return a === b;
   if (a.length !== b.length) return false;
   return a.every((id, index) => id === b[index]);
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:28:26
   return Object.freeze(value);
 }
 function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {
-  if (a === undefined || b === undefined) return a === b;
+  if (a === undefined || b !== undefined) return a === b;
   if (a.length !== b.length) return false;
   return a.every((id, index) => id === b[index]);
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:29:7
 }
 function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {
   if (a === undefined || b === undefined) return a === b;
-  if (a.length !== b.length) return false;
+  if (a.length === b.length) return false;
   return a.every((id, index) => id === b[index]);
 }
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:29:7
 }
 function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {
   if (a === undefined || b === undefined) return a === b;
-  if (a.length !== b.length) return false;
+  if (true) return false;
   return a.every((id, index) => id === b[index]);
 }
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:30:33
 function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {
   if (a === undefined || b === undefined) return a === b;
   if (a.length !== b.length) return false;
-  return a.every((id, index) => id === b[index]);
+  return a.every((id, index) => id !== b[index]);
 }
 function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:30:33
 function sameIds(a: readonly string[] | undefined, b: readonly string[] | undefined): boolean {
   if (a === undefined || b === undefined) return a === b;
   if (a.length !== b.length) return false;
-  return a.every((id, index) => id === b[index]);
+  return a.every((id, index) => false);
 }
 function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:32:64
   if (a.length !== b.length) return false;
   return a.every((id, index) => id === b[index]);
 }
-function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
-  return (
-    a.ruleId === b.ruleId &&
-    a.path === b.path &&
-    a.message === b.message &&
-    a.severity === b.severity &&
-    sameIds(a.ids, b.ids)
-  );
-}
+function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {}
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
   if (a.length !== b.length) return false;
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:34:5
 }
 function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
   return (
-    a.ruleId === b.ruleId &&
-    a.path === b.path &&
-    a.message === b.message &&
-    a.severity === b.severity &&
-    sameIds(a.ids, b.ids)
+    false
   );
 }
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:34:5
 }
 function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
   return (
-    a.ruleId === b.ruleId &&
-    a.path === b.path &&
-    a.message === b.message &&
-    a.severity === b.severity &&
-    sameIds(a.ids, b.ids)
+    a.ruleId === b.ruleId && a.path === b.path && a.message === b.message && a.severity === b.severity || sameIds(a.ids, b.ids)
   );
 }
killedBy: PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes
statusReason: expected undefined to be 2 // Object.is equality

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:35:5
 function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
   return (
     a.ruleId === b.ruleId &&
-    a.path === b.path &&
+    a.path !== b.path &&
     a.message === b.message &&
     a.severity === b.severity &&
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Survived] ConditionalExpression
core/src/runtime/patch-registry.ts:35:5
 function sameDiagnostic(a: Diagnostic, b: Diagnostic): boolean {
   return (
     a.ruleId === b.ruleId &&
-    a.path === b.path &&
+    true &&
     a.message === b.message &&
     a.severity === b.severity &&

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:36:5
   return (
     a.ruleId === b.ruleId &&
     a.path === b.path &&
-    a.message === b.message &&
+    a.message !== b.message &&
     a.severity === b.severity &&
     sameIds(a.ids, b.ids)
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Survived] ConditionalExpression
core/src/runtime/patch-registry.ts:36:5
   return (
     a.ruleId === b.ruleId &&
     a.path === b.path &&
-    a.message === b.message &&
+    true &&
     a.severity === b.severity &&
     sameIds(a.ids, b.ids)

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:37:5
     a.ruleId === b.ruleId &&
     a.path === b.path &&
     a.message === b.message &&
-    a.severity === b.severity &&
+    a.severity !== b.severity &&
     sameIds(a.ids, b.ids)
   );
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Survived] ConditionalExpression
core/src/runtime/patch-registry.ts:37:5
     a.ruleId === b.ruleId &&
     a.path === b.path &&
     a.message === b.message &&
-    a.severity === b.severity &&
+    true &&
     sameIds(a.ids, b.ids)
   );

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:41:87
     sameIds(a.ids, b.ids)
   );
 }
-function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
-  if (a.length !== b.length) return false;
-  return a.every((item, index) => {
-    const other = b[index];
-    return other !== undefined && sameDiagnostic(item, other);
-  });
-}
+function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {}
 function samePatch(a: Patch | undefined, b: Patch): boolean {
   return (
killedBy: PatchRegistry: structural change detection (recovery P1-5) suppresses the republish when a freshly allocated nested record is structurally equal
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:42:7
   );
 }
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
-  if (a.length !== b.length) return false;
+  if (a.length === b.length) return false;
   return a.every((item, index) => {
     const other = b[index];
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:42:7
   );
 }
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
-  if (a.length !== b.length) return false;
+  if (true) return false;
   return a.every((item, index) => {
     const other = b[index];
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:43:35
 }
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
   if (a.length !== b.length) return false;
-  return a.every((item, index) => {
-    const other = b[index];
-    return other !== undefined && sameDiagnostic(item, other);
-  });
+  return a.every((item, index) => {});
 }
 function samePatch(a: Patch | undefined, b: Patch): boolean {
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] MethodExpression
core/src/runtime/patch-registry.ts:43:10
 }
 function sameDiagnostics(a: readonly Diagnostic[], b: readonly Diagnostic[]): boolean {
   if (a.length !== b.length) return false;
-  return a.every((item, index) => {
-    const other = b[index];
-    return other !== undefined && sameDiagnostic(item, other);
-  });
+  return a.some((item, index) => {
+  const other = b[index];
+  return other !== undefined && sameDiagnostic(item, other);
+});
 }
 function samePatch(a: Patch | undefined, b: Patch): boolean {
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:45:12
   if (a.length !== b.length) return false;
   return a.every((item, index) => {
     const other = b[index];
-    return other !== undefined && sameDiagnostic(item, other);
+    return other === undefined && sameDiagnostic(item, other);
   });
 }
killedBy: PatchRegistry: structural change detection (recovery P1-5) diagnostics equality is field-wise, so key order is not a change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:45:12
   if (a.length !== b.length) return false;
   return a.every((item, index) => {
     const other = b[index];
-    return other !== undefined && sameDiagnostic(item, other);
+    return other !== undefined || sameDiagnostic(item, other);
   });
 }
killedBy: PatchRegistry: structural change detection (recovery P1-5) republishes when a diagnostic field actually changes
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:48:61
     return other !== undefined && sameDiagnostic(item, other);
   });
 }
-function samePatch(a: Patch | undefined, b: Patch): boolean {
-  return (
-    a !== undefined &&
-    equalValues(a.values, b.values) &&
-    Object.is(a.sourceProgress, b.sourceProgress) &&
-    equalValues(a.sourceRevisions, b.sourceRevisions) &&
-    a.status === b.status &&
-    sameDiagnostics(a.diagnostics, b.diagnostics)
-  );
-}
+function samePatch(a: Patch | undefined, b: Patch): boolean {}
 
 export class PatchRegistry {
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:50:5
 }
 function samePatch(a: Patch | undefined, b: Patch): boolean {
   return (
-    a !== undefined &&
-    equalValues(a.values, b.values) &&
-    Object.is(a.sourceProgress, b.sourceProgress) &&
-    equalValues(a.sourceRevisions, b.sourceRevisions) &&
-    a.status === b.status &&
-    sameDiagnostics(a.diagnostics, b.diagnostics)
+    false
   );
 }
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:50:5
 }
 function samePatch(a: Patch | undefined, b: Patch): boolean {
   return (
-    a !== undefined &&
-    equalValues(a.values, b.values) &&
+    a !== undefined || equalValues(a.values, b.values) &&
     Object.is(a.sourceProgress, b.sourceProgress) &&
     equalValues(a.sourceRevisions, b.sourceRevisions) &&
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'values')

[Killed] EqualityOperator
core/src/runtime/patch-registry.ts:54:5
     equalValues(a.values, b.values) &&
     Object.is(a.sourceProgress, b.sourceProgress) &&
     equalValues(a.sourceRevisions, b.sourceRevisions) &&
-    a.status === b.status &&
+    a.status !== b.status &&
     sameDiagnostics(a.diagnostics, b.diagnostics)
   );
killedBy: PatchRegistry I-8 suppresses unchanged republish and advances revisions only on change
statusReason: expected { nodeId: 'hero/arm', …(6) } to be undefined

[Survived] ConditionalExpression
core/src/runtime/patch-registry.ts:54:5
     equalValues(a.values, b.values) &&
     Object.is(a.sourceProgress, b.sourceProgress) &&
     equalValues(a.sourceRevisions, b.sourceRevisions) &&
-    a.status === b.status &&
+    true &&
     sameDiagnostics(a.diagnostics, b.diagnostics)
   );

[Survived] ArrayDeclaration
core/src/runtime/patch-registry.ts:63:21
   readonly #patches = new Map<string, Patch>();
   readonly #nodeListeners = new Map<string, Set<PatchListener>>();
   readonly #batchListeners = new Set<BatchListener>();
-  #batch: Patch[] = [];
+  #batch: Patch[] = ["Stryker was here"];
   #batchDiagnostics: Diagnostic[] = [];
   #batchTick = 0;

[Survived] ArrayDeclaration
core/src/runtime/patch-registry.ts:66:27
   #batch: Patch[] = [];
   #batchDiagnostics: Diagnostic[] = [];
   #batchTick = 0;
-  #batchSeeds: string[] = [];
+  #batchSeeds: string[] = ["Stryker was here"];
   #batchOpen = false;
   #notifying = false;

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:73:28
   get(nodeId: string): Patch | undefined {
     return this.#patches.get(nodeId);
   }
-  get notifying(): boolean {
-    return this.#notifying;
-  }
+  get notifying(): boolean {}
   beginBatch(tick: number, seeds: readonly string[]): void {
     if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
killedBy: subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:76:60
   get notifying(): boolean {
     return this.#notifying;
   }
-  beginBatch(tick: number, seeds: readonly string[]): void {
-    if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
-    if (this.#batchOpen) throw new Error("A patch batch is already open.");
-    this.#batchOpen = true;
-    this.#batchTick = tick;
-    this.#batchSeeds = [...seeds];
-    this.#batch = [];
-    this.#batchDiagnostics = [];
-  }
+  beginBatch(tick: number, seeds: readonly string[]): void {}
   publish(input: PublishInput): Patch | undefined {
     const previous = this.#patches.get(input.nodeId);
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:77:9
     return this.#notifying;
   }
   beginBatch(tick: number, seeds: readonly string[]): void {
-    if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (true) throw new Error(REENTRANT_BATCH_MESSAGE);
     if (this.#batchOpen) throw new Error("A patch batch is already open.");
     this.#batchOpen = true;
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:77:9
     return this.#notifying;
   }
   beginBatch(tick: number, seeds: readonly string[]): void {
-    if (this.#notifying) throw new Error(REENTRANT_BATCH_MESSAGE);
+    if (false) throw new Error(REENTRANT_BATCH_MESSAGE);
     if (this.#batchOpen) throw new Error("A patch batch is already open.");
     this.#batchOpen = true;
killedBy: subscriber-triggered reentrancy (recovery A3) refuses to open a second batch while subscribers are being notified
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] OptionalChaining
core/src/runtime/patch-registry.ts:87:41
   }
   publish(input: PublishInput): Patch | undefined {
     const previous = this.#patches.get(input.nodeId);
-    const readyValues = input.values ?? previous?.values ?? {};
+    const readyValues = input.values ?? previous.values ?? {};
     const readyProgress =
       input.values === undefined && input.status !== "ready"
killedBy: GraphPublisher I-9 publishes an error and blocks the downstream closure while unrelated branches continue
statusReason: Cannot read properties of undefined (reading 'values')

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:87:25
   }
   publish(input: PublishInput): Patch | undefined {
     const previous = this.#patches.get(input.nodeId);
-    const readyValues = input.values ?? previous?.values ?? {};
+    const readyValues = input.values && previous?.values ?? {};
     const readyProgress =
       input.values === undefined && input.status !== "ready"
killedBy: PatchRegistry: structural change detection (recovery P1-5) republishes when a nested value actually changes
statusReason: expected undefined to be 2 // Object.is equality

[Survived] LogicalOperator
core/src/runtime/patch-registry.ts:89:7
     const previous = this.#patches.get(input.nodeId);
     const readyValues = input.values ?? previous?.values ?? {};
     const readyProgress =
-      input.values === undefined && input.status !== "ready"
+      input.values === undefined || input.status !== "ready"
         ? (previous?.sourceProgress ?? input.sourceProgress)
         : input.sourceProgress;

[Survived] EqualityOperator
core/src/runtime/patch-registry.ts:89:7
     const previous = this.#patches.get(input.nodeId);
     const readyValues = input.values ?? previous?.values ?? {};
     const readyProgress =
-      input.values === undefined && input.status !== "ready"
+      input.values !== undefined && input.status !== "ready"
         ? (previous?.sourceProgress ?? input.sourceProgress)
         : input.sourceProgress;

[Killed] OptionalChaining
core/src/runtime/patch-registry.ts:90:12
     const readyValues = input.values ?? previous?.values ?? {};
     const readyProgress =
       input.values === undefined && input.status !== "ready"
-        ? (previous?.sourceProgress ?? input.sourceProgress)
+        ? (previous.sourceProgress ?? input.sourceProgress)
         : input.sourceProgress;
     const readyRevisions =
killedBy: composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
statusReason: Cannot read properties of undefined (reading 'sourceProgress')

[Survived] LogicalOperator
core/src/runtime/patch-registry.ts:90:12
     const readyValues = input.values ?? previous?.values ?? {};
     const readyProgress =
       input.values === undefined && input.status !== "ready"
-        ? (previous?.sourceProgress ?? input.sourceProgress)
+        ? (previous?.sourceProgress && input.sourceProgress)
         : input.sourceProgress;
     const readyRevisions =

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:93:7
         ? (previous?.sourceProgress ?? input.sourceProgress)
         : input.sourceProgress;
     const readyRevisions =
-      input.values === undefined && input.status !== "ready"
+      true
         ? (previous?.sourceRevisions ?? input.sourceRevisions ?? {})
         : (input.sourceRevisions ?? {});
killedBy: PatchRegistry: structural change detection (recovery P1-5) republishes when only a source revision changes
statusReason: expected undefined to be 2 // Object.is equality

[Survived] EqualityOperator
core/src/runtime/patch-registry.ts:93:7
         ? (previous?.sourceProgress ?? input.sourceProgress)
         : input.sourceProgress;
     const readyRevisions =
-      input.values === undefined && input.status !== "ready"
+      input.values !== undefined && input.status !== "ready"
         ? (previous?.sourceRevisions ?? input.sourceRevisions ?? {})
         : (input.sourceRevisions ?? {});

[Killed] OptionalChaining
core/src/runtime/patch-registry.ts:94:12
         : input.sourceProgress;
     const readyRevisions =
       input.values === undefined && input.status !== "ready"
-        ? (previous?.sourceRevisions ?? input.sourceRevisions ?? {})
+        ? (previous.sourceRevisions ?? input.sourceRevisions ?? {})
         : (input.sourceRevisions ?? {});
     const candidate = {
killedBy: composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
statusReason: Cannot read properties of undefined (reading 'sourceRevisions')

[Survived] LogicalOperator
core/src/runtime/patch-registry.ts:94:12
         : input.sourceProgress;
     const readyRevisions =
       input.values === undefined && input.status !== "ready"
-        ? (previous?.sourceRevisions ?? input.sourceRevisions ?? {})
+        ? ((previous?.sourceRevisions ?? input.sourceRevisions) && {})
         : (input.sourceRevisions ?? {});
     const candidate = {

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:95:12
     const readyRevisions =
       input.values === undefined && input.status !== "ready"
         ? (previous?.sourceRevisions ?? input.sourceRevisions ?? {})
-        : (input.sourceRevisions ?? {});
+        : (input.sourceRevisions && {});
     const candidate = {
       nodeId: input.nodeId,
killedBy: P2 runtime smell hardening derives source revisions from the upstream patches consumed in the flush
statusReason: expected {} to deeply equal { source: 1 }

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:112:70
     this.#batchDiagnostics.push(...patch.diagnostics);
     return patch;
   }
-  subscribeNode(nodeId: string, listener: PatchListener): () => void {
-    const listeners = this.#nodeListeners.get(nodeId) ?? new Set<PatchListener>();
-    listeners.add(listener);
-    this.#nodeListeners.set(nodeId, listeners);
-    return () => listeners.delete(listener);
-  }
+  subscribeNode(nodeId: string, listener: PatchListener): () => void {}
   subscribeBatch(listener: BatchListener): () => void {
     this.#batchListeners.add(listener);
killedBy: scheduler-driven reentrancy (P1-7/P1-8) drains a subscriber invalidation with zero clock ticks
statusReason: expected [] to deeply equal [ 'caption/label' ]

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:118:55
     this.#nodeListeners.set(nodeId, listeners);
     return () => listeners.delete(listener);
   }
-  subscribeBatch(listener: BatchListener): () => void {
-    this.#batchListeners.add(listener);
-    return () => this.#batchListeners.delete(listener);
-  }
+  subscribeBatch(listener: BatchListener): () => void {}
   closeBatch(): PatchBatch {
     if (!this.#batchOpen) throw new Error("No patch batch is open.");
killedBy: subscriber-triggered reentrancy (recovery A3) defers a subscriber-triggered invalidate instead of running it inside the current flush
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ConditionalExpression
core/src/runtime/patch-registry.ts:123:9
     return () => this.#batchListeners.delete(listener);
   }
   closeBatch(): PatchBatch {
-    if (!this.#batchOpen) throw new Error("No patch batch is open.");
+    if (false) throw new Error("No patch batch is open.");
     const batch = deepFreeze({
       tick: this.#batchTick,
killedBy: PatchRegistry rejects opening a second empty batch and closing without an open batch
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
core/src/runtime/patch-registry.ts:131:36
       diagnostics: [...this.#batchDiagnostics],
     }) as PatchBatch;
     const nodeListeners = new Map<string, readonly PatchListener[]>(
-      [...this.#nodeListeners].map(([nodeId, listeners]): [string, readonly PatchListener[]] => [
-        nodeId,
-        [...listeners],
-      ]),
+      [...this.#nodeListeners].map(() => undefined),
     );
     const batchListeners: readonly BatchListener[] = [...this.#batchListeners];
killedBy: PatchRegistry: structural change detection (recovery P1-5) suppresses the republish when a freshly allocated nested record is structurally equal
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
core/src/runtime/patch-registry.ts:133:9
     const nodeListeners = new Map<string, readonly PatchListener[]>(
       [...this.#nodeListeners].map(([nodeId, listeners]): [string, readonly PatchListener[]] => [
         nodeId,
-        [...listeners],
+        [],
       ]),
     );
killedBy: PatchRegistry I-6 notifies node subscribers before batch subscribers and safely snapshots listeners
statusReason: expected [ 'batch' ] to deeply equal [ 'node', 'batch' ]

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:137:23
       ]),
     );
     const batchListeners: readonly BatchListener[] = [...this.#batchListeners];
-    this.#batchOpen = false;
+    this.#batchOpen = true;
     this.#batch = [];
     this.#batchDiagnostics = [];
killedBy: React patch store lifecycle (C1) receives patches again after the last listener leaves and a new one arrives
statusReason: A patch batch is already open.

[Survived] ArrayDeclaration
core/src/runtime/patch-registry.ts:140:24
     this.#batchOpen = false;
     this.#batch = [];
     this.#batchDiagnostics = [];
-    this.#batchSeeds = [];
+    this.#batchSeeds = ["Stryker was here"];
     let firstError: unknown;
     let hasError = false;
