[Killed] BlockStatement
core/src/runtime/patch-registry.ts:144:9
     let firstError: unknown;
     let hasError = false;
     this.#notifying = true;
-    try {
-      for (const patch of batch.patches)
-        for (const listener of nodeListeners.get(patch.nodeId) ?? [])
-          try {
-            listener(patch);
-          } catch (error) {
-            if (!hasError) {
-              hasError = true;
-              firstError = error;
-            }
-          }
-      for (const listener of batchListeners)
-        try {
-          listener(batch);
-        } catch (error) {
-          if (!hasError) {
-            hasError = true;
-            firstError = error;
-          }
-        }
-    } finally {
+    try {} finally {
       this.#notifying = false;
     }
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: expected [ undefined ] to deeply equal [ undefined, 1 ]

[Killed] LogicalOperator
core/src/runtime/patch-registry.ts:146:32
     this.#notifying = true;
     try {
       for (const patch of batch.patches)
-        for (const listener of nodeListeners.get(patch.nodeId) ?? [])
+        for (const listener of nodeListeners.get(patch.nodeId) && [])
           try {
             listener(patch);
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be defined

[Killed] ArrayDeclaration
core/src/runtime/patch-registry.ts:146:67
     this.#notifying = true;
     try {
       for (const patch of batch.patches)
-        for (const listener of nodeListeners.get(patch.nodeId) ?? [])
+        for (const listener of nodeListeners.get(patch.nodeId) ?? ["Stryker was here"])
           try {
             listener(patch);
killedBy: subscriber-triggered reentrancy (recovery A3) runs the queued follow-up exactly once on the next tick and then clears it
statusReason: expected [ 'hero/arm', 'caption/label' ] to deeply equal []

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:147:15
     try {
       for (const patch of batch.patches)
         for (const listener of nodeListeners.get(patch.nodeId) ?? [])
-          try {
-            listener(patch);
-          } catch (error) {
+          try {} catch (error) {
             if (!hasError) {
               hasError = true;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: expected undefined to be defined

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:156:13
             }
           }
       for (const listener of batchListeners)
-        try {
-          listener(batch);
-        } catch (error) {
+        try {} catch (error) {
           if (!hasError) {
             hasError = true;
killedBy: clock and batch identity are independent (P0-1) separates the clock's frame number from batch identity
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[NoCoverage] ConditionalExpression
core/src/runtime/patch-registry.ts:159:15
         try {
           listener(batch);
         } catch (error) {
-          if (!hasError) {
+          if (true) {
             hasError = true;
             firstError = error;

[Killed] BlockStatement
core/src/runtime/patch-registry.ts:164:15
             firstError = error;
           }
         }
-    } finally {
-      this.#notifying = false;
-    }
+    } finally {}
     if (hasError) throw firstError;
     return batch;
killedBy: real end-to-end product path (E2) writes authored GSAP output through a patch into the DOM adapter
statusReason: Cannot open a patch batch while subscribers are being notified. Queue one follow-up invalidation instead of recursing.

[Killed] BooleanLiteral
core/src/runtime/patch-registry.ts:165:25
           }
         }
     } finally {
-      this.#notifying = false;
+      this.#notifying = true;
     }
     if (hasError) throw firstError;
killedBy: React public hook render/update (C2) renders the current patch and updates after publication
statusReason: Cannot open a patch batch while subscribers are being notified. Queue one follow-up invalidation instead of recursing.
