[Killed] BlockStatement
core/src/runtime/project-runtime.ts:22:75
   readonly #disposeComposition: () => void;
   #disposed = false;
 
-  constructor(project: ProjectDefinition, options: ProjectRuntimeOptions) {
-    this.#project = project;
-    this.#setProgress = options.setProgress ?? (() => undefined);
-    this.#disposeComposition = options.disposeComposition ?? (() => undefined);
-    try {
-      this.#graph = new GraphRuntime(project, options.clock, options.compose, {
-        scheduler: options.scheduler,
-      });
-    } catch (error) {
-      this.#disposeComposition();
-      throw error;
-    }
-  }
+  constructor(project: ProjectDefinition, options: ProjectRuntimeOptions) {}
   get project(): ProjectDefinition {
     return this.#project;
killedBy: clock and batch identity are independent (P0-1) keeps the clock running after a seek published without a frame
statusReason: Cannot read properties of undefined (reading 'attach')

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:26:9
     this.#project = project;
     this.#setProgress = options.setProgress ?? (() => undefined);
     this.#disposeComposition = options.disposeComposition ?? (() => undefined);
-    try {
-      this.#graph = new GraphRuntime(project, options.clock, options.compose, {
-        scheduler: options.scheduler,
-      });
-    } catch (error) {
+    try {} catch (error) {
       this.#disposeComposition();
       throw error;
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'attach')

[Killed] BlockStatement
core/src/runtime/project-runtime.ts:30:21
       this.#graph = new GraphRuntime(project, options.clock, options.compose, {
         scheduler: options.scheduler,
       });
-    } catch (error) {
-      this.#disposeComposition();
-      throw error;
-    }
+    } catch (error) {}
   }
   get project(): ProjectDefinition {
killedBy: ProjectRuntime rejects invalid candidates before constructing a replacement runtime
statusReason: expected function to throw an error, but it didn't

[Survived] ArrayDeclaration
core/src/runtime/project-runtime.ts:66:26
   dispose(): void {
     if (this.#disposed) return;
     this.#disposed = true;
-    for (const nodeId of [...this.#instances.keys()]) this.#graph.detach(nodeId);
+    for (const nodeId of []) this.#graph.detach(nodeId);
     this.#instances.clear();
     this.#graph.dispose();
