[NoCoverage] StringLiteral
packages/core/src/domain/motion.ts:41:27
-         throw new TypeError("Motion stagger must be a finite non-negative number.");
+         throw new TypeError("");

[NoCoverage] StringLiteral
packages/core/src/domain/motion.ts:45:25
-           throw new Error(`Duplicate Motion track id: ${entry.id}.`);
+           throw new Error(``);

[NoCoverage] StringLiteral
packages/core/src/domain/motion.ts:47:29
-           throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
+           throw new TypeError(``);

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:66:15
-     get state() {
-       return this.#lifecycle.state;
-     }
+     get state() {}

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:69:17
-     get playing() {
-       return this.#playing;
-     }
+     get playing() {}

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:110:31
-     reflow(): readonly number[] {
-       this.assertActive();
-       return this.schedule();
-     }
+     reflow(): readonly number[] {}

[NoCoverage] BlockStatement
packages/core/src/domain/motion.ts:117:19
-     destroy(): void {
-       this.#lifecycle.destroy();
-     }
+     destroy(): void {}

[Survived] BooleanLiteral
packages/core/src/domain/motion.ts:34:14
-     #playing = false;
+     #playing = true;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:40:9
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (false)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:40:9
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (!Number.isFinite(options.stagger ?? 0) && (options.stagger ?? 0) < 0)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:40:51
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (!Number.isFinite(options.stagger ?? 0) || false)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:40:52
-       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+       if (!Number.isFinite(options.stagger ?? 0) || (options.stagger && 0) < 0)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] BlockStatement
packages/core/src/domain/motion.ts:43:41
-       for (const entry of options.tracks) {
-         if (!entry.id || ids.has(entry.id))
-           throw new Error(`Duplicate Motion track id: ${entry.id}.`);
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
-           throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
-         ids.add(entry.id);
-       }
+       for (const entry of options.tracks) {}
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:44:11
-         if (!entry.id || ids.has(entry.id))
+         if (false)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:44:11
-         if (!entry.id || ids.has(entry.id))
+         if (!entry.id && ids.has(entry.id))
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:46:44
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) && entry.duration <= 0))
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:46:80
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || false))
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
  and 1 more test!

[Survived] EqualityOperator
packages/core/src/domain/motion.ts:46:80
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration < 0))
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:46:11
-         if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+         if (false)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 19 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:62:13
-           if (this.#disposeTracks) for (const track of this.#tracks) track.track.dispose();
+           if (true) for (const track of this.#tracks) track.track.dispose();
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 14 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:88:9
-       if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
+       if (true) this.mount();
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 17 more tests!

[Survived] MethodExpression
packages/core/src/domain/motion.ts:104:35
-       this.#setProgress(Math.max(0, Math.min(1, progress)));
+       this.#setProgress(Math.max(0, Math.max(1, progress)));
Tests ran:
    Motion composite clamps seek and rejects non-finite values

[Survived] OptionalChaining
packages/core/src/domain/motion.ts:108:5
-       this.#trigger?.signal(signal);
+       this.#trigger.signal(signal);
Tests ran:
    Engine routes a manual trigger through the public handle into a published patch
    Motion trigger types and clock ownership manual signals use the same scheduled progress path
    Motion trigger types and clock ownership scroll signals use the same scheduled progress path
  and 2 more tests!

[Survived] BooleanLiteral
packages/core/src/domain/motion.ts:92:21
-       this.#playing = false;
+       this.#playing = true;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 15 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:121:9
-       if (this.#unsubscribe === undefined)
+       if (true)
Tests ran:
    Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:130:9
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (false) return;
Tests ran:
    Engine routes a manual trigger through the public handle into a published patch
    Motion trigger types and clock ownership manual signals use the same scheduled progress path
    Motion trigger types and clock ownership scroll signals use the same scheduled progress path
  and 3 more tests!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:130:9
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (!this.#playing && this.#lifecycle.state !== "mounted") return;
Tests ran:
    Engine routes a manual trigger through the public handle into a published patch
    Motion trigger types and clock ownership manual signals use the same scheduled progress path
    Motion trigger types and clock ownership scroll signals use the same scheduled progress path
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:130:27
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (!this.#playing || false) return;
Tests ran:
    Engine routes a manual trigger through the public handle into a published patch
    Motion trigger types and clock ownership manual signals use the same scheduled progress path
    Motion trigger types and clock ownership scroll signals use the same scheduled progress path
  and 3 more tests!

[Survived] BooleanLiteral
packages/core/src/domain/motion.ts:127:29
-       this.#triggerAttached = true;
+       this.#triggerAttached = false;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 12 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:131:9
-       if (command.setProgress !== undefined) {
+       if (true) {
Tests ran:
    Engine routes a manual trigger through the public handle into a published patch
    Motion trigger types and clock ownership manual signals use the same scheduled progress path
    Motion trigger types and clock ownership scroll signals use the same scheduled progress path
  and 3 more tests!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:141:9
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (false) return;
Tests ran:
    Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 1 more test!

[Survived] LogicalOperator
packages/core/src/domain/motion.ts:141:9
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (!this.#playing && this.#lifecycle.state !== "mounted") return;
Tests ran:
    Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/domain/motion.ts:141:27
-       if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+       if (!this.#playing || false) return;
Tests ran:
    Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
    Motion composite plays through one clock subscription and scheduler jobs
    Motion composite converts clock time into normalized progress using authored duration
  and 1 more test!

[NoCoverage] StringLiteral
packages/core/src/engine.ts:59:11
-           ? "Project failed v5 validation."
+           ? ""

[NoCoverage] StringLiteral
packages/core/src/engine.ts:95:44
-         if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+         if (!definition) throw new TypeError(``);

[NoCoverage] ArrayDeclaration
packages/core/src/engine.ts:147:64
-           const ids = motionTrackIds.get(motionDefinition.id) ?? [];
+           const ids = motionTrackIds.get(motionDefinition.id) ?? ["Stryker was here"];

[NoCoverage] StringLiteral
packages/core/src/engine.ts:150:43
-             if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
+             if (!track) throw new TypeError(``);

[NoCoverage] StringLiteral
packages/core/src/engine.ts:172:42
-           if (!motion) throw new TypeError(`Unknown motion \"${motionId}\".`);
+           if (!motion) throw new TypeError(``);

[Survived] StringLiteral
packages/core/src/engine.ts:52:11
-       .join(" ");
+       .join("");
Tests ran:
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
    X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
    X-3 contribution through the product load path merges contributed keyframes into compiler diagnostics before timeline creation
  and 4 more tests!

[Survived] ArrowFunction
packages/core/src/engine.ts:46:14
-       dispose: () => runtime.dispose(),
+       dispose: () => undefined,
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:58:7
-         result.diagnostics.length === 0
+         false
Tests ran:
    Engine product-load validation (X-1 follow-up) rejects malformed authored stops before constructing a runtime
    Engine product-load validation (X-1 follow-up) rejects malformed authored stops before any timeline is created
    S6 plugin use contract rejects the dead TrackDefinition.use field instead of silently ignoring it

[Survived] LogicalOperator
packages/core/src/engine.ts:56:7
-     if (!result.valid || result.value === null)
+     if (!result.valid && result.value === null)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 14 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:56:24
-     if (!result.valid || result.value === null)
+     if (!result.valid || false)
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 11 more tests!

[Survived] ObjectLiteral
packages/core/src/engine.ts:90:51
-         nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
+         nodes.set(qualifyFreeTrack(track.id).value, {});
Tests ran:
    Engine publishes a progress change through the public project handle
    Engine keeps one clock owner while clock progress publishes once
    Engine still resolves authored-key plugins during progress updates
  and 1 more test!

[Survived] ConditionalExpression
packages/core/src/engine.ts:93:11
-         if (existing) return existing;
+         if (false) return existing;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 11 more tests!

[Survived] StringLiteral
packages/core/src/engine.ts:96:20
-         const path = `${nodeId}.keyframes`;
+         const path = ``;
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 11 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:95:11
-         if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
+         if (false) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
  and 11 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:107:46
-         if (diagnostics.some(({ severity }) => severity === "error"))
+         if (diagnostics.some(({ severity }) => true))
Tests ran:
    X-3 contribution through the product load path rejects malformed contributions during Engine.load
    X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
    X-3 contribution through the product load path merges contributed keyframes into compiler diagnostics before timeline creation
  and 1 more test!

[Survived] ArrayDeclaration
packages/core/src/engine.ts:106:57
-         const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
+         const diagnostics = [...(resolved?.diagnostics ?? ["Stryker was here"]), ...keyframeCompilation.diagnostics];
Tests ran:
    X-3 contribution through the product load path rejects authored ease collisions before any timeline is created
    Engine publishes a progress change through the public project handle
    Engine keeps one clock owner while clock progress publishes once
  and 4 more tests!

[Survived] BlockStatement
packages/core/src/engine.ts:139:35
-           disposeComposition: () => {
-             for (const motion of motions.values()) motion.dispose();
-             motions.clear();
-             for (const track of tracks.values()) track.dispose();
-             tracks.clear();
-           },
+           disposeComposition: () => {},
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:150:15
-             if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
+             if (false) throw new TypeError(`Unknown graph node \"${id}\".`);
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 7 more tests!

[Survived] OptionalChaining
packages/core/src/engine.ts:152:41
-             return { id, track, duration: definition?.duration };
+             return { id, track, duration: definition.duration };
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:163:17
-               if (first) runtime.seek(first, progress);
+               if (true) runtime.seek(first, progress);
Tests ran:
    Engine routes a manual trigger through the public handle into a published patch

[Survived] BooleanLiteral
packages/core/src/engine.ts:159:26
-             disposeTracks: false,
+             disposeTracks: true,
Tests ran:
    X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
    X-3 contribution through the product load path selects one predicate contributor through Engine.load
    composition and output-shape diagnostics diagnoses a plugin returning a non-record composition value
  and 7 more tests!

[Survived] ConditionalExpression
packages/core/src/engine.ts:172:13
-           if (!motion) throw new TypeError(`Unknown motion \"${motionId}\".`);
+           if (false) throw new TypeError(`Unknown motion \"${motionId}\".`);
Tests ran:
    Engine routes a manual trigger through the public handle into a published patch
