[Killed] BooleanLiteral
core/src/domain/motion.ts:37:22
   #playing = false;
   #position = 0;
   #unsubscribe: (() => void) | undefined;
-  #triggerAttached = false;
+  #triggerAttached = true;
 
   constructor(options: MotionOptions) {
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] BooleanLiteral
core/src/domain/motion.ts:40:9
   #triggerAttached = false;
 
   constructor(options: MotionOptions) {
-    if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
+    if (Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
       throw new TypeError("Motion stagger must be a finite non-negative number.");
     const ids = new Set<string>();
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: Motion stagger must be a finite non-negative number.

[NoCoverage] StringLiteral
core/src/domain/motion.ts:41:27
 
   constructor(options: MotionOptions) {
     if (!Number.isFinite(options.stagger ?? 0) || (options.stagger ?? 0) < 0)
-      throw new TypeError("Motion stagger must be a finite non-negative number.");
+      throw new TypeError("");
     const ids = new Set<string>();
     for (const entry of options.tracks) {

[NoCoverage] StringLiteral
core/src/domain/motion.ts:45:25
     const ids = new Set<string>();
     for (const entry of options.tracks) {
       if (!entry.id || ids.has(entry.id))
-        throw new Error(`Duplicate Motion track id: ${entry.id}.`);
+        throw new Error(``);
       if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
         throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);

[Killed] LogicalOperator
core/src/domain/motion.ts:46:11
     for (const entry of options.tracks) {
       if (!entry.id || ids.has(entry.id))
         throw new Error(`Duplicate Motion track id: ${entry.id}.`);
-      if (entry.duration !== undefined && (!Number.isFinite(entry.duration) || entry.duration <= 0))
+      if (entry.duration !== undefined || !Number.isFinite(entry.duration) || entry.duration <= 0)
         throw new TypeError(`Motion track duration must be a finite positive number: ${entry.id}.`);
       ids.add(entry.id);
killedBy: Engine publishes a progress change through the public project handle
statusReason: Motion track duration must be a finite positive number: hero/arm.

[Killed] LogicalOperator
core/src/domain/motion.ts:54:24
     this.#scheduler = options.scheduler;
     this.#tracks = Object.freeze([...options.tracks]);
     this.#trigger = options.trigger;
-    this.#invalidate = options.invalidate ?? (() => undefined);
+    this.#invalidate = options.invalidate && (() => undefined);
     this.#stagger = options.stagger ?? 0;
     this.#disposeTracks = options.disposeTracks ?? true;
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] LogicalOperator
core/src/domain/motion.ts:55:21
     this.#tracks = Object.freeze([...options.tracks]);
     this.#trigger = options.trigger;
     this.#invalidate = options.invalidate ?? (() => undefined);
-    this.#stagger = options.stagger ?? 0;
+    this.#stagger = options.stagger && 0;
     this.#disposeTracks = options.disposeTracks ?? true;
     this.#listenToClock = options.listenToClock ?? true;
killedBy: Motion composite preserves authored order and computes deterministic stagger offsets
statusReason: expected [ +0, +0, +0 ] to deeply equal [ +0, 0.08, 0.16 ]

[Killed] LogicalOperator
core/src/domain/motion.ts:56:27
     this.#trigger = options.trigger;
     this.#invalidate = options.invalidate ?? (() => undefined);
     this.#stagger = options.stagger ?? 0;
-    this.#disposeTracks = options.disposeTracks ?? true;
+    this.#disposeTracks = options.disposeTracks && true;
     this.#listenToClock = options.listenToClock ?? true;
     this.#lifecycle = new Lifecycle({
killedBy: Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
core/src/domain/motion.ts:56:52
     this.#trigger = options.trigger;
     this.#invalidate = options.invalidate ?? (() => undefined);
     this.#stagger = options.stagger ?? 0;
-    this.#disposeTracks = options.disposeTracks ?? true;
+    this.#disposeTracks = options.disposeTracks ?? false;
     this.#listenToClock = options.listenToClock ?? true;
     this.#lifecycle = new Lifecycle({
killedBy: Motion composite pauses and disposes owner-first without leaking clock work
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
core/src/domain/motion.ts:57:27
     this.#invalidate = options.invalidate ?? (() => undefined);
     this.#stagger = options.stagger ?? 0;
     this.#disposeTracks = options.disposeTracks ?? true;
-    this.#listenToClock = options.listenToClock ?? true;
+    this.#listenToClock = options.listenToClock && true;
     this.#lifecycle = new Lifecycle({
       beforeDispose: () => {
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
core/src/domain/motion.ts:57:52
     this.#invalidate = options.invalidate ?? (() => undefined);
     this.#stagger = options.stagger ?? 0;
     this.#disposeTracks = options.disposeTracks ?? true;
-    this.#listenToClock = options.listenToClock ?? true;
+    this.#listenToClock = options.listenToClock ?? false;
     this.#lifecycle = new Lifecycle({
       beforeDispose: () => {
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
core/src/domain/motion.ts:59:28
     this.#disposeTracks = options.disposeTracks ?? true;
     this.#listenToClock = options.listenToClock ?? true;
     this.#lifecycle = new Lifecycle({
-      beforeDispose: () => {
-        this.pause();
-        this.#trigger?.detach();
-        if (this.#disposeTracks) for (const track of this.#tracks) track.track.dispose();
-      },
+      beforeDispose: () => {},
     });
   }
killedBy: Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] OptionalChaining
core/src/domain/motion.ts:61:9
     this.#lifecycle = new Lifecycle({
       beforeDispose: () => {
         this.pause();
-        this.#trigger?.detach();
+        this.#trigger.detach();
         if (this.#disposeTracks) for (const track of this.#tracks) track.track.dispose();
       },
killedBy: Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
statusReason: Cannot read properties of undefined (reading 'detach')

[Killed] ConditionalExpression
core/src/domain/motion.ts:62:13
       beforeDispose: () => {
         this.pause();
         this.#trigger?.detach();
-        if (this.#disposeTracks) for (const track of this.#tracks) track.track.dispose();
+        if (false) for (const track of this.#tracks) track.track.dispose();
       },
     });
killedBy: Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] ConditionalExpression
core/src/domain/motion.ts:62:13
       beforeDispose: () => {
         this.pause();
         this.#trigger?.detach();
-        if (this.#disposeTracks) for (const track of this.#tracks) track.track.dispose();
+        if (true) for (const track of this.#tracks) track.track.dispose();
       },
     });

[Killed] BlockStatement
core/src/domain/motion.ts:81:17
   schedule(): readonly number[] {
     return this.#tracks.map((_, index) => index * this.#stagger);
   }
-  mount(): void {
-    this.#lifecycle.mount();
-    if (this.#listenToClock) this.#subscribe();
-    this.#attachTrigger();
-  }
+  mount(): void {}
   play(): void {
     this.assertActive();
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
core/src/domain/motion.ts:83:9
   }
   mount(): void {
     this.#lifecycle.mount();
-    if (this.#listenToClock) this.#subscribe();
+    if (false) this.#subscribe();
     this.#attachTrigger();
   }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
core/src/domain/motion.ts:83:9
   }
   mount(): void {
     this.#lifecycle.mount();
-    if (this.#listenToClock) this.#subscribe();
+    if (true) this.#subscribe();
     this.#attachTrigger();
   }
killedBy: Engine keeps one clock owner while clock progress publishes once
statusReason: expected "subscribe" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
core/src/domain/motion.ts:88:48
   }
   play(): void {
     this.assertActive();
-    if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
+    if (this.#lifecycle.state === "created" || false) this.mount();
     this.#playing = true;
   }
killedBy: Motion composite pausing detaches the clock and play resubscribes without duplicate work
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
core/src/domain/motion.ts:91:17
     if (this.#lifecycle.state === "created" || this.#lifecycle.state === "detached") this.mount();
     this.#playing = true;
   }
-  pause(): void {
-    this.#playing = false;
-    for (const handle of this.#scheduled) handle.cancel();
-    this.#scheduled.clear();
-    this.#unsubscribe?.();
-    this.#unsubscribe = undefined;
-    this.#trigger?.detach();
-    this.#triggerAttached = false;
-    this.#lifecycle.detach();
-  }
+  pause(): void {}
   seek(progress: number): void {
     this.assertActive();
killedBy: Motion trigger types and clock ownership cancels queued trigger work when paused and does not duplicate on remount
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      0.2,

[Killed] OptionalChaining
core/src/domain/motion.ts:97:5
     this.#scheduled.clear();
     this.#unsubscribe?.();
     this.#unsubscribe = undefined;
-    this.#trigger?.detach();
+    this.#trigger.detach();
     this.#triggerAttached = false;
     this.#lifecycle.detach();
killedBy: Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
statusReason: Cannot read properties of undefined (reading 'detach')

[Killed] BooleanLiteral
core/src/domain/motion.ts:98:29
     this.#unsubscribe?.();
     this.#unsubscribe = undefined;
     this.#trigger?.detach();
-    this.#triggerAttached = false;
+    this.#triggerAttached = true;
     this.#lifecycle.detach();
   }
killedBy: Motion trigger types and clock ownership cancels queued trigger work when paused and does not duplicate on remount
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
core/src/domain/motion.ts:101:32
     this.#triggerAttached = false;
     this.#lifecycle.detach();
   }
-  seek(progress: number): void {
-    this.assertActive();
-    if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
-    this.#setProgress(Math.max(0, Math.min(1, progress)));
-  }
+  seek(progress: number): void {}
   signal(signal: TriggerSignal): void {
     this.assertActive();
killedBy: Motion composite clamps seek and rejects non-finite values
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
core/src/domain/motion.ts:103:9
   }
   seek(progress: number): void {
     this.assertActive();
-    if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
+    if (true) throw new TypeError("Motion progress must be finite.");
     this.#setProgress(Math.max(0, Math.min(1, progress)));
   }
killedBy: Motion composite clamps seek and rejects non-finite values
statusReason: Motion progress must be finite.

[Killed] MethodExpression
core/src/domain/motion.ts:104:23
   seek(progress: number): void {
     this.assertActive();
     if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
-    this.#setProgress(Math.max(0, Math.min(1, progress)));
+    this.#setProgress(Math.min(0, Math.min(1, progress)));
   }
   signal(signal: TriggerSignal): void {
killedBy: Motion composite clamps seek and rejects non-finite values
statusReason: expected +0 to be 1 // Object.is equality

[Survived] MethodExpression
core/src/domain/motion.ts:104:35
   seek(progress: number): void {
     this.assertActive();
     if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
-    this.#setProgress(Math.max(0, Math.min(1, progress)));
+    this.#setProgress(Math.max(0, Math.max(1, progress)));
   }
   signal(signal: TriggerSignal): void {

[Killed] BlockStatement
core/src/domain/motion.ts:106:39
     if (!Number.isFinite(progress)) throw new TypeError("Motion progress must be finite.");
     this.#setProgress(Math.max(0, Math.min(1, progress)));
   }
-  signal(signal: TriggerSignal): void {
-    this.assertActive();
-    this.#trigger?.signal(signal);
-  }
+  signal(signal: TriggerSignal): void {}
   reflow(): readonly number[] {
     this.assertActive();
killedBy: Motion trigger types and clock ownership manual signals use the same scheduled progress path
statusReason: expected "vi.fn()" to be called with arguments: [ 0.4 ]

Number of calls: 0

[Survived] OptionalChaining
core/src/domain/motion.ts:108:5
   }
   signal(signal: TriggerSignal): void {
     this.assertActive();
-    this.#trigger?.signal(signal);
+    this.#trigger.signal(signal);
   }
   reflow(): readonly number[] {

[NoCoverage] BlockStatement
core/src/domain/motion.ts:110:31
     this.assertActive();
     this.#trigger?.signal(signal);
   }
-  reflow(): readonly number[] {
-    this.assertActive();
-    return this.schedule();
-  }
+  reflow(): readonly number[] {}
   dispose(): void {
     this.#lifecycle.dispose();

[Killed] BlockStatement
core/src/domain/motion.ts:124:26
     if (this.#unsubscribe === undefined)
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
-  #attachTrigger(): void {
-    if (this.#trigger === undefined || this.#triggerAttached) return;
-    this.#trigger.attach((command) => this.#onTrigger(command));
-    this.#triggerAttached = true;
-  }
+  #attachTrigger(): void {}
   #onTrigger(command: TriggerCommand): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
killedBy: Motion trigger types and clock ownership manual signals use the same scheduled progress path
statusReason: expected "vi.fn()" to be called with arguments: [ 0.4 ]

Number of calls: 0

[Killed] LogicalOperator
core/src/domain/motion.ts:125:9
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
   #attachTrigger(): void {
-    if (this.#trigger === undefined || this.#triggerAttached) return;
+    if (this.#trigger === undefined && this.#triggerAttached) return;
     this.#trigger.attach((command) => this.#onTrigger(command));
     this.#triggerAttached = true;
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: Cannot read properties of undefined (reading 'attach')

[Killed] EqualityOperator
core/src/domain/motion.ts:125:9
       this.#unsubscribe = this.#clock.subscribe((event) => this.#onTick(event));
   }
   #attachTrigger(): void {
-    if (this.#trigger === undefined || this.#triggerAttached) return;
+    if (this.#trigger !== undefined || this.#triggerAttached) return;
     this.#trigger.attach((command) => this.#onTrigger(command));
     this.#triggerAttached = true;
killedBy: Motion trigger types and clock ownership manual signals use the same scheduled progress path
statusReason: expected "vi.fn()" to be called with arguments: [ 0.4 ]

Number of calls: 0

[Killed] ArrowFunction
core/src/domain/motion.ts:126:26
   }
   #attachTrigger(): void {
     if (this.#trigger === undefined || this.#triggerAttached) return;
-    this.#trigger.attach((command) => this.#onTrigger(command));
+    this.#trigger.attach(() => undefined);
     this.#triggerAttached = true;
   }
killedBy: Motion trigger types and clock ownership manual signals use the same scheduled progress path
statusReason: expected "vi.fn()" to be called with arguments: [ 0.4 ]

Number of calls: 0

[Survived] BooleanLiteral
core/src/domain/motion.ts:127:29
   #attachTrigger(): void {
     if (this.#trigger === undefined || this.#triggerAttached) return;
     this.#trigger.attach((command) => this.#onTrigger(command));
-    this.#triggerAttached = true;
+    this.#triggerAttached = false;
   }
   #onTrigger(command: TriggerCommand): void {

[Killed] BlockStatement
core/src/domain/motion.ts:129:45
     this.#trigger.attach((command) => this.#onTrigger(command));
     this.#triggerAttached = true;
   }
-  #onTrigger(command: TriggerCommand): void {
-    if (!this.#playing || this.#lifecycle.state !== "mounted") return;
-    if (command.setProgress !== undefined) {
-      const progress = command.setProgress;
-      const handle = this.#scheduler.schedule(() => {
-        this.#scheduled.delete(handle);
-        this.#setProgress(progress);
-      });
-      this.#scheduled.add(handle);
-    }
-  }
+  #onTrigger(command: TriggerCommand): void {}
   #onTick(event: ClockTick): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
killedBy: Motion trigger types and clock ownership manual signals use the same scheduled progress path
statusReason: expected "vi.fn()" to be called with arguments: [ 0.4 ]

Number of calls: 0

[Killed] ConditionalExpression
core/src/domain/motion.ts:130:9
     this.#triggerAttached = true;
   }
   #onTrigger(command: TriggerCommand): void {
-    if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+    if (true) return;
     if (command.setProgress !== undefined) {
       const progress = command.setProgress;
killedBy: Motion trigger types and clock ownership manual signals use the same scheduled progress path
statusReason: expected "vi.fn()" to be called with arguments: [ 0.4 ]

Number of calls: 0

[Killed] EqualityOperator
core/src/domain/motion.ts:130:27
     this.#triggerAttached = true;
   }
   #onTrigger(command: TriggerCommand): void {
-    if (!this.#playing || this.#lifecycle.state !== "mounted") return;
+    if (!this.#playing || this.#lifecycle.state === "mounted") return;
     if (command.setProgress !== undefined) {
       const progress = command.setProgress;
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] EqualityOperator
core/src/domain/motion.ts:131:9
   }
   #onTrigger(command: TriggerCommand): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
-    if (command.setProgress !== undefined) {
+    if (command.setProgress === undefined) {
       const progress = command.setProgress;
       const handle = this.#scheduler.schedule(() => {
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] ConditionalExpression
core/src/domain/motion.ts:131:9
   }
   #onTrigger(command: TriggerCommand): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
-    if (command.setProgress !== undefined) {
+    if (false) {
       const progress = command.setProgress;
       const handle = this.#scheduler.schedule(() => {
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] BlockStatement
core/src/domain/motion.ts:133:53
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
     if (command.setProgress !== undefined) {
       const progress = command.setProgress;
-      const handle = this.#scheduler.schedule(() => {
-        this.#scheduled.delete(handle);
-        this.#setProgress(progress);
-      });
+      const handle = this.#scheduler.schedule(() => {});
       this.#scheduled.add(handle);
     }
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] BlockStatement
core/src/domain/motion.ts:140:35
       this.#scheduled.add(handle);
     }
   }
-  #onTick(event: ClockTick): void {
-    if (!this.#playing || this.#lifecycle.state !== "mounted") return;
-    const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
-    const handle = this.#scheduler.schedule(() => {
-      this.#scheduled.delete(handle);
-      this.#setProgress(next);
-    });
-    this.#scheduled.add(handle);
-  }
+  #onTick(event: ClockTick): void {}
   #setProgress(progress: number): void {
     this.#position = progress;
killedBy: Motion trigger types and clock ownership advances from the one injected clock and rejects control after disposal
statusReason: expected +0 to be close to 0.25, received difference is 0.25, but expected 5e-13

[Killed] BlockStatement
core/src/domain/motion.ts:143:51
   #onTick(event: ClockTick): void {
     if (!this.#playing || this.#lifecycle.state !== "mounted") return;
     const next = Math.min(1, this.#position + this.#progressDelta(event.delta));
-    const handle = this.#scheduler.schedule(() => {
-      this.#scheduled.delete(handle);
-      this.#setProgress(next);
-    });
+    const handle = this.#scheduler.schedule(() => {});
     this.#scheduled.add(handle);
   }
killedBy: Motion composite plays through one clock subscription and scheduler jobs
statusReason: expected +0 to be 0.25 // Object.is equality

[Killed] BlockStatement
core/src/domain/motion.ts:149:40
     });
     this.#scheduled.add(handle);
   }
-  #setProgress(progress: number): void {
-    this.#position = progress;
-    for (const entry of this.#tracks) entry.track.setProgress(progress);
-    this.#invalidate(progress);
-  }
+  #setProgress(progress: number): void {}
   #progressDelta(delta: number): number {
     const duration = this.#tracks.reduce(
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] MethodExpression
core/src/domain/motion.ts:156:27
   }
   #progressDelta(delta: number): number {
     const duration = this.#tracks.reduce(
-      (maximum, entry) => Math.max(maximum, entry.duration ?? 1),
+      (maximum, entry) => Math.min(maximum, entry.duration ?? 1),
       1,
     );
killedBy: Motion composite converts clock time into normalized progress using authored duration
statusReason: expected 0.5 to be 0.25 // Object.is equality
