[Killed] BlockStatement
packages/core/src/engine.ts:39:18
 function createHandle(
   runtime: RuntimeLike,
   signal: (motionId: string, signal: TriggerSignal) => void,
-): ProjectHandle {
-  return {
-    mount: (nodeId, instance = {}) => runtime.mount(nodeId, instance),
-    unmount: (nodeId) => runtime.unmount(nodeId),
-    seek: (nodeId, progress) => runtime.seek(nodeId, progress),
-    signal,
-    subscribe: (nodeId, listener) => runtime.graph.registry.subscribeNode(nodeId, listener),
-    dispose: () => runtime.dispose(),
-  };
-}
+): ProjectHandle {}
 function describeDiagnostics(diagnostics: readonly Diagnostic[]): string {
   return diagnostics
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'mount')

[Killed] ArrowFunction
packages/core/src/engine.ts:45:16
     unmount: (nodeId) => runtime.unmount(nodeId),
     seek: (nodeId, progress) => runtime.seek(nodeId, progress),
     signal,
-    subscribe: (nodeId, listener) => runtime.graph.registry.subscribeNode(nodeId, listener),
+    subscribe: () => undefined,
     dispose: () => runtime.dispose(),
   };
killedBy: Engine publishes a progress change through the public project handle
statusReason: expected undefined to be close to 0.6, received difference is NaN, but expected 5e-13

[Killed] EqualityOperator
packages/core/src/engine.ts:56:24
 }
 function assertValidProject(project: unknown): ProjectDefinition {
   const result = validateV5(project);
-  if (!result.valid || result.value === null)
+  if (!result.valid || result.value !== null)
     throw new TypeError(
       result.diagnostics.length === 0
killedBy: Engine publishes a progress change through the public project handle
statusReason: Project failed v5 validation.

[Killed] BlockStatement
packages/core/src/engine.ts:83:51
       { id: string; duration?: number; keyframes?: Readonly<Record<string, unknown>> }
     >();
     const motionTrackIds = new Map<string, readonly string[]>();
-    for (const motion of acceptedProject.motions) {
-      const ids = motion.tracks.map((track) => qualifyMotionTrack(motion.id, track.id).value);
-      motionTrackIds.set(motion.id, ids);
-      for (const track of motion.tracks)
-        nodes.set(qualifyMotionTrack(motion.id, track.id).value, { ...track, id: track.id });
-    }
+    for (const motion of acceptedProject.motions) {}
     for (const track of acceptedProject.freeTracks ?? [])
       nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
killedBy: Engine product-load validation (X-1 follow-up) resolves authored plugin ownership during load, not on the first seek
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
packages/core/src/engine.ts:84:37
     >();
     const motionTrackIds = new Map<string, readonly string[]>();
     for (const motion of acceptedProject.motions) {
-      const ids = motion.tracks.map((track) => qualifyMotionTrack(motion.id, track.id).value);
+      const ids = motion.tracks.map(() => undefined);
       motionTrackIds.set(motion.id, ids);
       for (const track of motion.tracks)
killedBy: Engine publishes a progress change through the public project handle
statusReason: Unknown graph node "undefined".

[Killed] LogicalOperator
packages/core/src/engine.ts:89:25
       for (const track of motion.tracks)
         nodes.set(qualifyMotionTrack(motion.id, track.id).value, { ...track, id: track.id });
     }
-    for (const track of acceptedProject.freeTracks ?? [])
+    for (const track of acceptedProject.freeTracks && [])
       nodes.set(qualifyFreeTrack(track.id).value, { ...track, id: track.id });
     const compile = (nodeId: string): Track => {
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] StringLiteral
packages/core/src/engine.ts:96:20
       if (existing) return existing;
       const definition = nodes.get(nodeId);
       if (!definition) throw new TypeError(`Unknown graph node \"${nodeId}\".`);
-      const path = `${nodeId}.keyframes`;
+      const path = ``;
       const resolved = this.#plugins?.resolveForKeyframes(definition.keyframes ?? {}, path, {
         id: nodeId,

[Killed] ConditionalExpression
packages/core/src/engine.ts:107:46
       };
       const keyframeCompilation = compilePercentKeyframes(preparedKeyframes, path);
       const diagnostics = [...(resolved?.diagnostics ?? []), ...keyframeCompilation.diagnostics];
-      if (diagnostics.some(({ severity }) => severity === "error"))
+      if (diagnostics.some(({ severity }) => false))
         throw new TypeError(describeDiagnostics(diagnostics));
       const track = new Track({
killedBy: X-3 contribution through the product load path rejects malformed contributions during Engine.load
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
packages/core/src/engine.ts:134:53
           };
         };
       let runtime: ProjectRuntime;
-      runtime = new ProjectRuntime(acceptedProject, {
-        clock: this.#options.clock,
-        scheduler: this.#options.scheduler,
-        compose,
-        setProgress: (nodeId, progress) => tracks.get(nodeId)!.setProgress(progress),
-        disposeComposition: () => {
-          for (const motion of motions.values()) motion.dispose();
-          motions.clear();
-          for (const track of tracks.values()) track.dispose();
-          tracks.clear();
-        },
-      });
+      runtime = new ProjectRuntime(acceptedProject, {});
       for (const motionDefinition of acceptedProject.motions) {
         const ids = motionTrackIds.get(motionDefinition.id) ?? [];
killedBy: X-3 contribution through the product load path passes contribution context and creates the prepared timeline at load
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Survived] BlockStatement
packages/core/src/engine.ts:139:35
         scheduler: this.#options.scheduler,
         compose,
         setProgress: (nodeId, progress) => tracks.get(nodeId)!.setProgress(progress),
-        disposeComposition: () => {
-          for (const motion of motions.values()) motion.dispose();
-          motions.clear();
-          for (const track of tracks.values()) track.dispose();
-          tracks.clear();
-        },
+        disposeComposition: () => {},
       });
       for (const motionDefinition of acceptedProject.motions) {

[Killed] BlockStatement
packages/core/src/engine.ts:146:63
           tracks.clear();
         },
       });
-      for (const motionDefinition of acceptedProject.motions) {
-        const ids = motionTrackIds.get(motionDefinition.id) ?? [];
-        const entries = ids.map((id) => {
-          const track = tracks.get(id);
-          if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
-          const definition = nodes.get(id);
-          return { id, track, duration: definition?.duration };
-        });
-        const motion = new Motion({
-          clock: this.#options.clock,
-          scheduler: this.#options.scheduler,
-          tracks: entries,
-          trigger: createTrigger(motionDefinition.trigger.type),
-          disposeTracks: false,
-          listenToClock: false,
-          invalidate: (progress) => {
-            const first = ids[0];
-            if (first) runtime.seek(first, progress);
-          },
-          stagger: motionDefinition.stagger,
-        });
-        motion.play();
-        motions.set(motionDefinition.id, motion);
-      }
+      for (const motionDefinition of acceptedProject.motions) {}
       return createHandle(runtime, (motionId, signal) => {
         const motion = motions.get(motionId);
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: Unknown motion "hero".

[Killed] LogicalOperator
packages/core/src/engine.ts:147:21
         },
       });
       for (const motionDefinition of acceptedProject.motions) {
-        const ids = motionTrackIds.get(motionDefinition.id) ?? [];
+        const ids = motionTrackIds.get(motionDefinition.id) && [];
         const entries = ids.map((id) => {
           const track = tracks.get(id);
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[NoCoverage] ArrayDeclaration
packages/core/src/engine.ts:147:64
         },
       });
       for (const motionDefinition of acceptedProject.motions) {
-        const ids = motionTrackIds.get(motionDefinition.id) ?? [];
+        const ids = motionTrackIds.get(motionDefinition.id) ?? ["Stryker was here"];
         const entries = ids.map((id) => {
           const track = tracks.get(id);

[Killed] BlockStatement
packages/core/src/engine.ts:148:41
       });
       for (const motionDefinition of acceptedProject.motions) {
         const ids = motionTrackIds.get(motionDefinition.id) ?? [];
-        const entries = ids.map((id) => {
-          const track = tracks.get(id);
-          if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
-          const definition = nodes.get(id);
-          return { id, track, duration: definition?.duration };
-        });
+        const entries = ids.map((id) => {});
         const motion = new Motion({
           clock: this.#options.clock,
killedBy: Engine publishes a progress change through the public project handle
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
packages/core/src/engine.ts:150:15
         const ids = motionTrackIds.get(motionDefinition.id) ?? [];
         const entries = ids.map((id) => {
           const track = tracks.get(id);
-          if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
+          if (true) throw new TypeError(`Unknown graph node \"${id}\".`);
           const definition = nodes.get(id);
           return { id, track, duration: definition?.duration };
killedBy: Engine publishes a progress change through the public project handle
statusReason: Unknown graph node "hero/arm".

[Killed] BooleanLiteral
packages/core/src/engine.ts:150:15
         const ids = motionTrackIds.get(motionDefinition.id) ?? [];
         const entries = ids.map((id) => {
           const track = tracks.get(id);
-          if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
+          if (track) throw new TypeError(`Unknown graph node \"${id}\".`);
           const definition = nodes.get(id);
           return { id, track, duration: definition?.duration };
killedBy: Engine publishes a progress change through the public project handle
statusReason: Unknown graph node "hero/arm".

[Survived] OptionalChaining
packages/core/src/engine.ts:152:41
           const track = tracks.get(id);
           if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
           const definition = nodes.get(id);
-          return { id, track, duration: definition?.duration };
+          return { id, track, duration: definition.duration };
         });
         const motion = new Motion({

[Killed] ObjectLiteral
packages/core/src/engine.ts:152:18
           const track = tracks.get(id);
           if (!track) throw new TypeError(`Unknown graph node \"${id}\".`);
           const definition = nodes.get(id);
-          return { id, track, duration: definition?.duration };
+          return {};
         });
         const motion = new Motion({
killedBy: Engine publishes a progress change through the public project handle
statusReason: Duplicate Motion track id: undefined.

[Survived] BooleanLiteral
packages/core/src/engine.ts:159:26
           scheduler: this.#options.scheduler,
           tracks: entries,
           trigger: createTrigger(motionDefinition.trigger.type),
-          disposeTracks: false,
+          disposeTracks: true,
           listenToClock: false,
           invalidate: (progress) => {

[Killed] BooleanLiteral
packages/core/src/engine.ts:160:26
           tracks: entries,
           trigger: createTrigger(motionDefinition.trigger.type),
           disposeTracks: false,
-          listenToClock: false,
+          listenToClock: true,
           invalidate: (progress) => {
             const first = ids[0];
killedBy: Engine keeps one clock owner while clock progress publishes once
statusReason: expected "subscribe" to be called 1 times, but got 2 times

[Killed] BlockStatement
packages/core/src/engine.ts:161:37
           trigger: createTrigger(motionDefinition.trigger.type),
           disposeTracks: false,
           listenToClock: false,
-          invalidate: (progress) => {
-            const first = ids[0];
-            if (first) runtime.seek(first, progress);
-          },
+          invalidate: (progress) => {},
           stagger: motionDefinition.stagger,
         });
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] ConditionalExpression
packages/core/src/engine.ts:163:17
           listenToClock: false,
           invalidate: (progress) => {
             const first = ids[0];
-            if (first) runtime.seek(first, progress);
+            if (false) runtime.seek(first, progress);
           },
           stagger: motionDefinition.stagger,
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Survived] ConditionalExpression
packages/core/src/engine.ts:163:17
           listenToClock: false,
           invalidate: (progress) => {
             const first = ids[0];
-            if (first) runtime.seek(first, progress);
+            if (true) runtime.seek(first, progress);
           },
           stagger: motionDefinition.stagger,

[Killed] BlockStatement
packages/core/src/engine.ts:170:58
         motion.play();
         motions.set(motionDefinition.id, motion);
       }
-      return createHandle(runtime, (motionId, signal) => {
-        const motion = motions.get(motionId);
-        if (!motion) throw new TypeError(`Unknown motion \"${motionId}\".`);
-        motion.signal(signal);
-      });
+      return createHandle(runtime, (motionId, signal) => {});
     } catch (error) {
       for (const motion of motions.values()) motion.dispose();
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 5e-13

[Killed] BooleanLiteral
packages/core/src/engine.ts:172:13
       }
       return createHandle(runtime, (motionId, signal) => {
         const motion = motions.get(motionId);
-        if (!motion) throw new TypeError(`Unknown motion \"${motionId}\".`);
+        if (motion) throw new TypeError(`Unknown motion \"${motionId}\".`);
         motion.signal(signal);
       });
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: Unknown motion "hero".

[Killed] ConditionalExpression
packages/core/src/engine.ts:172:13
       }
       return createHandle(runtime, (motionId, signal) => {
         const motion = motions.get(motionId);
-        if (!motion) throw new TypeError(`Unknown motion \"${motionId}\".`);
+        if (true) throw new TypeError(`Unknown motion \"${motionId}\".`);
         motion.signal(signal);
       });
killedBy: Engine routes a manual trigger through the public handle into a published patch
statusReason: Unknown motion "hero".

[Killed] BlockStatement
packages/core/src/engine.ts:175:21
         if (!motion) throw new TypeError(`Unknown motion \"${motionId}\".`);
         motion.signal(signal);
       });
-    } catch (error) {
-      for (const motion of motions.values()) motion.dispose();
-      for (const track of tracks.values()) track.dispose();
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: X-3 contribution through the product load path rejects malformed contributions during Engine.load
statusReason: expected [Function] to throw an error
